[Killed] BlockStatement
src/domain/errors.ts:19:13
 export function toAppError(
   error: unknown,
   fallbackMessage: string = 'Unknown error',
-): AppError {
-  if (error instanceof Error) {
-    return {
-      code: 'UNKNOWN',
-      message: error.message || fallbackMessage,
-      cause: error,
-    };
-  }
-  if (typeof error === 'string') {
-    return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
-  }
-  return { code: 'UNKNOWN', message: fallbackMessage, cause: error };
-}
+): AppError {}
 
killedBy: domain/errors maps Error instances with message and cause
statusReason: expected undefined to deeply equal { code: 'UNKNOWN', …(2) }

[Killed] ConditionalExpression
src/domain/errors.ts:20:7
   error: unknown,
   fallbackMessage: string = 'Unknown error',
 ): AppError {
-  if (error instanceof Error) {
+  if (false) {
     return {
       code: 'UNKNOWN',
killedBy: domain/errors maps Error instances with message and cause
statusReason: expected { code: 'UNKNOWN', …(2) } to deeply equal { code: 'UNKNOWN', …(2) }

[Killed] ConditionalExpression
src/domain/errors.ts:20:7
   error: unknown,
   fallbackMessage: string = 'Unknown error',
 ): AppError {
-  if (error instanceof Error) {
+  if (true) {
     return {
       code: 'UNKNOWN',
killedBy: domain/errors maps string errors and falls back for empty string
statusReason: expected 'fallback' to be 'bad-input' // Object.is equality

[Killed] StringLiteral
src/domain/errors.ts:22:13
 ): AppError {
   if (error instanceof Error) {
     return {
-      code: 'UNKNOWN',
+      code: "",
       message: error.message || fallbackMessage,
       cause: error,
killedBy: domain/errors maps Error instances with message and cause
statusReason: expected { code: '', message: 'boom', …(1) } to deeply equal { code: 'UNKNOWN', …(2) }

[Killed] ConditionalExpression
src/domain/errors.ts:23:16
   if (error instanceof Error) {
     return {
       code: 'UNKNOWN',
-      message: error.message || fallbackMessage,
+      message: false,
       cause: error,
     };
killedBy: domain/errors maps Error instances with message and cause
statusReason: expected { code: 'UNKNOWN', …(2) } to deeply equal { code: 'UNKNOWN', …(2) }

[Killed] ConditionalExpression
src/domain/errors.ts:23:16
   if (error instanceof Error) {
     return {
       code: 'UNKNOWN',
-      message: error.message || fallbackMessage,
+      message: true,
       cause: error,
     };
killedBy: domain/errors maps Error instances with message and cause
statusReason: expected { Object (code, message, ...) } to deeply equal { code: 'UNKNOWN', …(2) }

[Killed] EqualityOperator
src/domain/errors.ts:27:7
       cause: error,
     };
   }
-  if (typeof error === 'string') {
+  if (typeof error !== 'string') {
     return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
   }
killedBy: domain/errors maps string errors and falls back for empty string
statusReason: expected 'fallback' to be 'bad-input' // Object.is equality

[Killed] BlockStatement
src/domain/errors.ts:27:34
       cause: error,
     };
   }
-  if (typeof error === 'string') {
-    return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
-  }
+  if (typeof error === 'string') {}
   return { code: 'UNKNOWN', message: fallbackMessage, cause: error };
 }
killedBy: domain/errors maps string errors and falls back for empty string
statusReason: expected 'fallback' to be 'bad-input' // Object.is equality

[Killed] LogicalOperator
src/domain/errors.ts:28:40
     };
   }
   if (typeof error === 'string') {
-    return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
+    return { code: 'UNKNOWN', message: error && fallbackMessage, cause: error };
   }
   return { code: 'UNKNOWN', message: fallbackMessage, cause: error };
killedBy: domain/errors maps string errors and falls back for empty string
statusReason: expected 'fallback' to be 'bad-input' // Object.is equality

[Killed] ConditionalExpression
src/domain/errors.ts:28:40
     };
   }
   if (typeof error === 'string') {
-    return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
+    return { code: 'UNKNOWN', message: true, cause: error };
   }
   return { code: 'UNKNOWN', message: fallbackMessage, cause: error };
killedBy: domain/errors maps string errors and falls back for empty string
statusReason: expected true to be 'bad-input' // Object.is equality

[Killed] StringLiteral
src/domain/errors.ts:30:18
   if (typeof error === 'string') {
     return { code: 'UNKNOWN', message: error || fallbackMessage, cause: error };
   }
-  return { code: 'UNKNOWN', message: fallbackMessage, cause: error };
+  return { code: "", message: fallbackMessage, cause: error };
 }
 
killedBy: domain/errors handles unknown error values with fallback message
statusReason: expected { code: '', message: 'fallback', …(1) } to deeply equal { code: 'UNKNOWN', …(2) }
