[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:270:7
 
     const updatedHistory = [...state.completionHistory, completionRecord];
     const historyToPersist =
-      storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
+      true ? [completionRecord] : updatedHistory;
 
     let updatedChains = updateChainsForSuccess(
killedBy: createCompletionHandlers should keep local cleanup path when activeSessionId is set
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:270:7
 
     const updatedHistory = [...state.completionHistory, completionRecord];
     const historyToPersist =
-      storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
+      false ? [completionRecord] : updatedHistory;
 
     let updatedChains = updateChainsForSuccess(
killedBy: createCompletionHandlers should avoid supabase cleanup helper when activeSessionId is null
statusReason: expected "vi.fn()" to be called with arguments: [ [ ObjectContaining{…} ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] ArithmeticOperator
hooks/domains/sessions/completion.ts:281:7
       updatedChains,
       chain,
       tr,
-      state.chainsRevision + 1,
+      state.chainsRevision - 1,
     );
     updatedChains = groupCycleResult.updatedChains;
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, 4 ]

Received: 

  1st vi.fn() call:

  [
-   Any<Array>,

[Killed] StringLiteral
hooks/domains/sessions/completion.ts:286:58
     updatedChains = groupCycleResult.updatedChains;
 
     persistChains(updatedChains, '完成任务时保存链条数据失败');
-    persistCompletionHistoryAndCleanup(historyToPersist, 'completion');
+    persistCompletionHistoryAndCleanup(historyToPersist, "");
 
     if (completionRecord.actualDuration) {
killedBy: createCompletionHandlers should emit cleanup side-effects even when supabase persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "SESSIONS",

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:288:9
     persistChains(updatedChains, '完成任务时保存链条数据失败');
     persistCompletionHistoryAndCleanup(historyToPersist, 'completion');
 
-    if (completionRecord.actualDuration) {
+    if (false) {
       storage
         .updateTaskTimeStats(chain.id, completionRecord.actualDuration)
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: expected "vi.fn()" to be called with arguments: [ 'chain-1', 25 ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/completion.ts:288:42
     persistChains(updatedChains, '完成任务时保存链条数据失败');
     persistCompletionHistoryAndCleanup(historyToPersist, 'completion');
 
-    if (completionRecord.actualDuration) {
-      storage
-        .updateTaskTimeStats(chain.id, completionRecord.actualDuration)
-        .catch((error) => {
-          logger.error(
-            'SESSIONS',
-            'Failed to update task time stats after completion',
-            { chainId: chain.id },
-            normalizeUnknownError(error),
-          );
-        });
-    }
+    if (completionRecord.actualDuration) {}
 
     if (onPetTaskCompleted && actualDuration) {
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: expected "vi.fn()" to be called with arguments: [ 'chain-1', 25 ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/completion.ts:291:27
     if (completionRecord.actualDuration) {
       storage
         .updateTaskTimeStats(chain.id, completionRecord.actualDuration)
-        .catch((error) => {
-          logger.error(
-            'SESSIONS',
-            'Failed to update task time stats after completion',
-            { chainId: chain.id },
-            normalizeUnknownError(error),
-          );
-        });
+        .catch((error) => {});
     }
 
killedBy: createCompletionHandlers should still update state when persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "SESSIONS",

[Killed] BlockStatement
hooks/domains/sessions/completion.ts:301:47
         });
     }
 
-    if (onPetTaskCompleted && actualDuration) {
-      onPetTaskCompleted(actualDuration, true);
-    }
+    if (onPetTaskCompleted && actualDuration) {}
 
     emitRsipTaskEvent({
killedBy: createCompletionHandlers should use forward timer for durationless chains and invoke pet callback
statusReason: expected "vi.fn()" to be called with arguments: [ 3, true ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:301:9
         });
     }
 
-    if (onPetTaskCompleted && actualDuration) {
+    if (true) {
       onPetTaskCompleted(actualDuration, true);
     }
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: onPetTaskCompleted is not a function

[Killed] BooleanLiteral
hooks/domains/sessions/completion.ts:302:42
     }
 
     if (onPetTaskCompleted && actualDuration) {
-      onPetTaskCompleted(actualDuration, true);
+      onPetTaskCompleted(actualDuration, false);
     }
 
killedBy: createCompletionHandlers should use forward timer for durationless chains and invoke pet callback
statusReason: expected "vi.fn()" to be called with arguments: [ 3, true ]

Received: 

  1st vi.fn() call:

  [
    3,

[Survived] ConditionalExpression
hooks/domains/sessions/completion.ts:308:18
     emitRsipTaskEvent({
       event: 'task_completed',
       chainId: chain.id,
-      chainKind: chain.type === 'group' ? 'group' : 'unit',
+      chainKind: true ? 'group' : 'unit',
       occurredAt: completedAt,
     });

[Survived] EqualityOperator
hooks/domains/sessions/completion.ts:308:18
     emitRsipTaskEvent({
       event: 'task_completed',
       chainId: chain.id,
-      chainKind: chain.type === 'group' ? 'group' : 'unit',
+      chainKind: chain.type !== 'group' ? 'group' : 'unit',
       occurredAt: completedAt,
     });

[Survived] ConditionalExpression
hooks/domains/sessions/completion.ts:312:9
       occurredAt: completedAt,
     });
 
-    if (groupCycleResult.completedGroupId) {
+    if (false) {
       emitRsipTaskEvent({
         event: 'group_cycle_completed',

[Survived] ConditionalExpression
hooks/domains/sessions/completion.ts:312:9
       occurredAt: completedAt,
     });
 
-    if (groupCycleResult.completedGroupId) {
+    if (true) {
       emitRsipTaskEvent({
         event: 'group_cycle_completed',

[Survived] ObjectLiteral
hooks/domains/sessions/completion.ts:313:25
     });
 
     if (groupCycleResult.completedGroupId) {
-      emitRsipTaskEvent({
-        event: 'group_cycle_completed',
-        chainId: groupCycleResult.completedGroupId,
-        chainKind: 'group',
-        occurredAt: completedAt,
-      });
+      emitRsipTaskEvent({});
     }
 

[Survived] StringLiteral
hooks/domains/sessions/completion.ts:314:16
 
     if (groupCycleResult.completedGroupId) {
       emitRsipTaskEvent({
-        event: 'group_cycle_completed',
+        event: "",
         chainId: groupCycleResult.completedGroupId,
         chainKind: 'group',

[Survived] StringLiteral
hooks/domains/sessions/completion.ts:316:20
       emitRsipTaskEvent({
         event: 'group_cycle_completed',
         chainId: groupCycleResult.completedGroupId,
-        chainKind: 'group',
+        chainKind: "",
         occurredAt: completedAt,
       });

[Killed] ArrowFunction
hooks/domains/sessions/completion.ts:321:14
       });
     }
 
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-      activeSession: null,
-      completionHistory: updatedHistory,
-      currentView: 'dashboard',
-    }));
+    setState(() => undefined);
   };
 
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: Cannot read properties of undefined (reading 'chains')

[Killed] ArithmeticOperator
hooks/domains/sessions/completion.ts:324:23
     setState((prev) => ({
       ...prev,
       chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
+      chainsRevision: prev.chainsRevision - 1,
       activeSession: null,
       completionHistory: updatedHistory,
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ArrowFunction
hooks/domains/sessions/completion.ts:336:7
     if (!activeSession) return;
 
     const chain = state.chains.find(
-      (item) => item.id === activeSession.chainId,
+      () => undefined,
     );
     if (!chain) return;
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected "vi.fn()" to be called with arguments: [ 'interrupt-chain_1769950800000' ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:338:9
     const chain = state.chains.find(
       (item) => item.id === activeSession.chainId,
     );
-    if (!chain) return;
+    if (false) return;
 
     if (chain.isDurationless) {
killedBy: createCompletionHandlers should no-op when completing or interrupting without active session / chain
statusReason: Cannot read properties of undefined (reading 'isDurationless')

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:340:9
     );
     if (!chain) return;
 
-    if (chain.isDurationless) {
+    if (false) {
       const sessionId = `${activeSession.chainId}_${activeSession.startedAt.getTime()}`;
       forwardTimerManager.clearTimer(sessionId);
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected "vi.fn()" to be called with arguments: [ 'interrupt-chain_1769950800000' ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:340:9
     );
     if (!chain) return;
 
-    if (chain.isDurationless) {
+    if (true) {
       const sessionId = `${activeSession.chainId}_${activeSession.startedAt.getTime()}`;
       forwardTimerManager.clearTimer(sessionId);
killedBy: createCompletionHandlers should use default interrupt reason when reason is not provided
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "interrupt-default-reason_1769950800000",

[Killed] StringLiteral
hooks/domains/sessions/completion.ts:341:25
     if (!chain) return;
 
     if (chain.isDurationless) {
-      const sessionId = `${activeSession.chainId}_${activeSession.startedAt.getTime()}`;
+      const sessionId = ``;
       forwardTimerManager.clearTimer(sessionId);
     }
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected "vi.fn()" to be called with arguments: [ 'interrupt-chain_1769950800000' ]

Received: 

  1st vi.fn() call:

  [
-   "interrupt-chain_1769950800000",

[Killed] ObjectLiteral
hooks/domains/sessions/completion.ts:345:49
       forwardTimerManager.clearTimer(sessionId);
     }
 
-    const completionRecord: CompletionHistory = {
-      chainId: chain.id,
-      completedAt: new Date(),
-      duration: activeSession.duration,
-      wasSuccessful: false,
-      reasonForFailure: reason || '用户主动中断',
-      actualDuration: activeSession.duration,
-      isForwardTimed: Boolean(chain.isDurationless),
-    };
+    const completionRecord: CompletionHistory = {};
 
     const updatedHistory = [...state.completionHistory, completionRecord];
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected {} to match object { chainId: 'interrupt-chain', …(2) }

[Killed] BooleanLiteral
hooks/domains/sessions/completion.ts:349:22
       chainId: chain.id,
       completedAt: new Date(),
       duration: activeSession.duration,
-      wasSuccessful: false,
+      wasSuccessful: true,
       reasonForFailure: reason || '用户主动中断',
       actualDuration: activeSession.duration,
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected { chainId: 'interrupt-chain', …(6) } to match object { chainId: 'interrupt-chain', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
hooks/domains/sessions/completion.ts:350:25
       completedAt: new Date(),
       duration: activeSession.duration,
       wasSuccessful: false,
-      reasonForFailure: reason || '用户主动中断',
+      reasonForFailure: false,
       actualDuration: activeSession.duration,
       isForwardTimed: Boolean(chain.isDurationless),
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected { chainId: 'interrupt-chain', …(6) } to match object { chainId: 'interrupt-chain', …(2) }
(4 matching properties omitted from actual)

[Killed] LogicalOperator
hooks/domains/sessions/completion.ts:350:25
       completedAt: new Date(),
       duration: activeSession.duration,
       wasSuccessful: false,
-      reasonForFailure: reason || '用户主动中断',
+      reasonForFailure: reason && '用户主动中断',
       actualDuration: activeSession.duration,
       isForwardTimed: Boolean(chain.isDurationless),
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected { chainId: 'interrupt-chain', …(6) } to match object { chainId: 'interrupt-chain', …(2) }
(4 matching properties omitted from actual)

[Killed] ArrayDeclaration
hooks/domains/sessions/completion.ts:355:28
       isForwardTimed: Boolean(chain.isDurationless),
     };
 
-    const updatedHistory = [...state.completionHistory, completionRecord];
+    const updatedHistory = [];
     const historyToPersist =
       storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected undefined to match object { chainId: 'interrupt-chain', …(2) }

[Killed] EqualityOperator
hooks/domains/sessions/completion.ts:357:7
 
     const updatedHistory = [...state.completionHistory, completionRecord];
     const historyToPersist =
-      storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
+      storage.kind !== 'supabase' ? [completionRecord] : updatedHistory;
 
     let updatedChains = updateChainsForFailure(state.chains, chain.id);
killedBy: createCompletionHandlers should persist full interrupt history for local storage when activeSessionId is present
statusReason: expected [ { …(7) } ] to have a length of 2 but got 1

[Killed] LogicalOperator
hooks/domains/sessions/completion.ts:360:9
       storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
 
     let updatedChains = updateChainsForFailure(state.chains, chain.id);
-    if (chain.parentId && chain.type !== 'group') {
+    if (chain.parentId || chain.type !== 'group') {
       logger.debug(
         'SESSIONS',
killedBy: createCompletionHandlers should not reset group completion count when interrupted chain itself is a group
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Array [

[Killed] EqualityOperator
hooks/domains/sessions/completion.ts:360:27
       storage.kind === 'supabase' ? [completionRecord] : updatedHistory;
 
     let updatedChains = updateChainsForFailure(state.chains, chain.id);
-    if (chain.parentId && chain.type !== 'group') {
+    if (chain.parentId && chain.type === 'group') {
       logger.debug(
         'SESSIONS',
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, 'group-9' ]

Number of calls: 0

[Killed] StringLiteral
hooks/domains/sessions/completion.ts:363:9
     if (chain.parentId && chain.type !== 'group') {
       logger.debug(
         'SESSIONS',
-        `任务 ${chain.name} 失败/中断，重置任务群完成计数`,
+        ``,
       );
       updatedChains = resetGroupCompletionCount(updatedChains, chain.parentId);
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected 0 to be greater than 0

[Survived] ObjectLiteral
hooks/domains/sessions/completion.ts:371:23
     persistChains(updatedChains, '中断任务时保存链条数据失败');
     persistCompletionHistoryAndCleanup(historyToPersist, 'interrupt');
 
-    emitRsipTaskEvent({
-      event: 'task_interrupted',
-      chainId: chain.id,
-      chainKind: chain.type === 'group' ? 'group' : 'unit',
-      occurredAt: completionRecord.completedAt,
-    });
+    emitRsipTaskEvent({});
 
     setState((prev) => ({

[Survived] StringLiteral
hooks/domains/sessions/completion.ts:372:14
     persistCompletionHistoryAndCleanup(historyToPersist, 'interrupt');
 
     emitRsipTaskEvent({
-      event: 'task_interrupted',
+      event: "",
       chainId: chain.id,
       chainKind: chain.type === 'group' ? 'group' : 'unit',

[Killed] StringLiteral
hooks/domains/sessions/completion.ts:384:20
       chainsRevision: prev.chainsRevision + 1,
       activeSession: null,
       completionHistory: updatedHistory,
-      currentView: 'dashboard',
+      currentView: "",
     }));
   };
killedBy: createCompletionHandlers should reset streak and clear timer when interrupting a durationless session
statusReason: expected '' to be 'dashboard' // Object.is equality

[Killed] ObjectLiteral
hooks/domains/sessions/completion.ts:388:10
     }));
   };
 
-  return { handleCompleteSession, handleInterruptSession };
+  return {};
 }
 
killedBy: createCompletionHandlers should update local state and persist completion when session completes
statusReason: handleCompleteSession is not a function
