[Killed] BlockStatement
hooks/domains/sessions/pauseResume.ts:18:36
   setState,
   storage,
 }: CreatePauseResumeHandlersParams) {
-  const handlePauseSession = () => {
-    const activeSession = state.activeSession;
-    if (!activeSession) return;
-
-    const updatedSession = {
-      ...activeSession,
-      isPaused: true,
-      pausedAt: new Date(),
-    };
-
-    storage.saveActiveSession(updatedSession).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist paused session',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    });
-
-    setState((prev) => ({
-      ...prev,
-      activeSession: updatedSession,
-    }));
-  };
+  const handlePauseSession = () => {};
 
   const handleResumeSession = () => {
killedBy: createPauseResumeHandlers should pause active session and persist updated state
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/pauseResume.ts:20:9
 }: CreatePauseResumeHandlersParams) {
   const handlePauseSession = () => {
     const activeSession = state.activeSession;
-    if (!activeSession) return;
+    if (false) return;
 
     const updatedSession = {
killedBy: createPauseResumeHandlers should no-op without active session or without pausedAt
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] BooleanLiteral
hooks/domains/sessions/pauseResume.ts:24:17
 
     const updatedSession = {
       ...activeSession,
-      isPaused: true,
+      isPaused: false,
       pausedAt: new Date(),
     };
killedBy: createPauseResumeHandlers should pause active session and persist updated state
statusReason: expected { chainId: 'chain-1', …(5) } to match object { isPaused: true }
(5 matching properties omitted from actual)

[NoCoverage] BlockStatement
hooks/domains/sessions/pauseResume.ts:28:64
       pausedAt: new Date(),
     };
 
-    storage.saveActiveSession(updatedSession).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist paused session',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    });
+    storage.saveActiveSession(updatedSession).catch((error) => {});
 
     setState((prev) => ({

[Killed] ArrowFunction
hooks/domains/sessions/pauseResume.ts:37:14
       );
     });
 
-    setState((prev) => ({
-      ...prev,
-      activeSession: updatedSession,
-    }));
+    setState(() => undefined);
   };
 
killedBy: createPauseResumeHandlers should pause active session and persist updated state
statusReason: Cannot read properties of undefined (reading 'activeSession')

[Killed] ConditionalExpression
hooks/domains/sessions/pauseResume.ts:45:9
 
   const handleResumeSession = () => {
     const activeSession = state.activeSession;
-    if (!activeSession || !activeSession.pausedAt) return;
+    if (true) return;
 
     const pauseDuration = Date.now() - activeSession.pausedAt.getTime();
killedBy: createPauseResumeHandlers should resume paused session and accumulate paused time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
hooks/domains/sessions/pauseResume.ts:45:9
 
   const handleResumeSession = () => {
     const activeSession = state.activeSession;
-    if (!activeSession || !activeSession.pausedAt) return;
+    if (false) return;
 
     const pauseDuration = Date.now() - activeSession.pausedAt.getTime();
killedBy: createPauseResumeHandlers should no-op without active session or without pausedAt
statusReason: Cannot read properties of null (reading 'pausedAt')

[Killed] ArithmeticOperator
hooks/domains/sessions/pauseResume.ts:47:27
     const activeSession = state.activeSession;
     if (!activeSession || !activeSession.pausedAt) return;
 
-    const pauseDuration = Date.now() - activeSession.pausedAt.getTime();
+    const pauseDuration = Date.now() + activeSession.pausedAt.getTime();
     const updatedSession = {
       ...activeSession,
killedBy: createPauseResumeHandlers should resume paused session and accumulate paused time
statusReason: expected 3540059982000 to be 22000 // Object.is equality

[Killed] ObjectLiteral
hooks/domains/sessions/pauseResume.ts:48:28
     if (!activeSession || !activeSession.pausedAt) return;
 
     const pauseDuration = Date.now() - activeSession.pausedAt.getTime();
-    const updatedSession = {
-      ...activeSession,
-      isPaused: false,
-      pausedAt: undefined,
-      totalPausedTime: activeSession.totalPausedTime + pauseDuration,
-    };
+    const updatedSession = {};
 
     storage.saveActiveSession(updatedSession).catch((error) => {
killedBy: createPauseResumeHandlers should resume paused session and accumulate paused time
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
hooks/domains/sessions/pauseResume.ts:50:17
     const pauseDuration = Date.now() - activeSession.pausedAt.getTime();
     const updatedSession = {
       ...activeSession,
-      isPaused: false,
+      isPaused: true,
       pausedAt: undefined,
       totalPausedTime: activeSession.totalPausedTime + pauseDuration,
killedBy: createPauseResumeHandlers should resume paused session and accumulate paused time
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
hooks/domains/sessions/pauseResume.ts:52:24
       ...activeSession,
       isPaused: false,
       pausedAt: undefined,
-      totalPausedTime: activeSession.totalPausedTime + pauseDuration,
+      totalPausedTime: activeSession.totalPausedTime - pauseDuration,
     };
 
killedBy: createPauseResumeHandlers should resume paused session and accumulate paused time
statusReason: expected -18000 to be 22000 // Object.is equality

[NoCoverage] BlockStatement
hooks/domains/sessions/pauseResume.ts:55:64
       totalPausedTime: activeSession.totalPausedTime + pauseDuration,
     };
 
-    storage.saveActiveSession(updatedSession).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist resumed session',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    });
+    storage.saveActiveSession(updatedSession).catch((error) => {});
 
     setState((prev) => ({

[NoCoverage] StringLiteral
hooks/domains/sessions/pauseResume.ts:58:9
     storage.saveActiveSession(updatedSession).catch((error) => {
       logger.error(
         'SESSIONS',
-        'Failed to persist resumed session',
+        "",
         undefined,
         normalizeUnknownError(error),
