[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:30:14
 }: CreateSchedulingHandlersParams) {
   const handleScheduleChain = (chainId: string) => {
     const existingSchedule = state.scheduledSessions.find(
-      (s) => s.chainId === chainId,
+      (s) => false,
     );
     if (existingSchedule) return;
killedBy: createSchedulingHandlers should ignore duplicate scheduling and missing chains
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Array [

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:30:14
 }: CreateSchedulingHandlersParams) {
   const handleScheduleChain = (chainId: string) => {
     const existingSchedule = state.scheduledSessions.find(
-      (s) => s.chainId === chainId,
+      (s) => s.chainId !== chainId,
     );
     if (existingSchedule) return;
killedBy: createSchedulingHandlers should ignore duplicate scheduling and missing chains
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:32:9
     const existingSchedule = state.scheduledSessions.find(
       (s) => s.chainId === chainId,
     );
-    if (existingSchedule) return;
+    if (true) return;
 
     const chain = state.chains.find((c) => c.id === chainId);
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:32:9
     const existingSchedule = state.scheduledSessions.find(
       (s) => s.chainId === chainId,
     );
-    if (existingSchedule) return;
+    if (false) return;
 
     const chain = state.chains.find((c) => c.id === chainId);
killedBy: createSchedulingHandlers should ignore duplicate scheduling and missing chains
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Array [

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:34:44
     );
     if (existingSchedule) return;
 
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => c.id !== chainId);
     if (!chain) return;
 
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:34:44
     );
     if (existingSchedule) return;
 
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => false);
     if (!chain) return;
 
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:35:9
     if (existingSchedule) return;
 
     const chain = state.chains.find((c) => c.id === chainId);
-    if (!chain) return;
+    if (false) return;
 
     const scheduledSession: ScheduledSession = {
killedBy: createSchedulingHandlers should ignore duplicate scheduling and missing chains
statusReason: Cannot read properties of undefined (reading 'auxiliaryDuration')

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:35:9
     if (existingSchedule) return;
 
     const chain = state.chains.find((c) => c.id === chainId);
-    if (!chain) return;
+    if (true) return;
 
     const scheduledSession: ScheduledSession = {
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected [] to have a length of 1 but got +0

[Survived] ArithmeticOperator
hooks/domains/sessions/scheduling.ts:40:27
     const scheduledSession: ScheduledSession = {
       chainId,
       scheduledAt: new Date(),
-      expiresAt: new Date(Date.now() + chain.auxiliaryDuration * 60 * 1000),
+      expiresAt: new Date(Date.now() - chain.auxiliaryDuration * 60 * 1000),
       auxiliarySignal: chain.auxiliarySignal,
     };

[Survived] ArithmeticOperator
hooks/domains/sessions/scheduling.ts:40:40
     const scheduledSession: ScheduledSession = {
       chainId,
       scheduledAt: new Date(),
-      expiresAt: new Date(Date.now() + chain.auxiliaryDuration * 60 * 1000),
+      expiresAt: new Date(Date.now() + chain.auxiliaryDuration * 60 / 1000),
       auxiliarySignal: chain.auxiliarySignal,
     };

[Killed] BlockStatement
hooks/domains/sessions/scheduling.ts:45:11
     };
 
     const updateStateAndSave = async () => {
-      try {
-        const updatedSessions = [...state.scheduledSessions, scheduledSession];
-
-        const updatedChains = state.chains.map((chain) =>
-          chain.id === chainId
-            ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
-            : chain,
-        );
-
-        await Promise.all([
-          storage.saveScheduledSessions(updatedSessions),
-          safelySaveChains(updatedChains),
-        ]);
-        queryOptimizer.onDataChange('chains');
-
-        setState((prev) => ({
-          ...prev,
-          scheduledSessions: updatedSessions,
-          chains: updatedChains,
-          chainsRevision: prev.chainsRevision + 1,
-        }));
-      } catch (error) {
+      try {} catch (error) {
         logger.error(
           'SESSIONS',
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
hooks/domains/sessions/scheduling.ts:48:48
       try {
         const updatedSessions = [...state.scheduledSessions, scheduledSession];
 
-        const updatedChains = state.chains.map((chain) =>
-          chain.id === chainId
-            ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
-            : chain,
+        const updatedChains = state.chains.map(() => undefined,
         );
 
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:49:11
         const updatedSessions = [...state.scheduledSessions, scheduledSession];
 
         const updatedChains = state.chains.map((chain) =>
-          chain.id === chainId
+          false
             ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
             : chain,
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected 4 to be 5 // Object.is equality

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:49:11
         const updatedSessions = [...state.scheduledSessions, scheduledSession];
 
         const updatedChains = state.chains.map((chain) =>
-          chain.id === chainId
+          chain.id !== chainId
             ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
             : chain,
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ArithmeticOperator
hooks/domains/sessions/scheduling.ts:50:44
 
         const updatedChains = state.chains.map((chain) =>
           chain.id === chainId
-            ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
+            ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak - 1 }
             : chain,
         );
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected 3 to be 5 // Object.is equality

[Killed] ObjectLiteral
hooks/domains/sessions/scheduling.ts:50:15
 
         const updatedChains = state.chains.map((chain) =>
           chain.id === chainId
-            ? { ...chain, auxiliaryStreak: chain.auxiliaryStreak + 1 }
+            ? {}
             : chain,
         );
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArrayDeclaration
hooks/domains/sessions/scheduling.ts:54:27
             : chain,
         );
 
-        await Promise.all([
-          storage.saveScheduledSessions(updatedSessions),
-          safelySaveChains(updatedChains),
-        ]);
+        await Promise.all([]);
         queryOptimizer.onDataChange('chains');
 
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: expected "vi.fn()" to be called with arguments: [ [ { chainId: 'chain-1', …(3) } ] ]

Number of calls: 0

[Killed] ArrowFunction
hooks/domains/sessions/scheduling.ts:60:18
         ]);
         queryOptimizer.onDataChange('chains');
 
-        setState((prev) => ({
-          ...prev,
-          scheduledSessions: updatedSessions,
-          chains: updatedChains,
-          chainsRevision: prev.chainsRevision + 1,
-        }));
+        setState(() => undefined);
       } catch (error) {
         logger.error(
killedBy: createSchedulingHandlers should create scheduled session and increment auxiliary streak
statusReason: Cannot read properties of undefined (reading 'scheduledSessions')

[Killed] BlockStatement
hooks/domains/sessions/scheduling.ts:66:23
           chains: updatedChains,
           chainsRevision: prev.chainsRevision + 1,
         }));
-      } catch (error) {
-        logger.error(
-          'SESSIONS',
-          'Failed to schedule chain',
-          { chainId },
-          normalizeUnknownError(error),
-        );
-        toast.error(
-          tr('预约失败，请重试', 'Failed to schedule. Please try again.'),
-        );
-      }
+      } catch (error) {}
     };
 
killedBy: createSchedulingHandlers should show toast when schedule persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
hooks/domains/sessions/scheduling.ts:74:26
           normalizeUnknownError(error),
         );
         toast.error(
-          tr('预约失败，请重试', 'Failed to schedule. Please try again.'),
+          tr('预约失败，请重试', ""),
         );
       }
killedBy: createSchedulingHandlers should show toast when schedule persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Failed to schedule. Please try again.",

[Killed] BlockStatement
hooks/domains/sessions/scheduling.ts:82:61
     updateStateAndSave();
   };
 
-  const handleCancelScheduledSession = (chainId: string) => {
-    setShowAuxiliaryJudgment(chainId);
-  };
+  const handleCancelScheduledSession = (chainId: string) => {};
 
   const handleCompleteBooking = (chainId: string) => {
killedBy: createSchedulingHandlers should delegate cancel action to auxiliary judgment modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'chain-3' ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:87:44
   };
 
   const handleCompleteBooking = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => false);
     if (!chain) return;
 
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:87:44
   };
 
   const handleCompleteBooking = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => c.id !== chainId);
     if (!chain) return;
 
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
hooks/domains/sessions/scheduling.ts:88:9
 
   const handleCompleteBooking = (chainId: string) => {
     const chain = state.chains.find((c) => c.id === chainId);
-    if (!chain) return;
+    if (chain) return;
 
     const updatedScheduledSessions = state.scheduledSessions.filter(
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] MethodExpression
hooks/domains/sessions/scheduling.ts:90:38
     const chain = state.chains.find((c) => c.id === chainId);
     if (!chain) return;
 
-    const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
-    );
+    const updatedScheduledSessions = state.scheduledSessions;
     const updatedChains = state.chains.map((c) =>
       c.id === chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:91:20
     if (!chain) return;
 
     const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
+      (session) => true,
     );
     const updatedChains = state.chains.map((c) =>
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:91:20
     if (!chain) return;
 
     const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
+      (session) => session.chainId === chainId,
     );
     const updatedChains = state.chains.map((c) =>
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected [ { chainId: 'chain-4', …(3) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
hooks/domains/sessions/scheduling.ts:93:44
     const updatedScheduledSessions = state.scheduledSessions.filter(
       (session) => session.chainId !== chainId,
     );
-    const updatedChains = state.chains.map((c) =>
-      c.id === chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
+    const updatedChains = state.chains.map(() => undefined,
     );
 
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
hooks/domains/sessions/scheduling.ts:94:7
       (session) => session.chainId !== chainId,
     );
     const updatedChains = state.chains.map((c) =>
-      c.id === chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
+      c.id !== chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
     );
 
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
hooks/domains/sessions/scheduling.ts:94:7
       (session) => session.chainId !== chainId,
     );
     const updatedChains = state.chains.map((c) =>
-      c.id === chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
+      false ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
     );
 
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected 2 to be 3 // Object.is equality

[NoCoverage] BlockStatement
hooks/domains/sessions/scheduling.ts:97:78
       c.id === chainId ? { ...c, auxiliaryStreak: c.auxiliaryStreak + 1 } : c,
     );
 
-    storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist scheduled sessions after completing booking',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-    });
+    storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {});
     safelySaveChains(updatedChains).catch((error) => {
       queryOptimizer.onDataChange('chains');

[NoCoverage] BlockStatement
hooks/domains/sessions/scheduling.ts:105:54
         normalizeUnknownError(error),
       );
     });
-    safelySaveChains(updatedChains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
-      logger.error(
-        'SESSIONS',
-        '完成预约时保存链条数据失败',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    });
+    safelySaveChains(updatedChains).catch((error) => {});
 
     setState((prev) => ({

[Killed] ArrowFunction
hooks/domains/sessions/scheduling.ts:115:14
       );
     });
 
-    setState((prev) => ({
-      ...prev,
-      scheduledSessions: updatedScheduledSessions,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
+    setState(() => undefined);
 
     void systemNotificationService.notifyTaskCompleted(
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: Cannot read properties of undefined (reading 'scheduledSessions')

[Killed] ObjectLiteral
hooks/domains/sessions/scheduling.ts:115:25
       );
     });
 
-    setState((prev) => ({
-      ...prev,
-      scheduledSessions: updatedScheduledSessions,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
+    setState((prev) => ({}));
 
     void systemNotificationService.notifyTaskCompleted(
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: Target cannot be null or undefined.

[Killed] ArithmeticOperator
hooks/domains/sessions/scheduling.ts:124:7
 
     void systemNotificationService.notifyTaskCompleted(
       chain.name,
-      chain.auxiliaryStreak + 1,
+      chain.auxiliaryStreak - 1,
       tr('预约已完成', 'Schedule completed'),
     );
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected "vi.fn()" to be called with arguments: [ 'Booking Chain', 3, …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Booking Chain",

[Killed] StringLiteral
hooks/domains/sessions/scheduling.ts:125:19
     void systemNotificationService.notifyTaskCompleted(
       chain.name,
       chain.auxiliaryStreak + 1,
-      tr('预约已完成', 'Schedule completed'),
+      tr('预约已完成', ""),
     );
   };
killedBy: createSchedulingHandlers should complete booking, remove schedule, and increment streak
statusReason: expected "vi.fn()" to be called with arguments: [ 'Booking Chain', 3, …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Booking Chain",
