[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:30:22
 export function useCheckinDomain() {
   const { language, tr } = useI18n();
   const storage = useStorage();
-  const isSupabase = storage.kind === 'supabase';
+  const isSupabase = true;
 
   const [stats, setStats] = useState<CheckinStats | null>(null);
killedBy: useCheckinDomain should set login-required error when storage kind is local
statusReason: expected { user_id: 'test-user', …(6) } to be null

[Killed] EqualityOperator
src/hooks/domains/useCheckinDomain.ts:30:22
 export function useCheckinDomain() {
   const { language, tr } = useI18n();
   const storage = useStorage();
-  const isSupabase = storage.kind === 'supabase';
+  const isSupabase = storage.kind !== 'supabase';
 
   const [stats, setStats] = useState<CheckinStats | null>(null);
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:33:46
   const isSupabase = storage.kind === 'supabase';
 
   const [stats, setStats] = useState<CheckinStats | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [isCheckingIn, setIsCheckingIn] = useState(false);
 

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:34:52
 
   const [stats, setStats] = useState<CheckinStats | null>(null);
   const [isLoading, setIsLoading] = useState(true);
-  const [isCheckingIn, setIsCheckingIn] = useState(false);
+  const [isCheckingIn, setIsCheckingIn] = useState(true);
 
   // Refs to access latest values without re-creating callbacks
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:43:19
   const trRef = useRef(tr);
 
   // Keep refs in sync with state
-  useEffect(() => {
-    statsRef.current = stats;
-  }, [stats]);
+  useEffect(() => {}, [stats]);
 
   useEffect(() => {
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:45:6
   // Keep refs in sync with state
   useEffect(() => {
     statsRef.current = stats;
-  }, [stats]);
+  }, []);
 
   useEffect(() => {
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:47:19
     statsRef.current = stats;
   }, [stats]);
 
-  useEffect(() => {
-    isCheckingInRef.current = isCheckingIn;
-  }, [isCheckingIn]);
+  useEffect(() => {}, [isCheckingIn]);
 
   useEffect(() => {
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/hooks/domains/useCheckinDomain.ts:51:19
     isCheckingInRef.current = isCheckingIn;
   }, [isCheckingIn]);
 
-  useEffect(() => {
-    languageRef.current = language;
-    trRef.current = tr;
-  }, [language, tr]);
+  useEffect(() => {}, [language, tr]);
   const [error, setError] = useState<string | null>(null);
   const [successMessage, setSuccessMessage] = useState<string | null>(null);

[Survived] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:54:6
   useEffect(() => {
     languageRef.current = language;
     trRef.current = tr;
-  }, [language, tr]);
+  }, []);
   const [error, setError] = useState<string | null>(null);
   const [successMessage, setSuccessMessage] = useState<string | null>(null);

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:57:50
   }, [language, tr]);
   const [error, setError] = useState<string | null>(null);
   const [successMessage, setSuccessMessage] = useState<string | null>(null);
-  const [isCollapsed, setIsCollapsed] = useState(false);
+  const [isCollapsed, setIsCollapsed] = useState(true);
 
   const clearError = useCallback(() => {
killedBy: useCheckinDomain should toggle collapsed state and clear error
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:59:40
   const [successMessage, setSuccessMessage] = useState<string | null>(null);
   const [isCollapsed, setIsCollapsed] = useState(false);
 
-  const clearError = useCallback(() => {
-    setError(null);
-  }, []);
+  const clearError = useCallback(() => {}, []);
 
   const toggleCollapsed = useCallback(() => {
killedBy: useCheckinDomain should toggle collapsed state and clear error
statusReason: expected 'Daily check-in requires login' to be null

[Survived] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:61:6
 
   const clearError = useCallback(() => {
     setError(null);
-  }, []);
+  }, ["Stryker was here"]);
 
   const toggleCollapsed = useCallback(() => {

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:63:45
     setError(null);
   }, []);
 
-  const toggleCollapsed = useCallback(() => {
-    setIsCollapsed((prev) => !prev);
-  }, []);
+  const toggleCollapsed = useCallback(() => {}, []);
 
   const loadStats = useCallback(async () => {
killedBy: useCheckinDomain should toggle collapsed state and clear error
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useCheckinDomain.ts:64:20
   }, []);
 
   const toggleCollapsed = useCallback(() => {
-    setIsCollapsed((prev) => !prev);
+    setIsCollapsed(() => undefined);
   }, []);
 
killedBy: useCheckinDomain should toggle collapsed state and clear error
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:64:30
   }, []);
 
   const toggleCollapsed = useCallback(() => {
-    setIsCollapsed((prev) => !prev);
+    setIsCollapsed((prev) => prev);
   }, []);
 
killedBy: useCheckinDomain should toggle collapsed state and clear error
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:65:6
 
   const toggleCollapsed = useCallback(() => {
     setIsCollapsed((prev) => !prev);
-  }, []);
+  }, ["Stryker was here"]);
 
   const loadStats = useCallback(async () => {

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:68:9
   }, []);
 
   const loadStats = useCallback(async () => {
-    if (!isSupabase) {
+    if (false) {
       setError(tr('签到功能需要登录后使用', 'Daily check-in requires login'));
       setIsLoading(false);
killedBy: useCheckinDomain should set login-required error when storage kind is local
statusReason: expected { user_id: 'test-user', …(6) } to be null

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:68:9
   }, []);
 
   const loadStats = useCallback(async () => {
-    if (!isSupabase) {
+    if (true) {
       setError(tr('签到功能需要登录后使用', 'Daily check-in requires login'));
       setIsLoading(false);
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/hooks/domains/useCheckinDomain.ts:69:34
 
   const loadStats = useCallback(async () => {
     if (!isSupabase) {
-      setError(tr('签到功能需要登录后使用', 'Daily check-in requires login'));
+      setError(tr('签到功能需要登录后使用', ""));
       setIsLoading(false);
       return;
killedBy: useCheckinDomain should set login-required error when storage kind is local
statusReason: expected '' to contain 'Daily check-in requires login'

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:70:20
   const loadStats = useCallback(async () => {
     if (!isSupabase) {
       setError(tr('签到功能需要登录后使用', 'Daily check-in requires login'));
-      setIsLoading(false);
+      setIsLoading(true);
       return;
     }
killedBy: useCheckinDomain should set login-required error when storage kind is local
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:74:9
       return;
     }
 
-    try {
-      setError(null);
-      setIsLoading(true);
-      const result = await storage.getUserCheckinStats();
-      if (!result.ok) {
-        const safeDetail = getSafeErrorDetail(result.error.message, language);
-        setError(
-          safeDetail ??
-            tr(
-              '加载签到数据失败，请重试（详情见控制台）',
-              'Failed to load check-in data. Check the console for details, then try again.',
-            ),
-        );
-        setStats(null);
-        return;
-      }
-      setStats(result.value);
-    } catch (err) {
+    try {} catch (err) {
       logger.error('CHECKIN', '加载签到统计失败', undefined, toError(err));
       const safeDetail = getSafeErrorDetailFromUnknown(err, language);
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:76:20
 
     try {
       setError(null);
-      setIsLoading(true);
+      setIsLoading(false);
       const result = await storage.getUserCheckinStats();
       if (!result.ok) {

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:78:11
       setError(null);
       setIsLoading(true);
       const result = await storage.getUserCheckinStats();
-      if (!result.ok) {
+      if (false) {
         const safeDetail = getSafeErrorDetail(result.error.message, language);
         setError(
killedBy: useCheckinDomain should set safe-detail loading error when stats query returns domain error
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:78:11
       setError(null);
       setIsLoading(true);
       const result = await storage.getUserCheckinStats();
-      if (!result.ok) {
+      if (true) {
         const safeDetail = getSafeErrorDetail(result.error.message, language);
         setError(
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected null to deeply equal { user_id: 'user-1', …(6) }

[Killed] LogicalOperator
src/hooks/domains/useCheckinDomain.ts:81:11
       if (!result.ok) {
         const safeDetail = getSafeErrorDetail(result.error.message, language);
         setError(
-          safeDetail ??
-            tr(
-              '加载签到数据失败，请重试（详情见控制台）',
-              'Failed to load check-in data. Check the console for details, then try again.',
-            ),
+          safeDetail && tr('加载签到数据失败，请重试（详情见控制台）', 'Failed to load check-in data. Check the console for details, then try again.'),
         );
         setStats(null);
killedBy: useCheckinDomain should set safe-detail loading error when stats query returns domain error
statusReason: expected 'Failed to load check-in data. Check t…' to be 'safe: db down' // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:91:19
         return;
       }
       setStats(result.value);
-    } catch (err) {
-      logger.error('CHECKIN', '加载签到统计失败', undefined, toError(err));
-      const safeDetail = getSafeErrorDetailFromUnknown(err, language);
-      setError(
-        safeDetail ??
-          tr(
-            '加载签到数据失败，请重试（详情见控制台）',
-            'Failed to load check-in data. Check the console for details, then try again.',
-          ),
-      );
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }
killedBy: useCheckinDomain should set fallback loading error when stats query throws
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:101:15
             'Failed to load check-in data. Check the console for details, then try again.',
           ),
       );
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   }, [isSupabase, language, storage, tr]);
 
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:110:7
     // Use refs to get latest values without causing callback recreation
     const currentStats = statsRef.current;
     if (
-      !currentStats ||
+      currentStats ||
       currentStats.has_checked_in_today ||
       isCheckingInRef.current
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/hooks/domains/useCheckinDomain.ts:110:7
     // Use refs to get latest values without causing callback recreation
     const currentStats = statsRef.current;
     if (
-      !currentStats ||
-      currentStats.has_checked_in_today ||
-      isCheckingInRef.current
+      (!currentStats || currentStats.has_checked_in_today) && isCheckingInRef.current
     ) {
       return;
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:113:7
       !currentStats ||
       currentStats.has_checked_in_today ||
       isCheckingInRef.current
-    ) {
-      return;
-    }
+    ) {}
 
     try {
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:118:23
     }
 
     try {
-      setIsCheckingIn(true);
+      setIsCheckingIn(false);
       setError(null);
       setSuccessMessage(null);
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:123:19
       setSuccessMessage(null);
 
       const op = await storage.performDailyCheckin();
-      if (!op.ok) {
-        const safeDetail = getSafeErrorDetail(
-          op.error.message,
-          languageRef.current,
-        );
-        setError(
-          safeDetail ??
-            trRef.current(
-              '签到失败，请重试（详情见控制台）',
-              'Check-in failed. Check the console for details, then try again.',
-            ),
-        );
-        return;
-      }
+      if (!op.ok) {}
 
       const result: CheckinResult = op.value;
killedBy: useCheckinDomain should surface operation error when performDailyCheckin returns domain error
statusReason: expected 'Check-in failed. Check the console fo…' to be 'safe: quota hit' // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:123:11
       setSuccessMessage(null);
 
       const op = await storage.performDailyCheckin();
-      if (!op.ok) {
+      if (op.ok) {
         const safeDetail = getSafeErrorDetail(
           op.error.message,
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useCheckinDomain.ts:129:11
           languageRef.current,
         );
         setError(
-          safeDetail ??
-            trRef.current(
-              '签到失败，请重试（详情见控制台）',
-              'Check-in failed. Check the console for details, then try again.',
-            ),
+          safeDetail && trRef.current('签到失败，请重试（详情见控制台）', 'Check-in failed. Check the console for details, then try again.'),
         );
         return;
killedBy: useCheckinDomain should surface operation error when performDailyCheckin returns domain error
statusReason: expected 'Check-in failed. Check the console fo…' to be 'safe: quota hit' // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:140:27
 
       const result: CheckinResult = op.value;
 
-      if (result.success) {
-        setStats((prev) =>
-          prev
-            ? {
-                ...prev,
-                total_points:
-                  result.total_points ||
-                  prev.total_points + result.points_earned,
-                total_checkins: prev.total_checkins + 1,
-                current_streak: result.consecutive_days,
-                has_checked_in_today: true,
-                last_checkin_date: result.checkin_date,
-              }
-            : null,
-        );
-
-        setSuccessMessage(
-          trRef.current(
-            `签到成功！获得${result.points_earned} 积分，连续签到${result.consecutive_days} 天`,
-            `Checked in! Earned ${result.points_earned} points. Streak: ${result.consecutive_days} days.`,
-          ),
-        );
-        setTimeout(() => setSuccessMessage(null), 3000);
-      } else {
+      if (result.success) {} else {
         const safeDetail = result.message
           ? getSafeErrorDetail(result.message, languageRef.current)
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:140:11
 
       const result: CheckinResult = op.value;
 
-      if (result.success) {
+      if (false) {
         setStats((prev) =>
           prev
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/hooks/domains/useCheckinDomain.ts:141:18
       const result: CheckinResult = op.value;
 
       if (result.success) {
-        setStats((prev) =>
-          prev
-            ? {
-                ...prev,
-                total_points:
-                  result.total_points ||
-                  prev.total_points + result.points_earned,
-                total_checkins: prev.total_checkins + 1,
-                current_streak: result.consecutive_days,
-                has_checked_in_today: true,
-                last_checkin_date: result.checkin_date,
-              }
-            : null,
+        setStats(() => undefined,
         );
 
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected undefined to match object { has_checked_in_today: true, …(4) }

[Killed] LogicalOperator
src/hooks/domains/useCheckinDomain.ts:146:19
             ? {
                 ...prev,
                 total_points:
-                  result.total_points ||
-                  prev.total_points + result.points_earned,
+                  result.total_points && prev.total_points + result.points_earned,
                 total_checkins: prev.total_checkins + 1,
                 current_streak: result.consecutive_days,
killedBy: useCheckinDomain should use server total points when total_points is provided
statusReason: expected 31 to be 999 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:146:19
             ? {
                 ...prev,
                 total_points:
-                  result.total_points ||
-                  prev.total_points + result.points_earned,
+                  false,
                 total_checkins: prev.total_checkins + 1,
                 current_streak: result.consecutive_days,
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useCheckinDomain.ts:147:19
                 ...prev,
                 total_points:
                   result.total_points ||
-                  prev.total_points + result.points_earned,
+                  prev.total_points - result.points_earned,
                 total_checkins: prev.total_checkins + 1,
                 current_streak: result.consecutive_days,
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: expected 17 to be 31 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useCheckinDomain.ts:148:33
                 total_points:
                   result.total_points ||
                   prev.total_points + result.points_earned,
-                total_checkins: prev.total_checkins + 1,
+                total_checkins: prev.total_checkins - 1,
                 current_streak: result.consecutive_days,
                 has_checked_in_today: true,
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:150:39
                   prev.total_points + result.points_earned,
                 total_checkins: prev.total_checkins + 1,
                 current_streak: result.consecutive_days,
-                has_checked_in_today: true,
+                has_checked_in_today: false,
                 last_checkin_date: result.checkin_date,
               }
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected { user_id: 'user-1', …(6) } to match object { has_checked_in_today: true, …(4) }
(2 matching properties omitted from actual)

[Survived] StringLiteral
src/hooks/domains/useCheckinDomain.ts:158:13
 
         setSuccessMessage(
           trRef.current(
-            `签到成功！获得${result.points_earned} 积分，连续签到${result.consecutive_days} 天`,
+            ``,
             `Checked in! Earned ${result.points_earned} points. Streak: ${result.consecutive_days} days.`,
           ),

[Killed] ArrowFunction
src/hooks/domains/useCheckinDomain.ts:162:20
             `Checked in! Earned ${result.points_earned} points. Streak: ${result.consecutive_days} days.`,
           ),
         );
-        setTimeout(() => setSuccessMessage(null), 3000);
+        setTimeout(() => undefined, 3000);
       } else {
         const safeDetail = result.message
killedBy: useCheckinDomain should update stats and clear success message when checkin succeeds
statusReason: expected 'Checked in! Earned 7 points. Streak: …' to be null

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:163:14
           ),
         );
         setTimeout(() => setSuccessMessage(null), 3000);
-      } else {
-        const safeDetail = result.message
-          ? getSafeErrorDetail(result.message, languageRef.current)
-          : null;
-        setError(safeDetail ?? trRef.current('签到失败', 'Check-in failed'));
-      }
+      } else {}
     } catch (err) {
       logger.error('CHECKIN', '签到失败', undefined, toError(err));
killedBy: useCheckinDomain should set checkin-failed fallback when operation returns unsuccessful result without detail
statusReason: expected null to be 'Check-in failed' // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/useCheckinDomain.ts:167:18
         const safeDetail = result.message
           ? getSafeErrorDetail(result.message, languageRef.current)
           : null;
-        setError(safeDetail ?? trRef.current('签到失败', 'Check-in failed'));
+        setError(safeDetail && trRef.current('签到失败', 'Check-in failed'));
       }
     } catch (err) {
killedBy: useCheckinDomain should set checkin-failed fallback when operation returns unsuccessful result without detail
statusReason: expected null to be 'Check-in failed' // Object.is equality

[Survived] StringLiteral
src/hooks/domains/useCheckinDomain.ts:167:46
         const safeDetail = result.message
           ? getSafeErrorDetail(result.message, languageRef.current)
           : null;
-        setError(safeDetail ?? trRef.current('签到失败', 'Check-in failed'));
+        setError(safeDetail ?? trRef.current("", 'Check-in failed'));
       }
     } catch (err) {

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:169:19
           : null;
         setError(safeDetail ?? trRef.current('签到失败', 'Check-in failed'));
       }
-    } catch (err) {
-      logger.error('CHECKIN', '签到失败', undefined, toError(err));
-      const safeDetail = getSafeErrorDetailFromUnknown(
-        err,
-        languageRef.current,
-      );
-      setError(
-        safeDetail ??
-          trRef.current(
-            '签到失败，请重试（详情见控制台）',
-            'Check-in failed. Check the console for details, then try again.',
-          ),
-      );
-    } finally {
+    } catch (err) {} finally {
       setIsCheckingIn(false);
     }
killedBy: useCheckinDomain should set safe-detail error when operation throws
statusReason: expected null to be 'safe: unhandled failure' // Object.is equality

[Killed] StringLiteral
src/hooks/domains/useCheckinDomain.ts:170:20
         setError(safeDetail ?? trRef.current('签到失败', 'Check-in failed'));
       }
     } catch (err) {
-      logger.error('CHECKIN', '签到失败', undefined, toError(err));
+      logger.error("", '签到失败', undefined, toError(err));
       const safeDetail = getSafeErrorDetailFromUnknown(
         err,
killedBy: useCheckinDomain should set safe-detail error when operation throws
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHECKIN', Any<String>, …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "CHECKIN",

[NoCoverage] StringLiteral
src/hooks/domains/useCheckinDomain.ts:179:13
         safeDetail ??
           trRef.current(
             '签到失败，请重试（详情见控制台）',
-            'Check-in failed. Check the console for details, then try again.',
+            "",
           ),
       );

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:182:15
             'Check-in failed. Check the console for details, then try again.',
           ),
       );
-    } finally {
-      setIsCheckingIn(false);
-    }
+    } finally {}
   }, [storage]); // Reduced dependencies: only storage is needed
 
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:183:23
           ),
       );
     } finally {
-      setIsCheckingIn(false);
+      setIsCheckingIn(true);
     }
   }, [storage]); // Reduced dependencies: only storage is needed
killedBy: useCheckinDomain should block duplicate check-in while request is in flight and use fallback total point math
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Survived] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:185:6
     } finally {
       setIsCheckingIn(false);
     }
-  }, [storage]); // Reduced dependencies: only storage is needed
+  }, []); // Reduced dependencies: only storage is needed
 
   useEffect(() => {

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:187:19
     }
   }, [storage]); // Reduced dependencies: only storage is needed
 
-  useEffect(() => {
-    loadStats();
-  }, [loadStats]);
+  useEffect(() => {}, [loadStats]);
 
   useEffect(() => {
killedBy: useCheckinDomain should load checkin stats when storage kind is supabase
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Survived] ArrayDeclaration
src/hooks/domains/useCheckinDomain.ts:189:6
 
   useEffect(() => {
     loadStats();
-  }, [loadStats]);
+  }, []);
 
   useEffect(() => {

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:191:19
     loadStats();
   }, [loadStats]);
 
-  useEffect(() => {
-    if (!isSupabase) return;
-
-    const handler = () => {
-      void loadStats();
-    };
-
-    window.addEventListener(POINTS_CHANGED_EVENT, handler);
-    return () => {
-      window.removeEventListener(POINTS_CHANGED_EVENT, handler);
-    };
-  }, [isSupabase, loadStats]);
+  useEffect(() => {}, [isSupabase, loadStats]);
 
   return {
killedBy: useCheckinDomain should refresh stats when points changed event is dispatched
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>
