[Killed] BooleanLiteral
src/hooks/domains/useCheckinDomain.ts:192:9
   }, [loadStats]);
 
   useEffect(() => {
-    if (!isSupabase) return;
+    if (isSupabase) return;
 
     const handler = () => {
killedBy: useCheckinDomain should refresh stats when points changed event is dispatched
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] ConditionalExpression
src/hooks/domains/useCheckinDomain.ts:192:9
   }, [loadStats]);
 
   useEffect(() => {
-    if (!isSupabase) return;
+    if (false) return;
 
     const handler = () => {
killedBy: useCheckinDomain should not attach points changed listener in local mode
statusReason: expected [ [ 'momentum:points-changed', …(1) ] ] to have a length of +0 but got 1

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:194:27
   useEffect(() => {
     if (!isSupabase) return;
 
-    const handler = () => {
-      void loadStats();
-    };
+    const handler = () => {};
 
     window.addEventListener(POINTS_CHANGED_EVENT, handler);
killedBy: useCheckinDomain should refresh stats when points changed event is dispatched
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html
  lang="en-US"
>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/domains/useCheckinDomain.ts:199:18
     };
 
     window.addEventListener(POINTS_CHANGED_EVENT, handler);
-    return () => {
-      window.removeEventListener(POINTS_CHANGED_EVENT, handler);
-    };
+    return () => {};
   }, [isSupabase, loadStats]);
 
killedBy: useCheckinDomain should attach and clean up points changed listener in supabase mode
statusReason: expected undefined to be defined
