[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:59:7
     },
   ) => {
     logger.error(
-      'APP_SHELL',
+      "",
       logMessage,
       undefined,
killedBy: useGroupDomain should recover from save failures by reloading chains and showing error toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', …(3) ]

Received: 

  1st vi.fn() call:

  [
-   "APP_SHELL",

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:68:13
     toast.error(
       safeDetail
         ? tr(
-            `${toastPrefixZh}: ${safeDetail}\n\n请查看控制台了解详细信息，然后重试`,
+            ``,
             `${toastPrefixEn}: ${safeDetail}\n\nCheck the console for details, then try again.`,
           )

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:74:9
         : tr(toastFallbackZh, toastFallbackEn),
     );
 
-    try {
-      const currentChains = await storage.getChains();
-      setState((prev) => ({
-        ...prev,
-        chains: currentChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
-    } catch (reloadError) {
+    try {} catch (reloadError) {
       logger.error(
         'APP_SHELL',
killedBy: useGroupDomain should recover from save failures by reloading chains and showing error toast
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/hooks/domains/useGroupDomain.ts:76:16
 
     try {
       const currentChains = await storage.getChains();
-      setState((prev) => ({
-        ...prev,
-        chains: currentChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
+      setState(() => undefined);
     } catch (reloadError) {
       logger.error(
killedBy: useGroupDomain should recover from save failures by reloading chains and showing error toast
statusReason: Cannot read properties of undefined (reading 'chains')

[Survived] ArithmeticOperator
src/hooks/domains/useGroupDomain.ts:79:25
       setState((prev) => ({
         ...prev,
         chains: currentChains,
-        chainsRevision: prev.chainsRevision + 1,
+        chainsRevision: prev.chainsRevision - 1,
       }));
     } catch (reloadError) {

[Survived] BlockStatement
src/hooks/domains/useGroupDomain.ts:81:27
         chains: currentChains,
         chainsRevision: prev.chainsRevision + 1,
       }));
-    } catch (reloadError) {
-      logger.error(
-        'APP_SHELL',
-        '重新加载数据也失败了',
-        undefined,
-        normalizeUnknownError(reloadError),
-      );
-    }
+    } catch (reloadError) {}
   };
 

[NoCoverage] StringLiteral
src/hooks/domains/useGroupDomain.ts:94:29
   const handleImportUnits = async (
     unitIds: string[],
     groupId: string,
-    mode: 'move' | 'copy' = 'copy',
+    mode: 'move' | 'copy' = "",
   ) => {
     logger.info('APP_SHELL', '开始导入单元到任务群', {

[Killed] ObjectLiteral
src/hooks/domains/useGroupDomain.ts:96:44
     groupId: string,
     mode: 'move' | 'copy' = 'copy',
   ) => {
-    logger.info('APP_SHELL', '开始导入单元到任务群', {
-      unitIds,
-      groupId,
-      mode,
-    });
+    logger.info('APP_SHELL', '开始导入单元到任务群', {});
 
     try {
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:96:30
     groupId: string,
     mode: 'move' | 'copy' = 'copy',
   ) => {
-    logger.info('APP_SHELL', '开始导入单元到任务群', {
+    logger.info('APP_SHELL', "", {
       unitIds,
       groupId,
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:105:28
     try {
       let updatedChains: Chain[];
 
-      if (mode === 'copy') {
-        // 复制模式：创建副本并加入任务群，原单元保持独立
-        const copiesToAdd: Chain[] = [];
-
-        state.chains.forEach((chain) => {
-          if (unitIds.includes(chain.id)) {
-            const copy: Chain = {
-              ...chain,
-              id: crypto.randomUUID(), // 生成新的ID
-              name: `${chain.name} ${tr('(副本)', '(Copy)')}`, // 添加副本标识
-              parentId: groupId,
-              currentStreak: 0, // 重置记录
-              auxiliaryStreak: 0,
-              totalCompletions: 0,
-              totalFailures: 0,
-              auxiliaryFailures: 0,
-              createdAt: new Date(),
-              lastCompletedAt: undefined,
-            };
-            copiesToAdd.push(copy);
-          }
-        });
-
-        updatedChains = [...state.chains, ...copiesToAdd];
-      } else {
+      if (mode === 'copy') {} else {
         // 移动模式：更新选中单元的 parentId 为目标任务群的 ID
         updatedChains = state.chains.map((chain) => {
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:105:11
     try {
       let updatedChains: Chain[];
 
-      if (mode === 'copy') {
+      if (mode !== 'copy') {
         // 复制模式：创建副本并加入任务群，原单元保持独立
         const copiesToAdd: Chain[] = [];
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected [ { id: 'group-1', …(29) }, …(1) ] to have a length of 3 but got 2

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:109:41
         // 复制模式：创建副本并加入任务群，原单元保持独立
         const copiesToAdd: Chain[] = [];
 
-        state.chains.forEach((chain) => {
-          if (unitIds.includes(chain.id)) {
-            const copy: Chain = {
-              ...chain,
-              id: crypto.randomUUID(), // 生成新的ID
-              name: `${chain.name} ${tr('(副本)', '(Copy)')}`, // 添加副本标识
-              parentId: groupId,
-              currentStreak: 0, // 重置记录
-              auxiliaryStreak: 0,
-              totalCompletions: 0,
-              totalFailures: 0,
-              auxiliaryFailures: 0,
-              createdAt: new Date(),
-              lastCompletedAt: undefined,
-            };
-            copiesToAdd.push(copy);
-          }
-        });
+        state.chains.forEach((chain) => {});
 
         updatedChains = [...state.chains, ...copiesToAdd];
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected [ { id: 'group-1', …(29) }, …(1) ] to have a length of 3 but got 2

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:110:43
         const copiesToAdd: Chain[] = [];
 
         state.chains.forEach((chain) => {
-          if (unitIds.includes(chain.id)) {
-            const copy: Chain = {
-              ...chain,
-              id: crypto.randomUUID(), // 生成新的ID
-              name: `${chain.name} ${tr('(副本)', '(Copy)')}`, // 添加副本标识
-              parentId: groupId,
-              currentStreak: 0, // 重置记录
-              auxiliaryStreak: 0,
-              totalCompletions: 0,
-              totalFailures: 0,
-              auxiliaryFailures: 0,
-              createdAt: new Date(),
-              lastCompletedAt: undefined,
-            };
-            copiesToAdd.push(copy);
-          }
+          if (unitIds.includes(chain.id)) {}
         });
 
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected [ { id: 'group-1', …(29) }, …(1) ] to have a length of 3 but got 2

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:110:15
         const copiesToAdd: Chain[] = [];
 
         state.chains.forEach((chain) => {
-          if (unitIds.includes(chain.id)) {
+          if (true) {
             const copy: Chain = {
               ...chain,
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected [ { id: 'group-1', …(29) }, …(3) ] to have a length of 3 but got 4

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:114:49
             const copy: Chain = {
               ...chain,
               id: crypto.randomUUID(), // 生成新的ID
-              name: `${chain.name} ${tr('(副本)', '(Copy)')}`, // 添加副本标识
+              name: `${chain.name} ${tr('(副本)', "")}`, // 添加副本标识
               parentId: groupId,
               currentStreak: 0, // 重置记录
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected { id: 'copied-id', …(23) } to match object { id: 'copied-id', …(4) }
(19 matching properties omitted from actual)

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:114:41
             const copy: Chain = {
               ...chain,
               id: crypto.randomUUID(), // 生成新的ID
-              name: `${chain.name} ${tr('(副本)', '(Copy)')}`, // 添加副本标识
+              name: `${chain.name} ${tr("", '(Copy)')}`, // 添加副本标识
               parentId: groupId,
               currentStreak: 0, // 重置记录

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:129:14
         });
 
         updatedChains = [...state.chains, ...copiesToAdd];
-      } else {
-        // 移动模式：更新选中单元的 parentId 为目标任务群的 ID
-        updatedChains = state.chains.map((chain) => {
-          if (unitIds.includes(chain.id)) {
-            return { ...chain, parentId: groupId };
-          }
-          return chain;
-        });
-      }
+      } else {}
 
       logger.debug('APP_SHELL', '准备保存导入后的数据到存储');
killedBy: useGroupDomain should import units in move mode by updating parentId
statusReason: expected undefined to be 'group-2' // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:131:53
         updatedChains = [...state.chains, ...copiesToAdd];
       } else {
         // 移动模式：更新选中单元的 parentId 为目标任务群的 ID
-        updatedChains = state.chains.map((chain) => {
-          if (unitIds.includes(chain.id)) {
-            return { ...chain, parentId: groupId };
-          }
-          return chain;
-        });
+        updatedChains = state.chains.map((chain) => {});
       }
 
killedBy: useGroupDomain should import units in move mode by updating parentId
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:132:15
       } else {
         // 移动模式：更新选中单元的 parentId 为目标任务群的 ID
         updatedChains = state.chains.map((chain) => {
-          if (unitIds.includes(chain.id)) {
+          if (true) {
             return { ...chain, parentId: groupId };
           }
killedBy: useGroupDomain should import units in move mode by updating parentId
statusReason: expected 'group-2' to be undefined

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:132:43
       } else {
         // 移动模式：更新选中单元的 parentId 为目标任务群的 ID
         updatedChains = state.chains.map((chain) => {
-          if (unitIds.includes(chain.id)) {
-            return { ...chain, parentId: groupId };
-          }
+          if (unitIds.includes(chain.id)) {}
           return chain;
         });
killedBy: useGroupDomain should import units in move mode by updating parentId
statusReason: expected undefined to be 'group-2' // Object.is equality

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:142:32
       logger.debug('APP_SHELL', '准备保存导入后的数据到存储');
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
-      logger.info('APP_SHELL', '导入数据保存成功，更新UI状态');
+      logger.info('APP_SHELL', "");
 
       setState((prev) => ({
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useGroupDomain.ts:144:16
       queryOptimizer.onDataChange('chains');
       logger.info('APP_SHELL', '导入数据保存成功，更新UI状态');
 
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
+      setState(() => undefined);
       logger.info('APP_SHELL', '导入完成，UI状态更新完成');
     } catch (error) {
killedBy: useGroupDomain should import units in copy mode and append copied chains
statusReason: Cannot read properties of undefined (reading 'chainsRevision')

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:150:21
         chainsRevision: prev.chainsRevision + 1,
       }));
       logger.info('APP_SHELL', '导入完成，UI状态更新完成');
-    } catch (error) {
-      await handleChainsOperationError(error, {
-        logMessage: 'Failed to import units',
-        toastPrefixZh: '导入失败',
-        toastPrefixEn: 'Import failed',
-        toastFallbackZh: '导入失败，请重试（详情见控制台）',
-        toastFallbackEn:
-          'Import failed. Check the console for details, then try again.',
-      });
-    }
+    } catch (error) {}
   };
 
killedBy: useGroupDomain should include safe detail in import failure toast and log reload failure if recovery fails
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:153:24
     } catch (error) {
       await handleChainsOperationError(error, {
         logMessage: 'Failed to import units',
-        toastPrefixZh: '导入失败',
+        toastPrefixZh: "",
         toastPrefixEn: 'Import failed',
         toastFallbackZh: '导入失败，请重试（详情见控制台）',

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:154:24
       await handleChainsOperationError(error, {
         logMessage: 'Failed to import units',
         toastPrefixZh: '导入失败',
-        toastPrefixEn: 'Import failed',
+        toastPrefixEn: "",
         toastFallbackZh: '导入失败，请重试（详情见控制台）',
         toastFallbackEn:
killedBy: useGroupDomain should include safe detail in import failure toast and log reload failure if recovery fails
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   StringContaining "Import failed: safe import detail",

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:155:26
         logMessage: 'Failed to import units',
         toastPrefixZh: '导入失败',
         toastPrefixEn: 'Import failed',
-        toastFallbackZh: '导入失败，请重试（详情见控制台）',
+        toastFallbackZh: "",
         toastFallbackEn:
           'Import failed. Check the console for details, then try again.',

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:168:9
   ) => {
     logger.debug('APP_SHELL', '开始更新任务重复次数', { chainId, repeatCount });
 
-    try {
-      const updatedChains = state.chains.map((chain) => {
-        if (chain.id === chainId) {
-          return { ...chain, taskRepeatCount: repeatCount };
-        }
-        return chain;
-      });
-
-      logger.debug('APP_SHELL', '准备保存重复次数更新到存储');
-      await safelySaveChains(updatedChains);
-      queryOptimizer.onDataChange('chains');
-      logger.info('APP_SHELL', '重复次数更新保存成功，更新UI状态');
-
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
-      logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
-    } catch (error) {
+    try {} catch (error) {
       await handleChainsOperationError(error, {
         logMessage: 'Failed to update task repeat count',
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:169:57
     logger.debug('APP_SHELL', '开始更新任务重复次数', { chainId, repeatCount });
 
     try {
-      const updatedChains = state.chains.map((chain) => {
-        if (chain.id === chainId) {
-          return { ...chain, taskRepeatCount: repeatCount };
-        }
-        return chain;
-      });
+      const updatedChains = state.chains.map((chain) => {});
 
       logger.debug('APP_SHELL', '准备保存重复次数更新到存储');
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:170:13
 
     try {
       const updatedChains = state.chains.map((chain) => {
-        if (chain.id === chainId) {
+        if (chain.id !== chainId) {
           return { ...chain, taskRepeatCount: repeatCount };
         }
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: expected 1 to be 5 // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:170:35
 
     try {
       const updatedChains = state.chains.map((chain) => {
-        if (chain.id === chainId) {
-          return { ...chain, taskRepeatCount: repeatCount };
-        }
+        if (chain.id === chainId) {}
         return chain;
       });
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: expected 1 to be 5 // Object.is equality

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:179:32
       logger.debug('APP_SHELL', '准备保存重复次数更新到存储');
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
-      logger.info('APP_SHELL', '重复次数更新保存成功，更新UI状态');
+      logger.info('APP_SHELL', "");
 
       setState((prev) => ({
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/hooks/domains/useGroupDomain.ts:181:27
       queryOptimizer.onDataChange('chains');
       logger.info('APP_SHELL', '重复次数更新保存成功，更新UI状态');
 
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
+      setState((prev) => ({}));
       logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
     } catch (error) {
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:186:32
         chains: updatedChains,
         chainsRevision: prev.chainsRevision + 1,
       }));
-      logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
+      logger.info('APP_SHELL', "");
     } catch (error) {
       await handleChainsOperationError(error, {
killedBy: useGroupDomain should update task repeat count and persist changes
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:186:19
         chains: updatedChains,
         chainsRevision: prev.chainsRevision + 1,
       }));
-      logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
+      logger.info("", '重复次数更新完成，UI状态更新完成');
     } catch (error) {
       await handleChainsOperationError(error, {

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:187:21
         chainsRevision: prev.chainsRevision + 1,
       }));
       logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
-    } catch (error) {
-      await handleChainsOperationError(error, {
-        logMessage: 'Failed to update task repeat count',
-        toastPrefixZh: '重复次数更新失败',
-        toastPrefixEn: 'Failed to update repeat count',
-        toastFallbackZh: '重复次数更新失败，请重试（详情见控制台）',
-        toastFallbackEn:
-          'Failed to update repeat count. Check the console for details, then try again.',
-      });
-    }
+    } catch (error) {}
   };
 
killedBy: useGroupDomain should recover from save failures by reloading chains and showing error toast
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/hooks/domains/useGroupDomain.ts:189:21
       logger.info('APP_SHELL', '重复次数更新完成，UI状态更新完成');
     } catch (error) {
       await handleChainsOperationError(error, {
-        logMessage: 'Failed to update task repeat count',
+        logMessage: "",
         toastPrefixZh: '重复次数更新失败',
         toastPrefixEn: 'Failed to update repeat count',
killedBy: useGroupDomain should recover from save failures by reloading chains and showing error toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:190:24
     } catch (error) {
       await handleChainsOperationError(error, {
         logMessage: 'Failed to update task repeat count',
-        toastPrefixZh: '重复次数更新失败',
+        toastPrefixZh: "",
         toastPrefixEn: 'Failed to update repeat count',
         toastFallbackZh: '重复次数更新失败，请重试（详情见控制台）',

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:192:26
         logMessage: 'Failed to update task repeat count',
         toastPrefixZh: '重复次数更新失败',
         toastPrefixEn: 'Failed to update repeat count',
-        toastFallbackZh: '重复次数更新失败，请重试（详情见控制台）',
+        toastFallbackZh: "",
         toastFallbackEn:
           'Failed to update repeat count. Check the console for details, then try again.',

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:208:48
       state.chains,
       state.chainsRevision,
     );
-    const groupNode = chainTree.find((node) => node.id === groupId);
+    const groupNode = chainTree.find((node) => node.id !== groupId);
     if (!groupNode) return;
 
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:208:48
       state.chains,
       state.chainsRevision,
     );
-    const groupNode = chainTree.find((node) => node.id === groupId);
+    const groupNode = chainTree.find((node) => false);
     if (!groupNode) return;
 
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/useGroupDomain.ts:209:9
       state.chainsRevision,
     );
     const groupNode = chainTree.find((node) => node.id === groupId);
-    if (!groupNode) return;
+    if (groupNode) return;
 
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:209:9
       state.chainsRevision,
     );
     const groupNode = chainTree.find((node) => node.id === groupId);
-    if (!groupNode) return;
+    if (true) return;
 
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:211:57
     const groupNode = chainTree.find((node) => node.id === groupId);
     if (!groupNode) return;
 
-    const idx = groupNode.children.findIndex((child) => child.id === unitId);
+    const idx = groupNode.children.findIndex((child) => false);
     if (idx < 0) return;
 
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:211:57
     const groupNode = chainTree.find((node) => node.id === groupId);
     if (!groupNode) return;
 
-    const idx = groupNode.children.findIndex((child) => child.id === unitId);
+    const idx = groupNode.children.findIndex((child) => true);
     if (idx < 0) return;
 
killedBy: useGroupDomain should reorder units upward by swapping with previous unit
statusReason: expected undefined to be 20 // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:212:9
     if (!groupNode) return;
 
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
-    if (idx < 0) return;
+    if (idx <= 0) return;
 
     const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:212:9
     if (!groupNode) return;
 
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
-    if (idx < 0) return;
+    if (idx >= 0) return;
 
     const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:214:23
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
     if (idx < 0) return;
 
-    const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
+    const targetIdx = true ? idx - 1 : idx + 1;
     if (targetIdx < 0 || targetIdx >= groupNode.children.length) return;
 
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:214:23
     const idx = groupNode.children.findIndex((child) => child.id === unitId);
     if (idx < 0) return;
 
-    const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
+    const targetIdx = false ? idx - 1 : idx + 1;
     if (targetIdx < 0 || targetIdx >= groupNode.children.length) return;
 
killedBy: useGroupDomain should reorder units upward by swapping with previous unit
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:215:9
     if (idx < 0) return;
 
     const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
-    if (targetIdx < 0 || targetIdx >= groupNode.children.length) return;
+    if (false) return;
 
     const a = groupNode.children[idx];
killedBy: useGroupDomain should no-op reorder when group is missing, unit is missing, or target index is out of range
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:215:9
     if (idx < 0) return;
 
     const targetIdx = direction === 'up' ? idx - 1 : idx + 1;
-    if (targetIdx < 0 || targetIdx >= groupNode.children.length) return;
+    if (false || targetIdx >= groupNode.children.length) return;
 
     const a = groupNode.children[idx];
killedBy: useGroupDomain should no-op reorder when group is missing, unit is missing, or target index is out of range
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/hooks/domains/useGroupDomain.ts:219:46
 
     const a = groupNode.children[idx];
     const b = groupNode.children[targetIdx];
-    const updated = state.chains.map((ch) => {
-      if (ch.id === a.id) return { ...ch, sortOrder: b.sortOrder };
-      if (ch.id === b.id) return { ...ch, sortOrder: a.sortOrder };
-      return ch;
-    });
+    const updated = state.chains.map((ch) => {});
 
     await safelySaveChains(updated);
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:220:11
     const a = groupNode.children[idx];
     const b = groupNode.children[targetIdx];
     const updated = state.chains.map((ch) => {
-      if (ch.id === a.id) return { ...ch, sortOrder: b.sortOrder };
+      if (false) return { ...ch, sortOrder: b.sortOrder };
       if (ch.id === b.id) return { ...ch, sortOrder: a.sortOrder };
       return ch;
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:220:11
     const a = groupNode.children[idx];
     const b = groupNode.children[targetIdx];
     const updated = state.chains.map((ch) => {
-      if (ch.id === a.id) return { ...ch, sortOrder: b.sortOrder };
+      if (true) return { ...ch, sortOrder: b.sortOrder };
       if (ch.id === b.id) return { ...ch, sortOrder: a.sortOrder };
       return ch;
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useGroupDomain.ts:221:11
     const b = groupNode.children[targetIdx];
     const updated = state.chains.map((ch) => {
       if (ch.id === a.id) return { ...ch, sortOrder: b.sortOrder };
-      if (ch.id === b.id) return { ...ch, sortOrder: a.sortOrder };
+      if (ch.id !== b.id) return { ...ch, sortOrder: a.sortOrder };
       return ch;
     });
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useGroupDomain.ts:221:11
     const b = groupNode.children[targetIdx];
     const updated = state.chains.map((ch) => {
       if (ch.id === a.id) return { ...ch, sortOrder: b.sortOrder };
-      if (ch.id === b.id) return { ...ch, sortOrder: a.sortOrder };
+      if (false) return { ...ch, sortOrder: a.sortOrder };
       return ch;
     });
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
src/hooks/domains/useGroupDomain.ts:226:33
     });
 
     await safelySaveChains(updated);
-    queryOptimizer.onDataChange('chains');
+    queryOptimizer.onDataChange("");
     setState((prev) => ({
       ...prev,

[Killed] ArrowFunction
src/hooks/domains/useGroupDomain.ts:227:14
 
     await safelySaveChains(updated);
     queryOptimizer.onDataChange('chains');
-    setState((prev) => ({
-      ...prev,
-      chains: updated,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
+    setState(() => undefined);
   };
 
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: Cannot read properties of undefined (reading 'chains')
