[Killed] ArithmeticOperator
src/hooks/domains/useGroupDomain.ts:230:23
     setState((prev) => ({
       ...prev,
       chains: updated,
-      chainsRevision: prev.chainsRevision + 1,
+      chainsRevision: prev.chainsRevision - 1,
     }));
   };
killedBy: useGroupDomain should reorder units in a group by swapping sort order
statusReason: expected 9 to be 11 // Object.is equality
