[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:57:77
   setState: Dispatch<SetStateAction<AppState>>;
 }
 
-function appendIfNonEmpty<T>(existing: T[], incoming: T[] | undefined): T[] {
-  if (!incoming || incoming.length === 0) return existing;
-  return [...existing, ...incoming];
-}
+function appendIfNonEmpty<T>(existing: T[], incoming: T[] | undefined): T[] {}
 
 export function useImportExportDomain({
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected undefined to deeply equal [ { chainId: 'imported-1', …(3) } ]

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:58:7
 }
 
 function appendIfNonEmpty<T>(existing: T[], incoming: T[] | undefined): T[] {
-  if (!incoming || incoming.length === 0) return existing;
+  if (false) return existing;
   return [...existing, ...incoming];
 }
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: incoming is not iterable

[Killed] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:58:7
 }
 
 function appendIfNonEmpty<T>(existing: T[], incoming: T[] | undefined): T[] {
-  if (!incoming || incoming.length === 0) return existing;
+  if (!incoming && incoming.length === 0) return existing;
   return [...existing, ...incoming];
 }
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/hooks/domains/useImportExportDomain.ts:70:9
   const { tr } = useI18n();
 
   async function ensureAuthenticatedForImport(): Promise<void> {
-    if (storage.kind !== 'supabase') return;
+    if (storage.kind === 'supabase') return;
 
     logger.debug(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:70:9
   const { tr } = useI18n();
 
   async function ensureAuthenticatedForImport(): Promise<void> {
-    if (storage.kind !== 'supabase') return;
+    if (true) return;
 
     logger.debug(
killedBy: useImportExportDomain should enforce auth checks for supabase imports
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:78:9
     );
     const isAuth = await storage.isUserAuthenticated();
 
-    if (!isAuth.ok) {
+    if (true) {
       logger.warn('IMPORT', 'isUserAuthenticated failed', {
         code: isAuth.error.code,
killedBy: useImportExportDomain should enforce auth checks for supabase imports
statusReason: expected [Function] to throw error including 'Authentication failed during import' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:78:21
     );
     const isAuth = await storage.isUserAuthenticated();
 
-    if (!isAuth.ok) {
-      logger.warn('IMPORT', 'isUserAuthenticated failed', {
-        code: isAuth.error.code,
-        message: isAuth.error.message,
-      });
-    }
+    if (!isAuth.ok) {}
 
     if (isAuth.ok && isAuth.value) return;
killedBy: useImportExportDomain should warn and wait for authentication when initial auth check fails with error
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:79:29
     const isAuth = await storage.isUserAuthenticated();
 
     if (!isAuth.ok) {
-      logger.warn('IMPORT', 'isUserAuthenticated failed', {
+      logger.warn('IMPORT', "", {
         code: isAuth.error.code,
         message: isAuth.error.message,
killedBy: useImportExportDomain should warn and wait for authentication when initial auth check fails with error
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "IMPORT",

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:85:9
       });
     }
 
-    if (isAuth.ok && isAuth.value) return;
+    if (false) return;
 
     logger.debug('IMPORT', 'Authentication not ready; waiting');
killedBy: useImportExportDomain should skip waitForAuthentication when supabase auth is already valid
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:85:9
       });
     }
 
-    if (isAuth.ok && isAuth.value) return;
+    if (true) return;
 
     logger.debug('IMPORT', 'Authentication not ready; waiting');
killedBy: useImportExportDomain should enforce auth checks for supabase imports
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/hooks/domains/useImportExportDomain.ts:87:28
 
     if (isAuth.ok && isAuth.value) return;
 
-    logger.debug('IMPORT', 'Authentication not ready; waiting');
+    logger.debug('IMPORT', "");
     const authResult = await storage.waitForAuthentication(10000);
 

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:91:7
     const authResult = await storage.waitForAuthentication(10000);
 
     if (
-      !authResult.ok ||
-      !authResult.value.isAuthenticated ||
-      !authResult.value.user
+      true
     ) {
       throw new Error(
killedBy: useImportExportDomain should continue import when auth check fails but waitForAuthentication succeeds
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:91:7
     const authResult = await storage.waitForAuthentication(10000);
 
     if (
-      !authResult.ok ||
+      authResult.ok ||
       !authResult.value.isAuthenticated ||
       !authResult.value.user
killedBy: useImportExportDomain should continue import when auth check fails but waitForAuthentication succeeds
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:92:7
 
     if (
       !authResult.ok ||
-      !authResult.value.isAuthenticated ||
+      authResult.value.isAuthenticated ||
       !authResult.value.user
     ) {
killedBy: useImportExportDomain should continue import when auth check fails but waitForAuthentication succeeds
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:93:7
     if (
       !authResult.ok ||
       !authResult.value.isAuthenticated ||
-      !authResult.value.user
+      authResult.value.user
     ) {
       throw new Error(
killedBy: useImportExportDomain should continue import when auth check fails but waitForAuthentication succeeds
statusReason: Authentication failed during import. Please make sure you are signed in and try again.

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:94:7
       !authResult.ok ||
       !authResult.value.isAuthenticated ||
       !authResult.value.user
-    ) {
-      throw new Error(
-        tr(
-          '导入时身份验证失败：请确保您已正确登录，然后重试导入操作。',
-          'Authentication failed during import. Please make sure you are signed in and try again.',
-        ),
-      );
-    }
+    ) {}
 
     logger.debug('IMPORT', 'Authentication confirmed after wait', {
killedBy: useImportExportDomain should enforce auth checks for supabase imports
statusReason: expected [Function] to throw error including 'Authentication failed during import' but got 'Cannot read properties of null (readi…'

[Survived] StringLiteral
src/hooks/domains/useImportExportDomain.ts:97:11
     ) {
       throw new Error(
         tr(
-          '导入时身份验证失败：请确保您已正确登录，然后重试导入操作。',
+          "",
           'Authentication failed during import. Please make sure you are signed in and try again.',
         ),

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:98:11
       throw new Error(
         tr(
           '导入时身份验证失败：请确保您已正确登录，然后重试导入操作。',
-          'Authentication failed during import. Please make sure you are signed in and try again.',
+          "",
         ),
       );
killedBy: useImportExportDomain should enforce auth checks for supabase imports
statusReason: expected [Function] to throw error including 'Authentication failed during import' but got ''

[Survived] StringLiteral
src/hooks/domains/useImportExportDomain.ts:103:28
       );
     }
 
-    logger.debug('IMPORT', 'Authentication confirmed after wait', {
+    logger.debug('IMPORT', "", {
       userId: authResult.value.user.id,
     });

[Survived] ObjectLiteral
src/hooks/domains/useImportExportDomain.ts:103:67
       );
     }
 
-    logger.debug('IMPORT', 'Authentication confirmed after wait', {
-      userId: authResult.value.user.id,
-    });
+    logger.debug('IMPORT', 'Authentication confirmed after wait', {});
   }
 

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:108:69
     });
   }
 
-  function assertValidImportedChains(importedChains: Chain[]): void {
-    if (!Array.isArray(importedChains) || importedChains.length === 0) {
-      throw new Error(
-        tr('没有有效的链条数据可导入', 'No valid chains found to import'),
-      );
-    }
-  }
+  function assertValidImportedChains(importedChains: Chain[]): void {}
 
   function assertNoIdConflicts(
killedBy: useImportExportDomain should reject empty import payloads
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:109:72
   }
 
   function assertValidImportedChains(importedChains: Chain[]): void {
-    if (!Array.isArray(importedChains) || importedChains.length === 0) {
-      throw new Error(
-        tr('没有有效的链条数据可导入', 'No valid chains found to import'),
-      );
-    }
+    if (!Array.isArray(importedChains) || importedChains.length === 0) {}
   }
 
killedBy: useImportExportDomain should reject empty import payloads
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:109:9
   }
 
   function assertValidImportedChains(importedChains: Chain[]): void {
-    if (!Array.isArray(importedChains) || importedChains.length === 0) {
+    if (!Array.isArray(importedChains) && importedChains.length === 0) {
       throw new Error(
         tr('没有有效的链条数据可导入', 'No valid chains found to import'),
killedBy: useImportExportDomain should reject empty import payloads
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/hooks/domains/useImportExportDomain.ts:111:12
   function assertValidImportedChains(importedChains: Chain[]): void {
     if (!Array.isArray(importedChains) || importedChains.length === 0) {
       throw new Error(
-        tr('没有有效的链条数据可导入', 'No valid chains found to import'),
+        tr("", 'No valid chains found to import'),
       );
     }

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:119:11
   function assertNoIdConflicts(
     currentChains: Chain[],
     importedChains: Chain[],
-  ): void {
-    const existingIds = new Set(currentChains.map((chain) => chain.id));
-    const conflictingIds = importedChains
-      .filter((chain) => existingIds.has(chain.id))
-      .map((chain) => chain.id);
-
-    if (conflictingIds.length === 0) return;
-
-    logger.error('IMPORT', 'Detected chain ID conflicts', { conflictingIds });
-    throw new Error(
-      tr(
-        `导入失败：发现 ${conflictingIds.length} 个ID冲突的链条`,
-        `Import failed: found ${conflictingIds.length} chains with conflicting IDs`,
-      ),
-    );
-  }
+  ): void {}
 
   async function persistImportedHistory(
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/hooks/domains/useImportExportDomain.ts:120:51
     currentChains: Chain[],
     importedChains: Chain[],
   ): void {
-    const existingIds = new Set(currentChains.map((chain) => chain.id));
+    const existingIds = new Set(currentChains.map(() => undefined));
     const conflictingIds = importedChains
       .filter((chain) => existingIds.has(chain.id))
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] MethodExpression
src/hooks/domains/useImportExportDomain.ts:121:28
     importedChains: Chain[],
   ): void {
     const existingIds = new Set(currentChains.map((chain) => chain.id));
-    const conflictingIds = importedChains
-      .filter((chain) => existingIds.has(chain.id))
+    const conflictingIds = importedChains
       .map((chain) => chain.id);
 
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: Import failed: found 1 chains with conflicting IDs

[Killed] ArrowFunction
src/hooks/domains/useImportExportDomain.ts:122:15
   ): void {
     const existingIds = new Set(currentChains.map((chain) => chain.id));
     const conflictingIds = importedChains
-      .filter((chain) => existingIds.has(chain.id))
+      .filter(() => undefined)
       .map((chain) => chain.id);
 
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ArrowFunction
src/hooks/domains/useImportExportDomain.ts:123:12
     const existingIds = new Set(currentChains.map((chain) => chain.id));
     const conflictingIds = importedChains
       .filter((chain) => existingIds.has(chain.id))
-      .map((chain) => chain.id);
+      .map(() => undefined);
 
     if (conflictingIds.length === 0) return;

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:125:9
       .filter((chain) => existingIds.has(chain.id))
       .map((chain) => chain.id);
 
-    if (conflictingIds.length === 0) return;
+    if (false) return;
 
     logger.error('IMPORT', 'Detected chain ID conflicts', { conflictingIds });
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: Import failed: found 0 chains with conflicting IDs

[Killed] EqualityOperator
src/hooks/domains/useImportExportDomain.ts:125:9
       .filter((chain) => existingIds.has(chain.id))
       .map((chain) => chain.id);
 
-    if (conflictingIds.length === 0) return;
+    if (conflictingIds.length !== 0) return;
 
     logger.error('IMPORT', 'Detected chain ID conflicts', { conflictingIds });
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: Import failed: found 0 chains with conflicting IDs

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:138:20
 
   async function persistImportedHistory(
     history: CompletionHistory[] | undefined,
-  ): Promise<void> {
-    if (!history || history.length === 0) return;
-
-    if (storage.kind === 'supabase') {
-      await storage.saveCompletionHistory(history);
-      return;
-    }
-
-    const existing = await storage.getCompletionHistory();
-    await storage.saveCompletionHistory([...existing, ...history]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipNodes(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { chainId: 'imported-1', …(3) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:139:9
   async function persistImportedHistory(
     history: CompletionHistory[] | undefined,
   ): Promise<void> {
-    if (!history || history.length === 0) return;
+    if (false) return;
 
     if (storage.kind === 'supabase') {
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: history is not iterable

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:139:9
   async function persistImportedHistory(
     history: CompletionHistory[] | undefined,
   ): Promise<void> {
-    if (!history || history.length === 0) return;
+    if (true) return;
 
     if (storage.kind === 'supabase') {
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { chainId: 'imported-1', …(3) } ] ]

Number of calls: 0

[Killed] EqualityOperator
src/hooks/domains/useImportExportDomain.ts:141:9
   ): Promise<void> {
     if (!history || history.length === 0) return;
 
-    if (storage.kind === 'supabase') {
+    if (storage.kind !== 'supabase') {
       await storage.saveCompletionHistory(history);
       return;
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(4) }, { …(4) } ] ]

Received: 

  1st vi.fn() call:

@@ -1,14 +1,8 @@
  [

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:141:9
   ): Promise<void> {
     if (!history || history.length === 0) return;
 
-    if (storage.kind === 'supabase') {
+    if (true) {
       await storage.saveCompletionHistory(history);
       return;
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(4) }, { …(4) } ] ]

Received: 

  1st vi.fn() call:

@@ -1,14 +1,8 @@
  [

[Killed] ArrayDeclaration
src/hooks/domains/useImportExportDomain.ts:147:41
     }
 
     const existing = await storage.getCompletionHistory();
-    await storage.saveCompletionHistory([...existing, ...history]);
+    await storage.saveCompletionHistory([]);
   }
 
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { chainId: 'imported-1', …(3) } ] ]

Received: 

  1st vi.fn() call:

  [
-   [

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:152:20
 
   async function persistImportedRsipNodes(
     nodes: RSIPNode[] | undefined,
-  ): Promise<void> {
-    if (!nodes || nodes.length === 0) return;
-
-    const existingNodes = await storage.getRSIPNodes();
-    await storage.saveRSIPNodes([...existingNodes, ...nodes]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipMeta(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'node-1', …(4) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:153:9
   async function persistImportedRsipNodes(
     nodes: RSIPNode[] | undefined,
   ): Promise<void> {
-    if (!nodes || nodes.length === 0) return;
+    if (false) return;
 
     const existingNodes = await storage.getRSIPNodes();
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: nodes is not iterable

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:153:9
   async function persistImportedRsipNodes(
     nodes: RSIPNode[] | undefined,
   ): Promise<void> {
-    if (!nodes || nodes.length === 0) return;
+    if (nodes || nodes.length === 0) return;
 
     const existingNodes = await storage.getRSIPNodes();
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'node-1', …(4) } ] ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:161:20
 
   async function persistImportedRsipMeta(
     meta: RSIPMeta | undefined,
-  ): Promise<void> {
-    if (!meta) return;
-
-    const existingMeta = await storage.getRSIPMeta();
-    await storage.saveRSIPMeta({ ...existingMeta, ...meta });
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipGroups(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { origin: 'local', imported: true } ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:162:9
   async function persistImportedRsipMeta(
     meta: RSIPMeta | undefined,
   ): Promise<void> {
-    if (!meta) return;
+    if (false) return;
 
     const existingMeta = await storage.getRSIPMeta();
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {},

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:162:9
   async function persistImportedRsipMeta(
     meta: RSIPMeta | undefined,
   ): Promise<void> {
-    if (!meta) return;
+    if (true) return;
 
     const existingMeta = await storage.getRSIPMeta();
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { origin: 'local', imported: true } ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:170:20
 
   async function persistImportedRsipGroups(
     groups: RSIPNodeGroup[] | undefined,
-  ): Promise<void> {
-    if (!groups || groups.length === 0) return;
-    const existing = await storage.getRSIPGroups();
-    await storage.saveRSIPGroups([...existing, ...groups]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipLibrary(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'group-1', …(3) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:171:9
   async function persistImportedRsipGroups(
     groups: RSIPNodeGroup[] | undefined,
   ): Promise<void> {
-    if (!groups || groups.length === 0) return;
+    if (true) return;
     const existing = await storage.getRSIPGroups();
     await storage.saveRSIPGroups([...existing, ...groups]);
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'group-1', …(3) } ] ]

Number of calls: 0

[Killed] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:171:9
   async function persistImportedRsipGroups(
     groups: RSIPNodeGroup[] | undefined,
   ): Promise<void> {
-    if (!groups || groups.length === 0) return;
+    if (!groups && groups.length === 0) return;
     const existing = await storage.getRSIPGroups();
     await storage.saveRSIPGroups([...existing, ...groups]);
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/hooks/domains/useImportExportDomain.ts:173:34
   ): Promise<void> {
     if (!groups || groups.length === 0) return;
     const existing = await storage.getRSIPGroups();
-    await storage.saveRSIPGroups([...existing, ...groups]);
+    await storage.saveRSIPGroups([]);
   }
 
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'group-1', …(3) } ] ]

Received: 

  1st vi.fn() call:

  [
-   [

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:178:20
 
   async function persistImportedRsipLibrary(
     entries: RSIPLibraryEntry[] | undefined,
-  ): Promise<void> {
-    if (!entries || entries.length === 0) return;
-    const existing = await storage.getRSIPPolicyLibrary();
-    await storage.saveRSIPPolicyLibrary([...existing, ...entries]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipRunHistory(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'lib-1', …(6) } ] ]

Number of calls: 0

[Killed] EqualityOperator
src/hooks/domains/useImportExportDomain.ts:179:21
   async function persistImportedRsipLibrary(
     entries: RSIPLibraryEntry[] | undefined,
   ): Promise<void> {
-    if (!entries || entries.length === 0) return;
+    if (!entries || entries.length !== 0) return;
     const existing = await storage.getRSIPPolicyLibrary();
     await storage.saveRSIPPolicyLibrary([...existing, ...entries]);
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'lib-1', …(6) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:179:9
   async function persistImportedRsipLibrary(
     entries: RSIPLibraryEntry[] | undefined,
   ): Promise<void> {
-    if (!entries || entries.length === 0) return;
+    if (false) return;
     const existing = await storage.getRSIPPolicyLibrary();
     await storage.saveRSIPPolicyLibrary([...existing, ...entries]);
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: entries is not iterable

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:186:20
 
   async function persistImportedRsipRunHistory(
     records: RSIPRunRecord[] | undefined,
-  ): Promise<void> {
-    if (!records || records.length === 0) return;
-    const existing = await storage.getRSIPRunHistory();
-    await storage.saveRSIPRunHistory([...existing, ...records]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipExecutionRecords(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { runNumber: 1, …(3) } ] ]

Number of calls: 0

[Killed] EqualityOperator
src/hooks/domains/useImportExportDomain.ts:187:21
   async function persistImportedRsipRunHistory(
     records: RSIPRunRecord[] | undefined,
   ): Promise<void> {
-    if (!records || records.length === 0) return;
+    if (!records || records.length !== 0) return;
     const existing = await storage.getRSIPRunHistory();
     await storage.saveRSIPRunHistory([...existing, ...records]);
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { runNumber: 1, …(3) } ] ]

Number of calls: 0

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:187:9
   async function persistImportedRsipRunHistory(
     records: RSIPRunRecord[] | undefined,
   ): Promise<void> {
-    if (!records || records.length === 0) return;
+    if (records || records.length === 0) return;
     const existing = await storage.getRSIPRunHistory();
     await storage.saveRSIPRunHistory([...existing, ...records]);
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { runNumber: 1, …(3) } ] ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:194:20
 
   async function persistImportedRsipExecutionRecords(
     records: RSIPExecutionRecord[] | undefined,
-  ): Promise<void> {
-    if (!records || records.length === 0) return;
-    for (const record of records) {
-      await storage.appendRSIPExecutionRecord(record);
-    }
-  }
+  ): Promise<void> {}
 
   async function persistImportedRsipTaskLinks(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'exec-1', …(3) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:195:9
   async function persistImportedRsipExecutionRecords(
     records: RSIPExecutionRecord[] | undefined,
   ): Promise<void> {
-    if (!records || records.length === 0) return;
+    if (false) return;
     for (const record of records) {
       await storage.appendRSIPExecutionRecord(record);
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: records is not iterable

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:196:35
     records: RSIPExecutionRecord[] | undefined,
   ): Promise<void> {
     if (!records || records.length === 0) return;
-    for (const record of records) {
-      await storage.appendRSIPExecutionRecord(record);
-    }
+    for (const record of records) {}
   }
 
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'exec-1', …(3) } ]

Number of calls: 0
