[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:203:20
 
   async function persistImportedRsipTaskLinks(
     links: RSIPTaskLink[] | undefined,
-  ): Promise<void> {
-    if (!links || links.length === 0) return;
-    const existing = await storage.getRSIPTaskLinks();
-    await storage.saveRSIPTaskLinks([...existing, ...links]);
-  }
+  ): Promise<void> {}
 
   async function persistImportedPetState(
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'link-1', …(8) } ] ]

Number of calls: 0

[Killed] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:204:9
   async function persistImportedRsipTaskLinks(
     links: RSIPTaskLink[] | undefined,
   ): Promise<void> {
-    if (!links || links.length === 0) return;
+    if (!links && links.length === 0) return;
     const existing = await storage.getRSIPTaskLinks();
     await storage.saveRSIPTaskLinks([...existing, ...links]);
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:204:9
   async function persistImportedRsipTaskLinks(
     links: RSIPTaskLink[] | undefined,
   ): Promise<void> {
-    if (!links || links.length === 0) return;
+    if (false) return;
     const existing = await storage.getRSIPTaskLinks();
     await storage.saveRSIPTaskLinks([...existing, ...links]);
killedBy: useImportExportDomain should append imported history and rsip nodes onto existing local persisted data
statusReason: links is not iterable

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:211:20
 
   async function persistImportedPetState(
     petState: PetState | undefined,
-  ): Promise<void> {
-    if (!petState) return;
-    await storage.savePetState(petState);
-  }
+  ): Promise<void> {}
 
   async function reloadStateAfterImportFailure(): Promise<void> {
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'pet-imported', …(15) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useImportExportDomain.ts:212:9
   async function persistImportedPetState(
     petState: PetState | undefined,
   ): Promise<void> {
-    if (!petState) return;
+    if (true) return;
     await storage.savePetState(petState);
   }
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'pet-imported', …(15) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/hooks/domains/useImportExportDomain.ts:212:9
   async function persistImportedPetState(
     petState: PetState | undefined,
   ): Promise<void> {
-    if (!petState) return;
+    if (petState) return;
     await storage.savePetState(petState);
   }
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'pet-imported', …(15) } ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:216:65
     await storage.savePetState(petState);
   }
 
-  async function reloadStateAfterImportFailure(): Promise<void> {
-    const currentChains = await storage.getChains();
-    const currentRsipNodes = await storage.getRSIPNodes();
-    const currentRsipMeta = await storage.getRSIPMeta();
-    const currentRsipGroups = await storage.getRSIPGroups();
-    const currentRsipPolicyLibrary = await storage.getRSIPPolicyLibrary();
-    const currentRsipRunHistory = await storage.getRSIPRunHistory();
-    const currentRsipTaskLinks = await storage.getRSIPTaskLinks();
-    const currentRsipExecutionRecords = await storage.getRSIPExecutionRecords();
-
-    setState((prev) => ({
-      ...prev,
-      chains: currentChains,
-      chainsRevision: prev.chainsRevision + 1,
-      rsipNodes: currentRsipNodes,
-      rsipMeta: currentRsipMeta,
-      rsipGroups: currentRsipGroups,
-      rsipPolicyLibrary: currentRsipPolicyLibrary,
-      rsipRunHistory: currentRsipRunHistory,
-      rsipTaskLinks: currentRsipTaskLinks,
-      rsipExecutionRecords: currentRsipExecutionRecords,
-    }));
-  }
+  async function reloadStateAfterImportFailure(): Promise<void> {}
 
   const handleImportChains = async (
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ArrowFunction
src/hooks/domains/useImportExportDomain.ts:226:14
     const currentRsipTaskLinks = await storage.getRSIPTaskLinks();
     const currentRsipExecutionRecords = await storage.getRSIPExecutionRecords();
 
-    setState((prev) => ({
-      ...prev,
-      chains: currentChains,
-      chainsRevision: prev.chainsRevision + 1,
-      rsipNodes: currentRsipNodes,
-      rsipMeta: currentRsipMeta,
-      rsipGroups: currentRsipGroups,
-      rsipPolicyLibrary: currentRsipPolicyLibrary,
-      rsipRunHistory: currentRsipRunHistory,
-      rsipTaskLinks: currentRsipTaskLinks,
-      rsipExecutionRecords: currentRsipExecutionRecords,
-    }));
+    setState(() => undefined);
   }
 
killedBy: useImportExportDomain should reload state and rethrow when chain persistence fails during import
statusReason: Cannot read properties of undefined (reading 'chains')

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:244:17
     importedChains: Chain[],
     options?: ImportChainsOptions,
   ) => {
-    logger.info('APP_SHELL', '开始导入数据', {
+    logger.info("", '开始导入数据', {
       chainCount: importedChains.length,
       options,
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '开始导入数据', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "APP_SHELL",

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:244:30
     importedChains: Chain[],
     options?: ImportChainsOptions,
   ) => {
-    logger.info('APP_SHELL', '开始导入数据', {
+    logger.info('APP_SHELL', "", {
       chainCount: importedChains.length,
       options,
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '开始导入数据', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:253:33
       await ensureAuthenticatedForImport();
       assertValidImportedChains(importedChains);
 
-      logger.debug('APP_SHELL', '准备保存导入的数据到存储');
+      logger.debug('APP_SHELL', "");
 
       const currentChains = await storage.getChains();
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '准备保存导入的数据到存储' ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Killed] ArrayDeclaration
src/hooks/domains/useImportExportDomain.ts:265:29
 
       assertNoIdConflicts(currentChains, importedChains);
 
-      const updatedChains = [...currentChains, ...importedChains];
+      const updatedChains = [];
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ [ …(2) ] ]

Received: 

  1st vi.fn() call:

  [
-   [

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:269:36
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
 
-      await persistImportedHistory(options?.history);
+      await persistImportedHistory(options.history);
       await persistImportedRsipNodes(options?.rsipNodes);
       await persistImportedRsipMeta(options?.rsipMeta);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'history')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:270:38
       queryOptimizer.onDataChange('chains');
 
       await persistImportedHistory(options?.history);
-      await persistImportedRsipNodes(options?.rsipNodes);
+      await persistImportedRsipNodes(options.rsipNodes);
       await persistImportedRsipMeta(options?.rsipMeta);
       await persistImportedRsipGroups(options?.rsipGroups);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipNodes')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:271:37
 
       await persistImportedHistory(options?.history);
       await persistImportedRsipNodes(options?.rsipNodes);
-      await persistImportedRsipMeta(options?.rsipMeta);
+      await persistImportedRsipMeta(options.rsipMeta);
       await persistImportedRsipGroups(options?.rsipGroups);
       await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipMeta')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:272:39
       await persistImportedHistory(options?.history);
       await persistImportedRsipNodes(options?.rsipNodes);
       await persistImportedRsipMeta(options?.rsipMeta);
-      await persistImportedRsipGroups(options?.rsipGroups);
+      await persistImportedRsipGroups(options.rsipGroups);
       await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
       await persistImportedRsipRunHistory(options?.rsipRunHistory);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipGroups')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:273:40
       await persistImportedRsipNodes(options?.rsipNodes);
       await persistImportedRsipMeta(options?.rsipMeta);
       await persistImportedRsipGroups(options?.rsipGroups);
-      await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
+      await persistImportedRsipLibrary(options.rsipPolicyLibrary);
       await persistImportedRsipRunHistory(options?.rsipRunHistory);
       await persistImportedRsipExecutionRecords(options?.rsipExecutionRecords);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipPolicyLibrary')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:274:43
       await persistImportedRsipMeta(options?.rsipMeta);
       await persistImportedRsipGroups(options?.rsipGroups);
       await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
-      await persistImportedRsipRunHistory(options?.rsipRunHistory);
+      await persistImportedRsipRunHistory(options.rsipRunHistory);
       await persistImportedRsipExecutionRecords(options?.rsipExecutionRecords);
       await persistImportedRsipTaskLinks(options?.rsipTaskLinks);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipRunHistory')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:275:49
       await persistImportedRsipGroups(options?.rsipGroups);
       await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
       await persistImportedRsipRunHistory(options?.rsipRunHistory);
-      await persistImportedRsipExecutionRecords(options?.rsipExecutionRecords);
+      await persistImportedRsipExecutionRecords(options.rsipExecutionRecords);
       await persistImportedRsipTaskLinks(options?.rsipTaskLinks);
       await persistImportedPetState(options?.petState);
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipExecutionRecords')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:276:42
       await persistImportedRsipLibrary(options?.rsipPolicyLibrary);
       await persistImportedRsipRunHistory(options?.rsipRunHistory);
       await persistImportedRsipExecutionRecords(options?.rsipExecutionRecords);
-      await persistImportedRsipTaskLinks(options?.rsipTaskLinks);
+      await persistImportedRsipTaskLinks(options.rsipTaskLinks);
       await persistImportedPetState(options?.petState);
 
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipTaskLinks')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:277:37
       await persistImportedRsipRunHistory(options?.rsipRunHistory);
       await persistImportedRsipExecutionRecords(options?.rsipExecutionRecords);
       await persistImportedRsipTaskLinks(options?.rsipTaskLinks);
-      await persistImportedPetState(options?.petState);
+      await persistImportedPetState(options.petState);
 
       logger.info('APP_SHELL', '导入数据保存成功，更新 UI 状态');
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'petState')

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:279:19
       await persistImportedRsipTaskLinks(options?.rsipTaskLinks);
       await persistImportedPetState(options?.petState);
 
-      logger.info('APP_SHELL', '导入数据保存成功，更新 UI 状态');
+      logger.info("", '导入数据保存成功，更新 UI 状态');
 
       setState((prev) => ({
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '导入数据保存成功，更新 UI 状态' ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:287:11
         chainsRevision: prev.chainsRevision + 1,
         completionHistory: appendIfNonEmpty(
           prev.completionHistory,
-          options?.history,
+          options.history,
         ),
         rsipNodes: appendIfNonEmpty(prev.rsipNodes, options?.rsipNodes),
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'history')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:289:53
           prev.completionHistory,
           options?.history,
         ),
-        rsipNodes: appendIfNonEmpty(prev.rsipNodes, options?.rsipNodes),
+        rsipNodes: appendIfNonEmpty(prev.rsipNodes, options.rsipNodes),
         rsipMeta: options?.rsipMeta
           ? { ...prev.rsipMeta, ...options.rsipMeta }
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipNodes')

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:290:19
           options?.history,
         ),
         rsipNodes: appendIfNonEmpty(prev.rsipNodes, options?.rsipNodes),
-        rsipMeta: options?.rsipMeta
+        rsipMeta: options.rsipMeta
           ? { ...prev.rsipMeta, ...options.rsipMeta }
           : prev.rsipMeta,
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipMeta')

[Survived] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:294:11
           ? { ...prev.rsipMeta, ...options.rsipMeta }
           : prev.rsipMeta,
         rsipGroups: appendIfNonEmpty(
-          prev.rsipGroups ?? [],
+          prev.rsipGroups && [],
           options?.rsipGroups,
         ),

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:295:11
           : prev.rsipMeta,
         rsipGroups: appendIfNonEmpty(
           prev.rsipGroups ?? [],
-          options?.rsipGroups,
+          options.rsipGroups,
         ),
         rsipPolicyLibrary: appendIfNonEmpty(
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipGroups')

[Survived] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:298:11
           options?.rsipGroups,
         ),
         rsipPolicyLibrary: appendIfNonEmpty(
-          prev.rsipPolicyLibrary ?? [],
+          prev.rsipPolicyLibrary && [],
           options?.rsipPolicyLibrary,
         ),

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:299:11
         ),
         rsipPolicyLibrary: appendIfNonEmpty(
           prev.rsipPolicyLibrary ?? [],
-          options?.rsipPolicyLibrary,
+          options.rsipPolicyLibrary,
         ),
         rsipRunHistory: appendIfNonEmpty(
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipPolicyLibrary')

[Survived] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:302:11
           options?.rsipPolicyLibrary,
         ),
         rsipRunHistory: appendIfNonEmpty(
-          prev.rsipRunHistory ?? [],
+          prev.rsipRunHistory && [],
           options?.rsipRunHistory,
         ),

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:303:11
         ),
         rsipRunHistory: appendIfNonEmpty(
           prev.rsipRunHistory ?? [],
-          options?.rsipRunHistory,
+          options.rsipRunHistory,
         ),
         rsipExecutionRecords: appendIfNonEmpty(
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipRunHistory')

[Survived] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:306:11
           options?.rsipRunHistory,
         ),
         rsipExecutionRecords: appendIfNonEmpty(
-          prev.rsipExecutionRecords ?? [],
+          prev.rsipExecutionRecords && [],
           options?.rsipExecutionRecords,
         ),

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:307:11
         ),
         rsipExecutionRecords: appendIfNonEmpty(
           prev.rsipExecutionRecords ?? [],
-          options?.rsipExecutionRecords,
+          options.rsipExecutionRecords,
         ),
         rsipTaskLinks: appendIfNonEmpty(
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipExecutionRecords')

[Survived] LogicalOperator
src/hooks/domains/useImportExportDomain.ts:310:11
           options?.rsipExecutionRecords,
         ),
         rsipTaskLinks: appendIfNonEmpty(
-          prev.rsipTaskLinks ?? [],
+          prev.rsipTaskLinks && [],
           options?.rsipTaskLinks,
         ),

[Survived] ArrayDeclaration
src/hooks/domains/useImportExportDomain.ts:310:33
           options?.rsipExecutionRecords,
         ),
         rsipTaskLinks: appendIfNonEmpty(
-          prev.rsipTaskLinks ?? [],
+          prev.rsipTaskLinks ?? ["Stryker was here"],
           options?.rsipTaskLinks,
         ),

[Killed] OptionalChaining
src/hooks/domains/useImportExportDomain.ts:311:11
         ),
         rsipTaskLinks: appendIfNonEmpty(
           prev.rsipTaskLinks ?? [],
-          options?.rsipTaskLinks,
+          options.rsipTaskLinks,
         ),
       }));
killedBy: useImportExportDomain should import chains without optional payloads and keep existing local view state arrays
statusReason: Cannot read properties of undefined (reading 'rsipTaskLinks')

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:315:32
         ),
       }));
 
-      logger.info('APP_SHELL', '导入完成，UI 状态更新完成');
+      logger.info('APP_SHELL', "");
     } catch (error) {
       const errorMessage =
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '导入完成，UI 状态更新完成' ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:315:19
         ),
       }));
 
-      logger.info('APP_SHELL', '导入完成，UI 状态更新完成');
+      logger.info("", '导入完成，UI 状态更新完成');
     } catch (error) {
       const errorMessage =
killedBy: useImportExportDomain should import chains and merge optional history/rsip payloads in local mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'APP_SHELL', '导入完成，UI 状态更新完成' ]

Received: 

  1st vi.fn() call:

  [
    "APP_SHELL",

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:316:21
       }));
 
       logger.info('APP_SHELL', '导入完成，UI 状态更新完成');
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error
-          ? error.message
-          : tr('未知错误', 'Unknown error');
-      logger.error(
-        'IMPORT',
-        'Failed to import data',
-        { errorMessage },
-        error instanceof Error ? error : undefined,
-      );
-
-      try {
-        await reloadStateAfterImportFailure();
-      } catch (reloadError) {
-        logger.error(
-          'IMPORT',
-          'Reload after import failure also failed',
-          undefined,
-          normalizeUnknownError(reloadError),
-        );
-      }
-
-      throw error instanceof Error ? error : new Error(errorMessage);
-    }
+    } catch (error) {}
   };
 
killedBy: useImportExportDomain should reject empty import payloads
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/hooks/domains/useImportExportDomain.ts:324:9
       logger.error(
         'IMPORT',
         'Failed to import data',
-        { errorMessage },
+        {},
         error instanceof Error ? error : undefined,
       );
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "IMPORT",

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:328:11
         error instanceof Error ? error : undefined,
       );
 
-      try {
-        await reloadStateAfterImportFailure();
-      } catch (reloadError) {
+      try {} catch (reloadError) {
         logger.error(
           'IMPORT',
killedBy: useImportExportDomain should reject ID conflicts and reload state after import failure
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/hooks/domains/useImportExportDomain.ts:330:29
 
       try {
         await reloadStateAfterImportFailure();
-      } catch (reloadError) {
-        logger.error(
-          'IMPORT',
-          'Reload after import failure also failed',
-          undefined,
-          normalizeUnknownError(reloadError),
-        );
-      }
+      } catch (reloadError) {}
 
       throw error instanceof Error ? error : new Error(errorMessage);
killedBy: useImportExportDomain should log reload failure after import failure and rethrow original error
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "IMPORT",

[Killed] StringLiteral
src/hooks/domains/useImportExportDomain.ts:333:11
       } catch (reloadError) {
         logger.error(
           'IMPORT',
-          'Reload after import failure also failed',
+          "",
           undefined,
           normalizeUnknownError(reloadError),
killedBy: useImportExportDomain should log reload failure after import failure and rethrow original error
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "IMPORT",
