[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:62:27
   expand: () => Promise<void>;
 }
 
-const DECAY_INTERVAL_MS = 5 * 60 * 1000; // 5 minutes
+const DECAY_INTERVAL_MS = 5 / 60 * 1000; // 5 minutes
 
 export function usePetDomain(): UsePetDomainReturn {
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected 35 to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:62:27
   expand: () => Promise<void>;
 }
 
-const DECAY_INTERVAL_MS = 5 * 60 * 1000; // 5 minutes
+const DECAY_INTERVAL_MS = 5 * 60 / 1000; // 5 minutes
 
 export function usePetDomain(): UsePetDomainReturn {
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/hooks/domains/usePetDomain.ts:67:46
 export function usePetDomain(): UsePetDomainReturn {
   const storage = useStorage();
   const [pet, setPet] = useState<PetState | null>(null);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [mood, setMood] = useState<PetMood>('neutral');
   const decayIntervalRef = useRef<ReturnType<typeof setInterval> | null>(null);

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:72:43
   const decayIntervalRef = useRef<ReturnType<typeof setInterval> | null>(null);
 
   // Load pet state on mount
-  const loadPet = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      const savedPet = await storage.getPetState();
-      if (savedPet) {
-        // Apply decay since last session
-        const decayedState = calculateDecay(savedPet, new Date());
-        const updatedPet = { ...savedPet, ...decayedState };
-        setPet(updatedPet);
-        setMood(calculateMood(updatedPet));
-        await storage.savePetState(updatedPet);
-      }
-    } catch (error) {
-      logger.error(
-        'PET',
-        'Failed to load pet state',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    } finally {
-      setIsLoading(false);
-    }
-  }, [storage]);
+  const loadPet = useCallback(async () => {}, [storage]);
 
   // Create new pet
killedBy: usePetDomain should load saved pet, apply decay, and persist the updated pet
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:73:9
 
   // Load pet state on mount
   const loadPet = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      const savedPet = await storage.getPetState();
-      if (savedPet) {
-        // Apply decay since last session
-        const decayedState = calculateDecay(savedPet, new Date());
-        const updatedPet = { ...savedPet, ...decayedState };
-        setPet(updatedPet);
-        setMood(calculateMood(updatedPet));
-        await storage.savePetState(updatedPet);
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'PET',
killedBy: usePetDomain should load saved pet, apply decay, and persist the updated pet
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:76:21
     try {
       setIsLoading(true);
       const savedPet = await storage.getPetState();
-      if (savedPet) {
-        // Apply decay since last session
-        const decayedState = calculateDecay(savedPet, new Date());
-        const updatedPet = { ...savedPet, ...decayedState };
-        setPet(updatedPet);
-        setMood(calculateMood(updatedPet));
-        await storage.savePetState(updatedPet);
-      }
+      if (savedPet) {}
     } catch (error) {
       logger.error(
killedBy: usePetDomain should load saved pet, apply decay, and persist the updated pet
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:76:11
     try {
       setIsLoading(true);
       const savedPet = await storage.getPetState();
-      if (savedPet) {
+      if (true) {
         // Apply decay since last session
         const decayedState = calculateDecay(savedPet, new Date());
killedBy: usePetDomain should keep neutral mood and skip decay when no saved pet exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      null,

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:84:21
         setMood(calculateMood(updatedPet));
         await storage.savePetState(updatedPet);
       }
-    } catch (error) {
-      logger.error(
-        'PET',
-        'Failed to load pet state',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }
killedBy: usePetDomain should log load failure and stop loading when reading pet state throws
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:98:48
 
   // Create new pet
   const createPet = useCallback(
-    async (name: string): Promise<PetState> => {
-      const mobileOptions = isTauriMobile
-        ? {
-            position: { x: 65, y: 65 },
-            minimizedPosition: { x: 82, y: 8 },
-          }
-        : undefined;
-      const newPet = createNewPet(name, mobileOptions);
-      await storage.savePetState(newPet);
-      setPet(newPet);
-      setMood(calculateMood(newPet));
-      logger.info('PET', 'Created new pet', { name });
-      return newPet;
-    },
+    async (name: string): Promise<PetState> => {},
     [storage],
   );
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
src/hooks/domains/usePetDomain.ts:109:26
       await storage.savePetState(newPet);
       setPet(newPet);
       setMood(calculateMood(newPet));
-      logger.info('PET', 'Created new pet', { name });
+      logger.info('PET', "", { name });
       return newPet;
     },
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Created new pet', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] StringLiteral
src/hooks/domains/usePetDomain.ts:109:19
       await storage.savePetState(newPet);
       setPet(newPet);
       setMood(calculateMood(newPet));
-      logger.info('PET', 'Created new pet', { name });
+      logger.info("", 'Created new pet', { name });
       return newPet;
     },
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Created new pet', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "PET",

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:117:9
 
   // Feed the pet (manual action)
   const feedPet = useCallback(async (): Promise<FeedResult | null> => {
-    if (!pet) return null;
+    if (true) return null;
 
     const hungerReduced = Math.min(
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected null to deeply equal { hungerReduced: 30, …(2) }

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:117:9
 
   // Feed the pet (manual action)
   const feedPet = useCallback(async (): Promise<FeedResult | null> => {
-    if (!pet) return null;
+    if (false) return null;
 
     const hungerReduced = Math.min(
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:119:27
   const feedPet = useCallback(async (): Promise<FeedResult | null> => {
     if (!pet) return null;
 
-    const hungerReduced = Math.min(
-      pet.hunger,
-      DEFAULT_PET_CONFIG.feedingHungerReduction,
-    );
+    const hungerReduced = Math.max(pet.hunger, DEFAULT_PET_CONFIG.feedingHungerReduction);
     const newHunger = pet.hunger - hungerReduced;
     const happinessGained = Math.min(5, hungerReduced / 6);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { hungerReduced: 50, …(2) } to deeply equal { hungerReduced: 30, …(2) }

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:123:23
       pet.hunger,
       DEFAULT_PET_CONFIG.feedingHungerReduction,
     );
-    const newHunger = pet.hunger - hungerReduced;
+    const newHunger = pet.hunger + hungerReduced;
     const happinessGained = Math.min(5, hungerReduced / 6);
 
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { hungerReduced: 30, …(2) } to deeply equal { hungerReduced: 30, …(2) }

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:124:29
       DEFAULT_PET_CONFIG.feedingHungerReduction,
     );
     const newHunger = pet.hunger - hungerReduced;
-    const happinessGained = Math.min(5, hungerReduced / 6);
+    const happinessGained = Math.max(5, hungerReduced / 6);
 
     const updatedPet: PetState = {
killedBy: usePetDomain should compute feed values below cap when hunger is low
statusReason: expected 5 to be close to 2.05, received difference is 2.95, but expected 5e-7

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:124:41
       DEFAULT_PET_CONFIG.feedingHungerReduction,
     );
     const newHunger = pet.hunger - hungerReduced;
-    const happinessGained = Math.min(5, hungerReduced / 6);
+    const happinessGained = Math.min(5, hungerReduced * 6);
 
     const updatedPet: PetState = {
killedBy: usePetDomain should compute feed values below cap when hunger is low
statusReason: expected 5 to be close to 2.05, received difference is 2.95, but expected 5e-7

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:128:15
 
     const updatedPet: PetState = {
       ...pet,
-      hunger: Math.round(newHunger * 10) / 10,
+      hunger: Math.round(newHunger * 10) * 10,
       happiness: Math.min(
         100,
killedBy: usePetDomain should compute feed values with decimal rounding and happiness cap
statusReason: expected { id: 'feed-decimal', …(15) } to match object { hunger: 15.7, happiness: 71.7 }
(18 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:128:26
 
     const updatedPet: PetState = {
       ...pet,
-      hunger: Math.round(newHunger * 10) / 10,
+      hunger: Math.round(newHunger / 10) / 10,
       happiness: Math.min(
         100,
killedBy: usePetDomain should compute feed values with decimal rounding and happiness cap
statusReason: expected { id: 'feed-decimal', …(15) } to match object { hunger: 15.7, happiness: 71.7 }
(18 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:129:18
     const updatedPet: PetState = {
       ...pet,
       hunger: Math.round(newHunger * 10) / 10,
-      happiness: Math.min(
-        100,
-        Math.round((pet.happiness + happinessGained) * 10) / 10,
-      ),
+      happiness: Math.max(100, Math.round((pet.happiness + happinessGained) * 10) / 10),
       lastFedAt: new Date(),
       lastInteractedAt: new Date(),
killedBy: usePetDomain should compute feed values with decimal rounding and happiness cap
statusReason: expected { id: 'feed-decimal', …(15) } to match object { hunger: 15.7, happiness: 71.7 }
(18 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:131:9
       hunger: Math.round(newHunger * 10) / 10,
       happiness: Math.min(
         100,
-        Math.round((pet.happiness + happinessGained) * 10) / 10,
+        Math.round((pet.happiness + happinessGained) * 10) * 10,
       ),
       lastFedAt: new Date(),
killedBy: usePetDomain should compute feed values with decimal rounding and happiness cap
statusReason: expected { id: 'feed-decimal', …(15) } to match object { hunger: 15.7, happiness: 71.7 }
(18 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:131:21
       hunger: Math.round(newHunger * 10) / 10,
       happiness: Math.min(
         100,
-        Math.round((pet.happiness + happinessGained) * 10) / 10,
+        Math.round((pet.happiness - happinessGained) * 10) / 10,
       ),
       lastFedAt: new Date(),
killedBy: usePetDomain should compute feed values with decimal rounding and happiness cap
statusReason: expected { id: 'feed-decimal', …(15) } to match object { hunger: 15.7, happiness: 71.7 }
(18 matching properties omitted from actual)

[Killed] StringLiteral
src/hooks/domains/usePetDomain.ts:140:17
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
     setMood(calculateMood(updatedPet));
-    logger.info('PET', 'Fed pet', { hungerReduced, newHunger });
+    logger.info("", 'Fed pet', { hungerReduced, newHunger });
 
     return { hungerReduced, newHunger, happinessGained };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Fed pet', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] ObjectLiteral
src/hooks/domains/usePetDomain.ts:142:12
     setMood(calculateMood(updatedPet));
     logger.info('PET', 'Fed pet', { hungerReduced, newHunger });
 
-    return { hungerReduced, newHunger, happinessGained };
+    return {};
   }, [pet, storage]);
 
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected {} to deeply equal { hungerReduced: 30, …(2) }

[Killed] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:143:6
     logger.info('PET', 'Fed pet', { hungerReduced, newHunger });
 
     return { hungerReduced, newHunger, happinessGained };
-  }, [pet, storage]);
+  }, []);
 
   // Handle task completion (called from SessionsDomain)
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected null to deeply equal { hungerReduced: 30, …(2) }

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:151:11
       taskDuration: number,
       wasSuccessful: boolean,
     ): Promise<TaskCompletionReward | null> => {
-      if (!pet) return null;
+      if (false) return null;
 
       const reward = calculateTaskReward(pet, taskDuration, wasSuccessful);
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:151:11
       taskDuration: number,
       wasSuccessful: boolean,
     ): Promise<TaskCompletionReward | null> => {
-      if (!pet) return null;
+      if (true) return null;
 
       const reward = calculateTaskReward(pet, taskDuration, wasSuccessful);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:156:27
       const reward = calculateTaskReward(pet, taskDuration, wasSuccessful);
 
       // Calculate new experience (handle level up)
-      let newExperience = pet.experience + reward.xpGained;
+      let newExperience = pet.experience - reward.xpGained;
       if (reward.leveledUp) {
         newExperience = newExperience - getXpForLevel(pet.level);
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:157:11
 
       // Calculate new experience (handle level up)
       let newExperience = pet.experience + reward.xpGained;
-      if (reward.leveledUp) {
+      if (false) {
         newExperience = newExperience - getXpForLevel(pet.level);
       }
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:157:11
 
       // Calculate new experience (handle level up)
       let newExperience = pet.experience + reward.xpGained;
-      if (reward.leveledUp) {
+      if (true) {
         newExperience = newExperience - getXpForLevel(pet.level);
       }
killedBy: usePetDomain should keep level and stage when reward does not provide upgrades
statusReason: expected { id: 'task-fallback', …(15) } to match object { level: 3, stage: 'adult', …(3) }
(15 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:158:25
       // Calculate new experience (handle level up)
       let newExperience = pet.experience + reward.xpGained;
       if (reward.leveledUp) {
-        newExperience = newExperience - getXpForLevel(pet.level);
+        newExperience = newExperience + getXpForLevel(pet.level);
       }
 
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:163:17
 
       const updatedPet: PetState = {
         ...pet,
-        hunger: Math.max(
-          0,
-          Math.round((pet.hunger - reward.hungerReduced) * 10) / 10,
-        ),
+        hunger: Math.min(0, Math.round((pet.hunger - reward.hungerReduced) * 10) / 10),
         happiness: Math.min(
           100,
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:165:22
         ...pet,
         hunger: Math.max(
           0,
-          Math.round((pet.hunger - reward.hungerReduced) * 10) / 10,
+          Math.round((pet.hunger - reward.hungerReduced) / 10) / 10,
         ),
         happiness: Math.min(
killedBy: usePetDomain should keep level and stage when reward does not provide upgrades
statusReason: expected { id: 'task-fallback', …(15) } to match object { level: 3, stage: 'adult', …(3) }
(15 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:165:11
         ...pet,
         hunger: Math.max(
           0,
-          Math.round((pet.hunger - reward.hungerReduced) * 10) / 10,
+          Math.round((pet.hunger - reward.hungerReduced) * 10) * 10,
         ),
         happiness: Math.min(
killedBy: usePetDomain should keep level and stage when reward does not provide upgrades
statusReason: expected { id: 'task-fallback', …(15) } to match object { level: 3, stage: 'adult', …(3) }
(15 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:167:20
           0,
           Math.round((pet.hunger - reward.hungerReduced) * 10) / 10,
         ),
-        happiness: Math.min(
-          100,
-          Math.max(
-            0,
-            Math.round((pet.happiness + reward.happinessGained) * 10) / 10,
-          ),
-        ),
+        happiness: Math.max(100, Math.max(0, Math.round((pet.happiness + reward.happinessGained) * 10) / 10)),
         experience: newExperience,
         level: reward.newLevel ?? pet.level,
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/usePetDomain.ts:169:11
         ),
         happiness: Math.min(
           100,
-          Math.max(
-            0,
-            Math.round((pet.happiness + reward.happinessGained) * 10) / 10,
-          ),
+          Math.min(0, Math.round((pet.happiness + reward.happinessGained) * 10) / 10),
         ),
         experience: newExperience,
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:171:13
           100,
           Math.max(
             0,
-            Math.round((pet.happiness + reward.happinessGained) * 10) / 10,
+            Math.round((pet.happiness + reward.happinessGained) * 10) * 10,
           ),
         ),
killedBy: usePetDomain should keep level and stage when reward does not provide upgrades
statusReason: expected { id: 'task-fallback', …(15) } to match object { level: 3, stage: 'adult', …(3) }
(15 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/usePetDomain.ts:171:24
           100,
           Math.max(
             0,
-            Math.round((pet.happiness + reward.happinessGained) * 10) / 10,
+            Math.round((pet.happiness + reward.happinessGained) / 10) / 10,
           ),
         ),
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:175:16
           ),
         ),
         experience: newExperience,
-        level: reward.newLevel ?? pet.level,
+        level: reward.newLevel && pet.level,
         stage: reward.newStage ?? pet.stage,
         lastInteractedAt: new Date(),
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:176:16
         ),
         experience: newExperience,
         level: reward.newLevel ?? pet.level,
-        stage: reward.newStage ?? pet.stage,
+        stage: reward.newStage && pet.stage,
         lastInteractedAt: new Date(),
       };
killedBy: usePetDomain should clamp hunger and happiness and apply level-up xp subtraction on task completion
statusReason: expected { id: 'task-pet', name: 'Momo', …(14) } to match object { hunger: +0, happiness: 100, …(3) }
(15 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:197:37
 
   // Update pet position (for dragging when expanded)
   const updatePosition = useCallback(
-    async (x: number, y: number) => {
-      if (!pet) return;
-
-      const updatedPet = { ...pet, position: { x, y } };
-      await storage.savePetState(updatedPet);
-      setPet(updatedPet);
-    },
+    async (x: number, y: number) => {},
     [pet, storage],
   );
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { x: 80, y: 80 } to deeply equal { x: 10, y: 20 }

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:198:11
   // Update pet position (for dragging when expanded)
   const updatePosition = useCallback(
     async (x: number, y: number) => {
-      if (!pet) return;
+      if (false) return;
 
       const updatedPet = { ...pet, position: { x, y } };
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:198:11
   // Update pet position (for dragging when expanded)
   const updatePosition = useCallback(
     async (x: number, y: number) => {
-      if (!pet) return;
+      if (true) return;
 
       const updatedPet = { ...pet, position: { x, y } };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { x: 80, y: 80 } to deeply equal { x: 10, y: 20 }

[Killed] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:204:5
       await storage.savePetState(updatedPet);
       setPet(updatedPet);
     },
-    [pet, storage],
+    [],
   );
 
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { x: 80, y: 80 } to deeply equal { x: 10, y: 20 }

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:209:37
 
   // Update minimized position (for dragging when minimized)
   const updateMinimizedPosition = useCallback(
-    async (x: number, y: number) => {
-      if (!pet) return;
-
-      const updatedPet = { ...pet, minimizedPosition: { x, y } };
-      await storage.savePetState(updatedPet);
-      setPet(updatedPet);
-    },
+    async (x: number, y: number) => {},
     [pet, storage],
   );
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected { x: 92, y: 2 } to deeply equal { x: 30, y: 40 }

[Killed] ObjectLiteral
src/hooks/domains/usePetDomain.ts:212:26
     async (x: number, y: number) => {
       if (!pet) return;
 
-      const updatedPet = { ...pet, minimizedPosition: { x, y } };
+      const updatedPet = {};
       await storage.savePetState(updatedPet);
       setPet(updatedPet);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected undefined to deeply equal { x: 30, y: 40 }

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:220:52
   );
 
   // Toggle visibility
-  const toggleVisibility = useCallback(async () => {
-    if (!pet) return;
-
-    const updatedPet = { ...pet, isVisible: !pet.isVisible };
-    await storage.savePetState(updatedPet);
-    setPet(updatedPet);
-  }, [pet, storage]);
+  const toggleVisibility = useCallback(async () => {}, [pet, storage]);
 
   // Show pet (make visible)
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:221:9
 
   // Toggle visibility
   const toggleVisibility = useCallback(async () => {
-    if (!pet) return;
+    if (pet) return;
 
     const updatedPet = { ...pet, isVisible: !pet.isVisible };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:221:9
 
   // Toggle visibility
   const toggleVisibility = useCallback(async () => {
-    if (!pet) return;
+    if (true) return;
 
     const updatedPet = { ...pet, isVisible: !pet.isVisible };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:223:45
   const toggleVisibility = useCallback(async () => {
     if (!pet) return;
 
-    const updatedPet = { ...pet, isVisible: !pet.isVisible };
+    const updatedPet = { ...pet, isVisible: pet.isVisible };
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:226:6
     const updatedPet = { ...pet, isVisible: !pet.isVisible };
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
-  }, [pet, storage]);
+  }, []);
 
   // Show pet (make visible)
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:229:43
   }, [pet, storage]);
 
   // Show pet (make visible)
-  const showPet = useCallback(async () => {
-    if (!pet || pet.isVisible) return;
-
-    const updatedPet = { ...pet, isVisible: true };
-    await storage.savePetState(updatedPet);
-    setPet(updatedPet);
-  }, [pet, storage]);
+  const showPet = useCallback(async () => {}, [pet, storage]);
 
   // Minimize pet - minimize at the current expanded position
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality
