[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:230:9
 
   // Show pet (make visible)
   const showPet = useCallback(async () => {
-    if (!pet || pet.isVisible) return;
+    if (!pet && pet.isVisible) return;
 
     const updatedPet = { ...pet, isVisible: true };
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:230:9
 
   // Show pet (make visible)
   const showPet = useCallback(async () => {
-    if (!pet || pet.isVisible) return;
+    if (pet || pet.isVisible) return;
 
     const updatedPet = { ...pet, isVisible: true };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:232:45
   const showPet = useCallback(async () => {
     if (!pet || pet.isVisible) return;
 
-    const updatedPet = { ...pet, isVisible: true };
+    const updatedPet = { ...pet, isVisible: false };
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:238:44
   }, [pet, storage]);
 
   // Minimize pet - minimize at the current expanded position
-  const minimize = useCallback(async () => {
-    if (!pet || pet.isMinimized) return;
-
-    // Minimize at current position for seamless experience
-    const updatedPet = {
-      ...pet,
-      isMinimized: true,
-      minimizedPosition: { ...pet.position }, // Minimize at current position
-    };
-    await storage.savePetState(updatedPet);
-    setPet(updatedPet);
-    logger.info('PET', 'Pet minimized');
-  }, [pet, storage]);
+  const minimize = useCallback(async () => {}, [pet, storage]);
 
   // Expand pet (restore from minimized) - expand at the minimized position
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:239:9
 
   // Minimize pet - minimize at the current expanded position
   const minimize = useCallback(async () => {
-    if (!pet || pet.isMinimized) return;
+    if (true) return;
 
     // Minimize at current position for seamless experience
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:239:9
 
   // Minimize pet - minimize at the current expanded position
   const minimize = useCallback(async () => {
-    if (!pet || pet.isMinimized) return;
+    if (!pet && pet.isMinimized) return;
 
     // Minimize at current position for seamless experience
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ObjectLiteral
src/hooks/domains/usePetDomain.ts:242:24
     if (!pet || pet.isMinimized) return;
 
     // Minimize at current position for seamless experience
-    const updatedPet = {
-      ...pet,
-      isMinimized: true,
-      minimizedPosition: { ...pet.position }, // Minimize at current position
-    };
+    const updatedPet = {};
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:244:20
     // Minimize at current position for seamless experience
     const updatedPet = {
       ...pet,
-      isMinimized: true,
+      isMinimized: false,
       minimizedPosition: { ...pet.position }, // Minimize at current position
     };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/hooks/domains/usePetDomain.ts:249:24
     };
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
-    logger.info('PET', 'Pet minimized');
+    logger.info('PET', "");
   }, [pet, storage]);
 
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet minimized' ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:250:6
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
     logger.info('PET', 'Pet minimized');
-  }, [pet, storage]);
+  }, []);
 
   // Expand pet (restore from minimized) - expand at the minimized position
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:253:42
   }, [pet, storage]);
 
   // Expand pet (restore from minimized) - expand at the minimized position
-  const expand = useCallback(async () => {
-    if (!pet || !pet.isMinimized) return;
-
-    // Expand at the current minimized position for a seamless experience
-    const updatedPet = {
-      ...pet,
-      isMinimized: false,
-      position: { ...pet.minimizedPosition }, // Expand at minimized position
-    };
-    await storage.savePetState(updatedPet);
-    setPet(updatedPet);
-    logger.info('PET', 'Pet expanded');
-  }, [pet, storage]);
+  const expand = useCallback(async () => {}, [pet, storage]);
 
   // Setup decay interval
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:254:9
 
   // Expand pet (restore from minimized) - expand at the minimized position
   const expand = useCallback(async () => {
-    if (!pet || !pet.isMinimized) return;
+    if (pet || !pet.isMinimized) return;
 
     // Expand at the current minimized position for a seamless experience
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:254:9
 
   // Expand pet (restore from minimized) - expand at the minimized position
   const expand = useCallback(async () => {
-    if (!pet || !pet.isMinimized) return;
+    if (!pet && !pet.isMinimized) return;
 
     // Expand at the current minimized position for a seamless experience
killedBy: usePetDomain should return null for feed/task actions and no-op mutators when no pet exists
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:259:20
     // Expand at the current minimized position for a seamless experience
     const updatedPet = {
       ...pet,
-      isMinimized: false,
+      isMinimized: true,
       position: { ...pet.minimizedPosition }, // Expand at minimized position
     };
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/hooks/domains/usePetDomain.ts:264:24
     };
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
-    logger.info('PET', 'Pet expanded');
+    logger.info('PET', "");
   }, [pet, storage]);
 
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet expanded' ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:265:6
     await storage.savePetState(updatedPet);
     setPet(updatedPet);
     logger.info('PET', 'Pet expanded');
-  }, [pet, storage]);
+  }, []);
 
   // Setup decay interval
killedBy: usePetDomain should create pet and handle feed/task/position/visibility actions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:269:9
 
   // Setup decay interval
   useEffect(() => {
-    if (!pet) return;
+    if (true) return;
 
     const runDecay = async () => {
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet is starving!', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:269:9
 
   // Setup decay interval
   useEffect(() => {
-    if (!pet) return;
+    if (pet) return;
 
     const runDecay = async () => {
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet is starving!', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:271:34
   useEffect(() => {
     if (!pet) return;
 
-    const runDecay = async () => {
-      const decayedState = calculateDecay(pet, new Date());
-
-      // Only update if there's actual change
-      if (
-        decayedState.hunger !== pet.hunger ||
-        decayedState.happiness !== pet.happiness ||
-        decayedState.health !== pet.health
-      ) {
-        const updatedPet = { ...pet, ...decayedState };
-        await storage.savePetState(updatedPet);
-        setPet(updatedPet);
-        setMood(calculateMood(updatedPet));
-
-        // Log warnings
-        if (updatedPet.hunger > 80 && pet.hunger <= 80) {
-          logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
-        }
-        if (updatedPet.health < 30 && pet.health >= 30) {
-          logger.warn('PET', 'Pet health is low!', {
-            health: updatedPet.health,
-          });
-        }
-      }
-    };
+    const runDecay = async () => {};
 
     decayIntervalRef.current = setInterval(runDecay, DECAY_INTERVAL_MS);
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet is starving!', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:276:9
 
       // Only update if there's actual change
       if (
-        decayedState.hunger !== pet.hunger ||
-        decayedState.happiness !== pet.happiness ||
-        decayedState.health !== pet.health
+        false
       ) {
         const updatedPet = { ...pet, ...decayedState };
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet is starving!', …(1) ]

Number of calls: 0

[Killed] LogicalOperator
src/hooks/domains/usePetDomain.ts:276:9
 
       // Only update if there's actual change
       if (
-        decayedState.hunger !== pet.hunger ||
-        decayedState.happiness !== pet.happiness ||
-        decayedState.health !== pet.health
+        (decayedState.hunger !== pet.hunger || decayedState.happiness !== pet.happiness) && decayedState.health !== pet.health
       ) {
         const updatedPet = { ...pet, ...decayedState };
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected 35 to be 20 // Object.is equality

[Survived] EqualityOperator
src/hooks/domains/usePetDomain.ts:277:9
       // Only update if there's actual change
       if (
         decayedState.hunger !== pet.hunger ||
-        decayedState.happiness !== pet.happiness ||
+        decayedState.happiness === pet.happiness ||
         decayedState.health !== pet.health
       ) {

[Survived] ConditionalExpression
src/hooks/domains/usePetDomain.ts:277:9
       // Only update if there's actual change
       if (
         decayedState.hunger !== pet.hunger ||
-        decayedState.happiness !== pet.happiness ||
+        false ||
         decayedState.health !== pet.health
       ) {

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:278:9
       if (
         decayedState.hunger !== pet.hunger ||
         decayedState.happiness !== pet.happiness ||
-        decayedState.health !== pet.health
+        false
       ) {
         const updatedPet = { ...pet, ...decayedState };
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected 35 to be 20 // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/usePetDomain.ts:278:9
       if (
         decayedState.hunger !== pet.hunger ||
         decayedState.happiness !== pet.happiness ||
-        decayedState.health !== pet.health
+        decayedState.health === pet.health
       ) {
         const updatedPet = { ...pet, ...decayedState };
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected 35 to be 20 // Object.is equality

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:279:9
         decayedState.hunger !== pet.hunger ||
         decayedState.happiness !== pet.happiness ||
         decayedState.health !== pet.health
-      ) {
-        const updatedPet = { ...pet, ...decayedState };
-        await storage.savePetState(updatedPet);
-        setPet(updatedPet);
-        setMood(calculateMood(updatedPet));
-
-        // Log warnings
-        if (updatedPet.hunger > 80 && pet.hunger <= 80) {
-          logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
-        }
-        if (updatedPet.health < 30 && pet.health >= 30) {
-          logger.warn('PET', 'Pet health is low!', {
-            health: updatedPet.health,
-          });
-        }
-      }
+      ) {}
     };
 
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet is starving!', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:286:13
         setMood(calculateMood(updatedPet));
 
         // Log warnings
-        if (updatedPet.hunger > 80 && pet.hunger <= 80) {
+        if (true) {
           logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
         }
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected "vi.fn()" to not be called with arguments: [ 'PET', 'Pet is starving!', Anything ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:286:13
         setMood(calculateMood(updatedPet));
 
         // Log warnings
-        if (updatedPet.hunger > 80 && pet.hunger <= 80) {
+        if (true && pet.hunger <= 80) {
           logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
         }
killedBy: usePetDomain should persist decay updates when only health changes and trigger health warning threshold crossing
statusReason: expected "vi.fn()" to not be called with arguments: [ 'PET', 'Pet is starving!', Anything ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:289:13
         if (updatedPet.hunger > 80 && pet.hunger <= 80) {
           logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
         }
-        if (updatedPet.health < 30 && pet.health >= 30) {
+        if (false) {
           logger.warn('PET', 'Pet health is low!', {
             health: updatedPet.health,
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet health is low!', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] EqualityOperator
src/hooks/domains/usePetDomain.ts:289:13
         if (updatedPet.hunger > 80 && pet.hunger <= 80) {
           logger.warn('PET', 'Pet is starving!', { hunger: updatedPet.hunger });
         }
-        if (updatedPet.health < 30 && pet.health >= 30) {
+        if (updatedPet.health >= 30 && pet.health >= 30) {
           logger.warn('PET', 'Pet health is low!', {
             health: updatedPet.health,
killedBy: usePetDomain should run periodic decay and emit starvation/health warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'PET', 'Pet health is low!', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "PET",

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:299:18
 
     decayIntervalRef.current = setInterval(runDecay, DECAY_INTERVAL_MS);
 
-    return () => {
-      if (decayIntervalRef.current) {
-        clearInterval(decayIntervalRef.current);
-      }
-    };
+    return () => {};
   }, [pet, storage]);
 
killedBy: usePetDomain should skip decay persistence when there is no stat change and clear interval on unmount
statusReason: expected "clearInterval" to be called at least once

[Killed] ConditionalExpression
src/hooks/domains/usePetDomain.ts:300:11
     decayIntervalRef.current = setInterval(runDecay, DECAY_INTERVAL_MS);
 
     return () => {
-      if (decayIntervalRef.current) {
+      if (false) {
         clearInterval(decayIntervalRef.current);
       }
killedBy: usePetDomain should skip decay persistence when there is no stat change and clear interval on unmount
statusReason: expected "clearInterval" to be called at least once

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:300:37
     decayIntervalRef.current = setInterval(runDecay, DECAY_INTERVAL_MS);
 
     return () => {
-      if (decayIntervalRef.current) {
-        clearInterval(decayIntervalRef.current);
-      }
+      if (decayIntervalRef.current) {}
     };
   }, [pet, storage]);
killedBy: usePetDomain should skip decay persistence when there is no stat change and clear interval on unmount
statusReason: expected "clearInterval" to be called at least once

[Killed] BlockStatement
src/hooks/domains/usePetDomain.ts:307:19
   }, [pet, storage]);
 
   // Load on mount
-  useEffect(() => {
-    loadPet();
-  }, [loadPet]);
+  useEffect(() => {}, [loadPet]);
 
   return {
killedBy: usePetDomain should load saved pet, apply decay, and persist the updated pet
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
src/hooks/domains/usePetDomain.ts:309:6
   // Load on mount
   useEffect(() => {
     loadPet();
-  }, [loadPet]);
+  }, []);
 
   return {

[Killed] BooleanLiteral
src/hooks/domains/usePetDomain.ts:315:13
     pet,
     mood,
     isLoading,
-    hasPet: !!pet,
+    hasPet: !pet,
 
     // Actions
killedBy: usePetDomain should load saved pet, apply decay, and persist the updated pet
statusReason: expected false to be true // Object.is equality
