[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:44:22
       );
 
       const updatedScheduledSessions = state.scheduledSessions.filter(
-        (session) => session.chainId !== chainId,
+        (session) => false,
       );
       const updatedActiveSession =
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: expected "vi.fn()" to be called with arguments: [ ArrayContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ArrayContaining [

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:47:9
         (session) => session.chainId !== chainId,
       );
       const updatedActiveSession =
-        state.activeSession?.chainId === chainId ? null : state.activeSession;
+        true ? null : state.activeSession;
 
       storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
killedBy: useRecycleBinDomain should keep active session and current view when deleting a different chain
statusReason: expected undefined to be 'active-chain' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:47:9
         (session) => session.chainId !== chainId,
       );
       const updatedActiveSession =
-        state.activeSession?.chainId === chainId ? null : state.activeSession;
+        false ? null : state.activeSession;
 
       storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: expected "vi.fn()" to be called with arguments: [ null ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:49:80
       const updatedActiveSession =
         state.activeSession?.chainId === chainId ? null : state.activeSession;
 
-      storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
-        logger.error(
-          'RECYCLE_BIN',
-          'Failed to persist scheduled sessions after delete',
-          { chainId },
-          normalizeUnknownError(error),
-        );
-      });
+      storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {});
       if (!updatedActiveSession) {
         storage.saveActiveSession(null).catch((error) => {
killedBy: useRecycleBinDomain should log persistence failures after successful delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:51:11
 
       storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
         logger.error(
-          'RECYCLE_BIN',
+          "",
           'Failed to persist scheduled sessions after delete',
           { chainId },
killedBy: useRecycleBinDomain should log persistence failures after successful delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
-   "RECYCLE_BIN",

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:52:11
       storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
         logger.error(
           'RECYCLE_BIN',
-          'Failed to persist scheduled sessions after delete',
+          "",
           { chainId },
           normalizeUnknownError(error),
killedBy: useRecycleBinDomain should log persistence failures after successful delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[Killed] BooleanLiteral
src/hooks/domains/useRecycleBinDomain.ts:57:11
           normalizeUnknownError(error),
         );
       });
-      if (!updatedActiveSession) {
+      if (updatedActiveSession) {
         storage.saveActiveSession(null).catch((error) => {
           logger.error(
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: expected "vi.fn()" to be called with arguments: [ null ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:57:11
           normalizeUnknownError(error),
         );
       });
-      if (!updatedActiveSession) {
+      if (true) {
         storage.saveActiveSession(null).catch((error) => {
           logger.error(
killedBy: useRecycleBinDomain should keep active session and current view when deleting a different chain
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      null,

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:58:58
         );
       });
       if (!updatedActiveSession) {
-        storage.saveActiveSession(null).catch((error) => {
-          logger.error(
-            'RECYCLE_BIN',
-            'Failed to clear active session after delete',
-            { chainId },
-            normalizeUnknownError(error),
-          );
-        });
+        storage.saveActiveSession(null).catch((error) => {});
       }
 
killedBy: useRecycleBinDomain should log persistence failures after successful delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[Killed] ArrowFunction
src/hooks/domains/useRecycleBinDomain.ts:68:16
         });
       }
 
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-        scheduledSessions: updatedScheduledSessions,
-        activeSession: updatedActiveSession,
-        currentView: updatedActiveSession ? prev.currentView : 'dashboard',
-        viewingChainId:
-          prev.viewingChainId === chainId ? null : prev.viewingChainId,
-      }));
+      setState(() => undefined);
     } catch (error) {
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: Cannot read properties of undefined (reading 'chains')

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:76:11
         activeSession: updatedActiveSession,
         currentView: updatedActiveSession ? prev.currentView : 'dashboard',
         viewingChainId:
-          prev.viewingChainId === chainId ? null : prev.viewingChainId,
+          false ? null : prev.viewingChainId,
       }));
     } catch (error) {
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: expected 'chain-1' to be null

[Killed] EqualityOperator
src/hooks/domains/useRecycleBinDomain.ts:76:11
         activeSession: updatedActiveSession,
         currentView: updatedActiveSession ? prev.currentView : 'dashboard',
         viewingChainId:
-          prev.viewingChainId === chainId ? null : prev.viewingChainId,
+          prev.viewingChainId !== chainId ? null : prev.viewingChainId,
       }));
     } catch (error) {
killedBy: useRecycleBinDomain should delete chain, clean session state, and persist session cleanup
statusReason: expected 'chain-1' to be null

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:82:9
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
       logger.error(
         'RECYCLE_BIN',
-        'Delete failed',
+        "",
         { chainId },
         normalizeUnknownError(error),
killedBy: useRecycleBinDomain should show delete error and reload active chains when delete fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(4) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:88:39
       );
       toast.error(
         safeDetail
-          ? tr(`删除失败: ${safeDetail}`, `Delete failed: ${safeDetail}`)
+          ? tr(`删除失败: ${safeDetail}`, ``)
           : tr(
               '删除失败，请重试（详情见控制台）',
killedBy: useRecycleBinDomain should show delete error and reload active chains when delete fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'Delete failed: network down' ]

Received: 

  1st vi.fn() call:

  [
-   "Delete failed: network down",

[NoCoverage] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:91:15
           ? tr(`删除失败: ${safeDetail}`, `Delete failed: ${safeDetail}`)
           : tr(
               '删除失败，请重试（详情见控制台）',
-              'Delete failed. Check the console for details, then try again.',
+              "",
             ),
       );

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:95:11
             ),
       );
 
-      try {
-        const currentChains = await storage.getActiveChains();
-        setState((prev) => ({
-          ...prev,
-          chains: currentChains,
-          chainsRevision: prev.chainsRevision + 1,
-        }));
-      } catch {
+      try {} catch {
         toast.warning(
           tr(
killedBy: useRecycleBinDomain should show delete error and reload active chains when delete fails
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/hooks/domains/useRecycleBinDomain.ts:97:18
 
       try {
         const currentChains = await storage.getActiveChains();
-        setState((prev) => ({
-          ...prev,
-          chains: currentChains,
-          chainsRevision: prev.chainsRevision + 1,
-        }));
+        setState(() => undefined);
       } catch {
         toast.warning(
killedBy: useRecycleBinDomain should show delete error and reload active chains when delete fails
statusReason: Cannot read properties of undefined (reading 'chains')

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:102:15
           chains: currentChains,
           chainsRevision: prev.chainsRevision + 1,
         }));
-      } catch {
-        toast.warning(
-          tr(
-            '发生错误后无法恢复状态，建议刷新页面。',
-            "Couldn't restore state after the error. Refresh the page to recover.",
-          ),
-        );
-      }
+      } catch {}
     }
   };
killedBy: useRecycleBinDomain should warn user when delete recovery reload fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:114:9
   };
 
   const handleRestoreChains = async (chainIds: string[]) => {
-    try {
-      const updatedChains = await realTimeSyncService.restoreWithSync(
-        storage,
-        chainIds,
-      );
-
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
-    } catch (error) {
+    try {} catch (error) {
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
 
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[NoCoverage] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:128:67
     } catch (error) {
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
 
-      const rawMessage = error instanceof Error ? error.message : '';
+      const rawMessage = error instanceof Error ? error.message : "Stryker was here!";
       if (
         rawMessage.includes('Partial restore failure') ||

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:130:9
 
       const rawMessage = error instanceof Error ? error.message : '';
       if (
-        rawMessage.includes('Partial restore failure') ||
-        rawMessage.includes('failed to restore')
+        true
       ) {
         try {
killedBy: useRecycleBinDomain should show restore error for non-partial failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRecycleBinDomain.ts:130:9
 
       const rawMessage = error instanceof Error ? error.message : '';
       if (
-        rawMessage.includes('Partial restore failure') ||
-        rawMessage.includes('failed to restore')
+        false
       ) {
         try {
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:131:29
       const rawMessage = error instanceof Error ? error.message : '';
       if (
         rawMessage.includes('Partial restore failure') ||
-        rawMessage.includes('failed to restore')
+        rawMessage.includes("")
       ) {
         try {
killedBy: useRecycleBinDomain should show restore error for non-partial failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:132:9
       if (
         rawMessage.includes('Partial restore failure') ||
         rawMessage.includes('failed to restore')
-      ) {
-        try {
-          const currentChains = await storage.getActiveChains();
-          setState((prev) => ({
-            ...prev,
-            chains: currentChains,
-            chainsRevision: prev.chainsRevision + 1,
-          }));
-
-          toast.warning(
-            tr(
-              '部分链条恢复可能失败，请检查回收箱确认结果。',
-              'Some chains may have failed to restore. Please check the recycle bin.',
-            ),
-          );
-        } catch {
-          toast.warning(
-            tr(
-              '恢复操作遇到问题，请刷新页面查看最新状态。',
-              'Restore encountered an issue. Refresh to see the latest status.',
-            ),
-          );
-        }
-        return;
-      }
+      ) {}
 
       logger.error(
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:133:13
         rawMessage.includes('Partial restore failure') ||
         rawMessage.includes('failed to restore')
       ) {
-        try {
-          const currentChains = await storage.getActiveChains();
-          setState((prev) => ({
-            ...prev,
-            chains: currentChains,
-            chainsRevision: prev.chainsRevision + 1,
-          }));
-
-          toast.warning(
-            tr(
-              '部分链条恢复可能失败，请检查回收箱确认结果。',
-              'Some chains may have failed to restore. Please check the recycle bin.',
-            ),
-          );
-        } catch {
+        try {} catch {
           toast.warning(
             tr(
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/hooks/domains/useRecycleBinDomain.ts:135:31
       ) {
         try {
           const currentChains = await storage.getActiveChains();
-          setState((prev) => ({
-            ...prev,
-            chains: currentChains,
-            chainsRevision: prev.chainsRevision + 1,
-          }));
+          setState((prev) => ({}));
 
           toast.warning(
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected undefined to deeply equal [ { id: 'fresh-chain', …(23) } ]

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:143:15
 
           toast.warning(
             tr(
-              '部分链条恢复可能失败，请检查回收箱确认结果。',
+              "",
               'Some chains may have failed to restore. Please check the recycle bin.',
             ),
killedBy: useRecycleBinDomain should handle partial restore failure with warning and refresh
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringMatching /.+/,

[NoCoverage] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:147:17
               'Some chains may have failed to restore. Please check the recycle bin.',
             ),
           );
-        } catch {
-          toast.warning(
-            tr(
-              '恢复操作遇到问题，请刷新页面查看最新状态。',
-              'Restore encountered an issue. Refresh to see the latest status.',
-            ),
-          );
-        }
+        } catch {}
         return;
       }

[NoCoverage] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:150:15
         } catch {
           toast.warning(
             tr(
-              '恢复操作遇到问题，请刷新页面查看最新状态。',
+              "",
               'Restore encountered an issue. Refresh to see the latest status.',
             ),

[Killed] ObjectLiteral
src/hooks/domains/useRecycleBinDomain.ts:161:9
       logger.error(
         'RECYCLE_BIN',
         'Restore failed',
-        { chainIds },
+        {},
         normalizeUnknownError(error),
       );
killedBy: useRecycleBinDomain should show restore error for non-partial failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[NoCoverage] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:166:16
       );
       toast.error(
         safeDetail
-          ? tr(`恢复失败: ${safeDetail}`, `Restore failed: ${safeDetail}`)
+          ? tr(``, `Restore failed: ${safeDetail}`)
           : tr(
               '恢复失败，请重试（详情见控制台）',

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:168:15
         safeDetail
           ? tr(`恢复失败: ${safeDetail}`, `Restore failed: ${safeDetail}`)
           : tr(
-              '恢复失败，请重试（详情见控制台）',
+              "",
               'Restore failed. Check the console for details, then try again.',
             ),
killedBy: useRecycleBinDomain should show restore error for non-partial failures
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringMatching /.+/,

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:176:9
   };
 
   const handlePermanentDeleteChains = async (chainIds: string[]) => {
-    try {
-      const updatedChains = await realTimeSyncService.permanentDeleteWithSync(
-        storage,
-        chainIds,
-      );
-
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
-    } catch (error) {
+    try {} catch (error) {
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
       logger.error(
killedBy: useRecycleBinDomain should show permanent delete error when sync service fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRecycleBinDomain.ts:187:21
         chains: updatedChains,
         chainsRevision: prev.chainsRevision + 1,
       }));
-    } catch (error) {
-      const safeDetail = getSafeErrorDetailFromUnknown(error, language);
-      logger.error(
-        'RECYCLE_BIN',
-        'Permanent delete failed',
-        { chainIds },
-        normalizeUnknownError(error),
-      );
-      toast.error(
-        safeDetail
-          ? tr(
-              `永久删除失败: ${safeDetail}`,
-              `Permanent delete failed: ${safeDetail}`,
-            )
-          : tr(
-              '永久删除失败，请重试（详情见控制台）',
-              'Permanent delete failed. Check the console for details, then try again.',
-            ),
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: useRecycleBinDomain should show permanent delete error when sync service fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:191:9
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
       logger.error(
         'RECYCLE_BIN',
-        'Permanent delete failed',
+        "",
         { chainIds },
         normalizeUnknownError(error),
killedBy: useRecycleBinDomain should show permanent delete error when sync service fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'RECYCLE_BIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RECYCLE_BIN",

[Killed] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:198:15
       toast.error(
         safeDetail
           ? tr(
-              `永久删除失败: ${safeDetail}`,
+              ``,
               `Permanent delete failed: ${safeDetail}`,
             )
killedBy: useRecycleBinDomain should show permanent delete error when sync service fails
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringContaining "permission denied",

[NoCoverage] StringLiteral
src/hooks/domains/useRecycleBinDomain.ts:202:15
               `Permanent delete failed: ${safeDetail}`,
             )
           : tr(
-              '永久删除失败，请重试（详情见控制台）',
+              "",
               'Permanent delete failed. Check the console for details, then try again.',
             ),
