[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:24:19
 } from '../../services/rsip-integration/RSIPTaskIntegrationService';
 
 const INTERNALIZATION_TARGET_DAYS = 60;
-const DAY_IN_MS = 24 * 60 * 60 * 1000;
+const DAY_IN_MS = 24 * 60 / 60 * 1000;
 
 interface MarkExecutionOptions {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:24:19
 } from '../../services/rsip-integration/RSIPTaskIntegrationService';
 
 const INTERNALIZATION_TARGET_DAYS = 60;
-const DAY_IN_MS = 24 * 60 * 60 * 1000;
+const DAY_IN_MS = 24 * 60 * 60 / 1000;
 
 interface MarkExecutionOptions {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:48:63
   getState?: () => AppState;
 }
 
-function computeInternalizationProgress(days: number): number {
-  const raw = (Math.max(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
-  return Math.min(100, Math.round(raw * 100) / 100);
-}
+function computeInternalizationProgress(days: number): number {}
 
 function ensureDate(value: Date | undefined, fallback: Date): Date {
killedBy: useRsipDomain archives new and existing library entries with accumulated progress
statusReason: expected { id: 'archived-node', …(11) } to match object { title: 'Updated Title', …(5) }
(6 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:49:16
 }
 
 function computeInternalizationProgress(days: number): number {
-  const raw = (Math.max(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
+  const raw = (Math.max(0, days) * INTERNALIZATION_TARGET_DAYS) * 100;
   return Math.min(100, Math.round(raw * 100) / 100);
 }
killedBy: useRsipDomain archives new and existing library entries with accumulated progress
statusReason: expected { id: 'new-library-node', …(11) } to match object { cumulativeExecutionDays: 15, …(2) }
(9 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:49:16
 }
 
 function computeInternalizationProgress(days: number): number {
-  const raw = (Math.max(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
+  const raw = (Math.min(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
   return Math.min(100, Math.round(raw * 100) / 100);
 }
killedBy: useRsipDomain archives new and existing library entries with accumulated progress
statusReason: expected { id: 'archived-node', …(11) } to match object { title: 'Updated Title', …(5) }
(6 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:50:35
 
 function computeInternalizationProgress(days: number): number {
   const raw = (Math.max(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
-  return Math.min(100, Math.round(raw * 100) / 100);
+  return Math.min(100, Math.round(raw / 100) / 100);
 }
 
killedBy: useRsipDomain archives new and existing library entries with accumulated progress
statusReason: expected { id: 'archived-node', …(11) } to match object { title: 'Updated Title', …(5) }
(6 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:50:24
 
 function computeInternalizationProgress(days: number): number {
   const raw = (Math.max(0, days) / INTERNALIZATION_TARGET_DAYS) * 100;
-  return Math.min(100, Math.round(raw * 100) / 100);
+  return Math.min(100, Math.round(raw * 100) * 100);
 }
 
killedBy: useRsipDomain archives new and existing library entries with accumulated progress
statusReason: expected { id: 'new-library-node', …(11) } to match object { cumulativeExecutionDays: 15, …(2) }
(9 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:53:68
   return Math.min(100, Math.round(raw * 100) / 100);
 }
 
-function ensureDate(value: Date | undefined, fallback: Date): Date {
-  if (value instanceof Date && !Number.isNaN(value.getTime())) return value;
-  return fallback;
-}
+function ensureDate(value: Date | undefined, fallback: Date): Date {}
 
 function buildExecutionRecord(
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:54:7
 }
 
 function ensureDate(value: Date | undefined, fallback: Date): Date {
-  if (value instanceof Date && !Number.isNaN(value.getTime())) return value;
+  if (true) return value;
   return fallback;
 }
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:54:32
 }
 
 function ensureDate(value: Date | undefined, fallback: Date): Date {
-  if (value instanceof Date && !Number.isNaN(value.getTime())) return value;
+  if (value instanceof Date && Number.isNaN(value.getTime())) return value;
   return fallback;
 }
killedBy: useRsipDomain normalizes task links before saving and logs persistence failures
statusReason: expected { id: 'link-latest', …(9) } to match object { id: 'link-stale', …(2) }
(7 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:63:24
   status: RSIPExecutionRecord['status'],
   notes?: string,
   options?: MarkExecutionOptions | MarkViolationOptions,
-): RSIPExecutionRecord {
-  const now = new Date();
-  return {
-    id: crypto.randomUUID(),
-    nodeId,
-    executedAt: now,
-    status,
-    notes,
-    reasonCode: options?.reasonCode,
-    repairHint: options?.repairHint,
-    sourceChainId: options?.sourceChainId,
-    sourceEvent: options?.sourceEvent,
-  };
-}
+): RSIPExecutionRecord {}
 
 export function useRsipDomain({
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: Cannot read properties of undefined (reading 'nodeId')

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:65:10
   options?: MarkExecutionOptions | MarkViolationOptions,
 ): RSIPExecutionRecord {
   const now = new Date();
-  return {
-    id: crypto.randomUUID(),
-    nodeId,
-    executedAt: now,
-    status,
-    notes,
-    reasonCode: options?.reasonCode,
-    repairHint: options?.repairHint,
-    sourceChainId: options?.sourceChainId,
-    sourceEvent: options?.sourceEvent,
-  };
+  return {};
 }
 
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected {} to match object { id: 'new-record-id', …(4) }

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:71:17
     executedAt: now,
     status,
     notes,
-    reasonCode: options?.reasonCode,
+    reasonCode: options.reasonCode,
     repairHint: options?.repairHint,
     sourceChainId: options?.sourceChainId,
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: Cannot read properties of undefined (reading 'reasonCode')

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:72:17
     status,
     notes,
     reasonCode: options?.reasonCode,
-    repairHint: options?.repairHint,
+    repairHint: options.repairHint,
     sourceChainId: options?.sourceChainId,
     sourceEvent: options?.sourceEvent,
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: Cannot read properties of undefined (reading 'repairHint')

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:73:20
     notes,
     reasonCode: options?.reasonCode,
     repairHint: options?.repairHint,
-    sourceChainId: options?.sourceChainId,
+    sourceChainId: options.sourceChainId,
     sourceEvent: options?.sourceEvent,
   };
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: Cannot read properties of undefined (reading 'sourceChainId')

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:74:18
     reasonCode: options?.reasonCode,
     repairHint: options?.repairHint,
     sourceChainId: options?.sourceChainId,
-    sourceEvent: options?.sourceEvent,
+    sourceEvent: options.sourceEvent,
   };
 }
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: Cannot read properties of undefined (reading 'sourceEvent')

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:83:44
   storage,
   getState,
 }: UseRsipDomainParams) {
-  const readState = (): AppState | null => {
-    if (!getState) return null;
-    return getState();
-  };
+  const readState = (): AppState | null => {};
 
   const openRSIP = () => {
killedBy: useRsipDomain starts a new run when saving the first node into existing meta state
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:84:9
   getState,
 }: UseRsipDomainParams) {
   const readState = (): AppState | null => {
-    if (!getState) return null;
+    if (false) return null;
     return getState();
   };
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: expected [] to deeply equal [ { id: 'rsip-1', …(5) } ]

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:84:9
   getState,
 }: UseRsipDomainParams) {
   const readState = (): AppState | null => {
-    if (!getState) return null;
+    if (getState) return null;
     return getState();
   };
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: expected [] to deeply equal [ { id: 'rsip-1', …(5) } ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:88:26
     return getState();
   };
 
-  const openRSIP = () => {
-    setState((prev) => ({ ...prev, currentView: 'rsip' }));
-  };
+  const openRSIP = () => {};
 
   const appendExecutionRecord = async (record: RSIPExecutionRecord) => {
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected 'dashboard' to be 'rsip' // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:89:14
   };
 
   const openRSIP = () => {
-    setState((prev) => ({ ...prev, currentView: 'rsip' }));
+    setState(() => undefined);
   };
 
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:92:72
     setState((prev) => ({ ...prev, currentView: 'rsip' }));
   };
 
-  const appendExecutionRecord = async (record: RSIPExecutionRecord) => {
-    setState((prev) => ({
-      ...prev,
-      rsipExecutionRecords: [...(prev.rsipExecutionRecords ?? []), record],
-    }));
-
-    try {
-      await storage.appendRSIPExecutionRecord(record);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to append RSIP execution record',
-        { nodeId: record.nodeId, status: record.status },
-        toError(error),
-      );
-    }
-  };
+  const appendExecutionRecord = async (record: RSIPExecutionRecord) => {};
 
   const saveNodes = async (nodes: RSIPNode[]) => {
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:93:14
   };
 
   const appendExecutionRecord = async (record: RSIPExecutionRecord) => {
-    setState((prev) => ({
-      ...prev,
-      rsipExecutionRecords: [...(prev.rsipExecutionRecords ?? []), record],
-    }));
+    setState(() => undefined);
 
     try {
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: Cannot read properties of undefined (reading 'rsipExecutionRecords')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:95:34
   const appendExecutionRecord = async (record: RSIPExecutionRecord) => {
     setState((prev) => ({
       ...prev,
-      rsipExecutionRecords: [...(prev.rsipExecutionRecords ?? []), record],
+      rsipExecutionRecords: [...(prev.rsipExecutionRecords && []), record],
     }));
 
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected [ { id: 'new-record-id', …(8) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:98:9
       rsipExecutionRecords: [...(prev.rsipExecutionRecords ?? []), record],
     }));
 
-    try {
-      await storage.appendRSIPExecutionRecord(record);
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'RSIP',
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:100:21
 
     try {
       await storage.appendRSIPExecutionRecord(record);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to append RSIP execution record',
-        { nodeId: record.nodeId, status: record.status },
-        toError(error),
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Number of calls: 0

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:104:9
       logger.error(
         'RSIP',
         'Failed to append RSIP execution record',
-        { nodeId: record.nodeId, status: record.status },
+        {},
         toError(error),
       );
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:110:50
     }
   };
 
-  const saveNodes = async (nodes: RSIPNode[]) => {
-    const previousState = readState();
-    setState((prev) => ({ ...prev, rsipNodes: nodes }));
-
-    try {
-      await storage.saveRSIPNodes(nodes);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP nodes',
-        { nodeCount: nodes.length },
-        toError(error),
-      );
-    }
-
-    const previousCount = previousState?.rsipNodes.length ?? 0;
-    const meta = previousState?.rsipMeta;
-    if (previousCount === 0 && nodes.length > 0 && meta) {
-      await startNewRun(meta);
-    }
-  };
+  const saveNodes = async (nodes: RSIPNode[]) => {};
 
   const saveMeta = async (meta: RSIPMeta) => {
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: expected [] to deeply equal [ { id: 'rsip-1', …(5) } ]

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:112:14
 
   const saveNodes = async (nodes: RSIPNode[]) => {
     const previousState = readState();
-    setState((prev) => ({ ...prev, rsipNodes: nodes }));
+    setState(() => undefined);
 
     try {
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: Cannot read properties of undefined (reading 'rsipNodes')

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:114:9
     const previousState = readState();
     setState((prev) => ({ ...prev, rsipNodes: nodes }));
 
-    try {
-      await storage.saveRSIPNodes(nodes);
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'RSIP',
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'rsip-1', …(5) } ] ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:116:21
 
     try {
       await storage.saveRSIPNodes(nodes);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP nodes',
-        { nodeCount: nodes.length },
-        toError(error),
-      );
-    }
+    } catch (error) {}
 
     const previousCount = previousState?.rsipNodes.length ?? 0;
killedBy: useRsipDomain does not throw when persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Number of calls: 0

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:125:27
       );
     }
 
-    const previousCount = previousState?.rsipNodes.length ?? 0;
+    const previousCount = previousState.rsipNodes.length ?? 0;
     const meta = previousState?.rsipMeta;
     if (previousCount === 0 && nodes.length > 0 && meta) {
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: Cannot read properties of null (reading 'rsipNodes')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:125:27
       );
     }
 
-    const previousCount = previousState?.rsipNodes.length ?? 0;
+    const previousCount = previousState?.rsipNodes.length && 0;
     const meta = previousState?.rsipMeta;
     if (previousCount === 0 && nodes.length > 0 && meta) {
killedBy: useRsipDomain does not start a new run when nodes already exist or when the incoming list is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:126:18
     }
 
     const previousCount = previousState?.rsipNodes.length ?? 0;
-    const meta = previousState?.rsipMeta;
+    const meta = previousState.rsipMeta;
     if (previousCount === 0 && nodes.length > 0 && meta) {
       await startNewRun(meta);
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: Cannot read properties of null (reading 'rsipMeta')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:127:9
 
     const previousCount = previousState?.rsipNodes.length ?? 0;
     const meta = previousState?.rsipMeta;
-    if (previousCount === 0 && nodes.length > 0 && meta) {
+    if (previousCount === 0 || nodes.length > 0 && meta) {
       await startNewRun(meta);
     }
killedBy: useRsipDomain does not start a new run when nodes already exist or when the incoming list is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:127:9
 
     const previousCount = previousState?.rsipNodes.length ?? 0;
     const meta = previousState?.rsipMeta;
-    if (previousCount === 0 && nodes.length > 0 && meta) {
+    if (true) {
       await startNewRun(meta);
     }
killedBy: useRsipDomain optimistically updates rsipNodes before persistence resolves
statusReason: Cannot read properties of undefined (reading 'currentRunNumber')

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:132:46
     }
   };
 
-  const saveMeta = async (meta: RSIPMeta) => {
-    setState((prev) => ({ ...prev, rsipMeta: meta }));
-    try {
-      await storage.saveRSIPMeta(meta);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP meta',
-        { meta },
-        toError(error),
-      );
-    }
-  };
+  const saveMeta = async (meta: RSIPMeta) => {};
 
   const saveGroups = async (groups: RSIPNodeGroup[]) => {
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected {} to deeply equal { allowMultiplePerDay: false, …(1) }

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:133:14
   };
 
   const saveMeta = async (meta: RSIPMeta) => {
-    setState((prev) => ({ ...prev, rsipMeta: meta }));
+    setState(() => undefined);
     try {
       await storage.saveRSIPMeta(meta);
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: Cannot read properties of undefined (reading 'rsipMeta')

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:133:25
   };
 
   const saveMeta = async (meta: RSIPMeta) => {
-    setState((prev) => ({ ...prev, rsipMeta: meta }));
+    setState((prev) => ({}));
     try {
       await storage.saveRSIPMeta(meta);
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected undefined to deeply equal { allowMultiplePerDay: false, …(1) }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:134:9
 
   const saveMeta = async (meta: RSIPMeta) => {
     setState((prev) => ({ ...prev, rsipMeta: meta }));
-    try {
-      await storage.saveRSIPMeta(meta);
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'RSIP',
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:136:21
     setState((prev) => ({ ...prev, rsipMeta: meta }));
     try {
       await storage.saveRSIPMeta(meta);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP meta',
-        { meta },
-        toError(error),
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useRsipDomain.ts:139:9
     } catch (error) {
       logger.error(
         'RSIP',
-        'Failed to save RSIP meta',
+        "",
         { meta },
         toError(error),
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:140:9
       logger.error(
         'RSIP',
         'Failed to save RSIP meta',
-        { meta },
+        {},
         toError(error),
       );
killedBy: useRsipDomain should open RSIP view and optimistically persist meta
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:146:57
     }
   };
 
-  const saveGroups = async (groups: RSIPNodeGroup[]) => {
-    setState((prev) => ({ ...prev, rsipGroups: groups }));
-    try {
-      await storage.saveRSIPGroups(groups);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP groups',
-        { count: groups.length },
-        toError(error),
-      );
-    }
-  };
+  const saveGroups = async (groups: RSIPNodeGroup[]) => {};
 
   const savePolicyLibrary = async (entries: RSIPLibraryEntry[]) => {
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected undefined to deeply equal [ { id: 'group-save', …(4) } ]

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:147:14
   };
 
   const saveGroups = async (groups: RSIPNodeGroup[]) => {
-    setState((prev) => ({ ...prev, rsipGroups: groups }));
+    setState(() => undefined);
     try {
       await storage.saveRSIPGroups(groups);
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected undefined to deeply equal [ { id: 'group-save', …(4) } ]

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:147:25
   };
 
   const saveGroups = async (groups: RSIPNodeGroup[]) => {
-    setState((prev) => ({ ...prev, rsipGroups: groups }));
+    setState((prev) => ({}));
     try {
       await storage.saveRSIPGroups(groups);
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected undefined to deeply equal [ { id: 'group-save', …(4) } ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:148:9
 
   const saveGroups = async (groups: RSIPNodeGroup[]) => {
     setState((prev) => ({ ...prev, rsipGroups: groups }));
-    try {
-      await storage.saveRSIPGroups(groups);
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'RSIP',
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:150:21
     setState((prev) => ({ ...prev, rsipGroups: groups }));
     try {
       await storage.saveRSIPGroups(groups);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP groups',
-        { count: groups.length },
-        toError(error),
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:154:9
       logger.error(
         'RSIP',
         'Failed to save RSIP groups',
-        { count: groups.length },
+        {},
         toError(error),
       );
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:160:68
     }
   };
 
-  const savePolicyLibrary = async (entries: RSIPLibraryEntry[]) => {
-    setState((prev) => ({ ...prev, rsipPolicyLibrary: entries }));
-    try {
-      await storage.saveRSIPPolicyLibrary(entries);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP policy library',
-        { count: entries.length },
-        toError(error),
-      );
-    }
-  };
+  const savePolicyLibrary = async (entries: RSIPLibraryEntry[]) => {};
 
   const saveRunHistory = async (records: RSIPRunRecord[]) => {
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:161:14
   };
 
   const savePolicyLibrary = async (entries: RSIPLibraryEntry[]) => {
-    setState((prev) => ({ ...prev, rsipPolicyLibrary: entries }));
+    setState(() => undefined);
     try {
       await storage.saveRSIPPolicyLibrary(entries);
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:162:9
 
   const savePolicyLibrary = async (entries: RSIPLibraryEntry[]) => {
     setState((prev) => ({ ...prev, rsipPolicyLibrary: entries }));
-    try {
-      await storage.saveRSIPPolicyLibrary(entries);
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'RSIP',
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:164:21
     setState((prev) => ({ ...prev, rsipPolicyLibrary: entries }));
     try {
       await storage.saveRSIPPolicyLibrary(entries);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP policy library',
-        { count: entries.length },
-        toError(error),
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] StringLiteral
src/hooks/domains/useRsipDomain.ts:167:9
     } catch (error) {
       logger.error(
         'RSIP',
-        'Failed to save RSIP policy library',
+        "",
         { count: entries.length },
         toError(error),
killedBy: useRsipDomain optimistically saves groups, policy library, and run history while logging persistence failures
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RSIP",

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:174:62
     }
   };
 
-  const saveRunHistory = async (records: RSIPRunRecord[]) => {
-    setState((prev) => ({ ...prev, rsipRunHistory: records }));
-    try {
-      await storage.saveRSIPRunHistory(records);
-    } catch (error) {
-      logger.error(
-        'RSIP',
-        'Failed to save RSIP run history',
-        { count: records.length },
-        toError(error),
-      );
-    }
-  };
+  const saveRunHistory = async (records: RSIPRunRecord[]) => {};
 
   const saveTaskLinks = async (links: RSIPTaskLink[]) => {
killedBy: useRsipDomain records collapse and increments run number
statusReason: expected undefined to match object { Object (runNumber, maxNodeCount, ...) }
