[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:317:17
     if (!state) return null;
 
     const entry = (state.rsipPolicyLibrary ?? []).find(
-      (item) => item.id === entryId,
+      (item) => false,
     );
     if (!entry) return null;
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected null to match object { id: 'restored-node-id', …(10) }

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:317:17
     if (!state) return null;
 
     const entry = (state.rsipPolicyLibrary ?? []).find(
-      (item) => item.id === entryId,
+      (item) => item.id !== entryId,
     );
     if (!entry) return null;
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected { id: 'restored-node-id', …(16) } to be null

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:319:9
     const entry = (state.rsipPolicyLibrary ?? []).find(
       (item) => item.id === entryId,
     );
-    if (!entry) return null;
+    if (false) return null;
 
     const now = new Date();
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:319:9
     const entry = (state.rsipPolicyLibrary ?? []).find(
       (item) => item.id === entryId,
     );
-    if (!entry) return null;
+    if (entry) return null;
 
     const now = new Date();
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: Cannot read properties of undefined (reading 'title')

[Survived] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:327:29
       parentId,
       title: entry.title,
       rule: entry.rule,
-      sortOrder: Math.floor(now.getTime() / 1000),
+      sortOrder: Math.floor(now.getTime() * 1000),
       createdAt: now,
       useTimer: entry.useTimer,

[Killed] StringLiteral
src/hooks/domains/useRsipDomain.ts:335:23
       emoji: entry.emoji,
       isPassive: entry.isPassive,
       cumulativeExecutionDays: entry.cumulativeExecutionDays,
-      stabilityPhase: 'E0',
+      stabilityPhase: "",
       consecutiveExecutions: 0,
       consecutiveViolations: 0,
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected { id: 'restored-node-id', …(16) } to match object { id: 'restored-node-id', …(10) }
(6 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:344:29
 
     await saveNodes([...state.rsipNodes, node]);
 
-    const updatedLibrary = (state.rsipPolicyLibrary ?? []).map((item) =>
+    const updatedLibrary = (state.rsipPolicyLibrary && []).map((item) =>
       item.id === entryId
         ? {
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected undefined to match object { id: 'restore-entry', …(2) }

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:344:64
 
     await saveNodes([...state.rsipNodes, node]);
 
-    const updatedLibrary = (state.rsipPolicyLibrary ?? []).map((item) =>
-      item.id === entryId
-        ? {
-            ...item,
-            lastActiveAt: now,
-            timesUsed: item.timesUsed + 1,
-          }
-        : item,
+    const updatedLibrary = (state.rsipPolicyLibrary ?? []).map(() => undefined,
     );
     await savePolicyLibrary(updatedLibrary);
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected undefined to match object { id: 'restore-entry', …(2) }

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:345:7
     await saveNodes([...state.rsipNodes, node]);
 
     const updatedLibrary = (state.rsipPolicyLibrary ?? []).map((item) =>
-      item.id === entryId
+      false
         ? {
             ...item,
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected { id: 'restore-entry', …(11) } to match object { id: 'restore-entry', …(2) }
(9 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:345:7
     await saveNodes([...state.rsipNodes, node]);
 
     const updatedLibrary = (state.rsipPolicyLibrary ?? []).map((item) =>
-      item.id === entryId
+      item.id !== entryId
         ? {
             ...item,
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected { id: 'restore-entry', …(11) } to match object { id: 'restore-entry', …(2) }
(9 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:349:24
         ? {
             ...item,
             lastActiveAt: now,
-            timesUsed: item.timesUsed + 1,
+            timesUsed: item.timesUsed - 1,
           }
         : item,
killedBy: useRsipDomain restores nodes from library entries and updates usage metadata
statusReason: expected { id: 'restore-entry', …(11) } to match object { id: 'restore-entry', …(2) }
(9 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:366:23
   ): Promise<RSIPMeta> => {
     const state = readState();
     const now = new Date();
-    const runNumber = meta.currentRunNumber ?? 1;
+    const runNumber = meta.currentRunNumber && 1;
     const startedAt = ensureDate(meta.currentRunStartedAt, now);
     const durationDays = Math.max(
killedBy: useRsipDomain records collapse and increments run number
statusReason: expected 2 to be 3 // Object.is equality

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:368:26
     const now = new Date();
     const runNumber = meta.currentRunNumber ?? 1;
     const startedAt = ensureDate(meta.currentRunStartedAt, now);
-    const durationDays = Math.max(
-      1,
-      Math.ceil((now.getTime() - startedAt.getTime()) / DAY_IN_MS),
-    );
+    const durationDays = Math.min(1, Math.ceil((now.getTime() - startedAt.getTime()) / DAY_IN_MS));
 
     const record: RSIPRunRecord = {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:370:18
     const startedAt = ensureDate(meta.currentRunStartedAt, now);
     const durationDays = Math.max(
       1,
-      Math.ceil((now.getTime() - startedAt.getTime()) / DAY_IN_MS),
+      Math.ceil((now.getTime() + startedAt.getTime()) / DAY_IN_MS),
     );
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:370:17
     const startedAt = ensureDate(meta.currentRunStartedAt, now);
     const durationDays = Math.max(
       1,
-      Math.ceil((now.getTime() - startedAt.getTime()) / DAY_IN_MS),
+      Math.ceil((now.getTime() - startedAt.getTime()) * DAY_IN_MS),
     );
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:383:38
       collapseNodeTitle: nodeTitle,
     };
 
-    const nextHistory = [record, ...(state?.rsipRunHistory ?? [])];
+    const nextHistory = [record, ...(state?.rsipRunHistory && [])];
     const nextMeta: RSIPMeta = {
       ...meta,
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:383:38
       collapseNodeTitle: nodeTitle,
     };
 
-    const nextHistory = [record, ...(state?.rsipRunHistory ?? [])];
+    const nextHistory = [record, ...(state.rsipRunHistory ?? [])];
     const nextMeta: RSIPMeta = {
       ...meta,
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of null (reading 'rsipRunHistory')

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:384:32
     };
 
     const nextHistory = [record, ...(state?.rsipRunHistory ?? [])];
-    const nextMeta: RSIPMeta = {
-      ...meta,
-      currentRunNumber: runNumber + 1,
-      currentRunStartedAt: now,
-    };
+    const nextMeta: RSIPMeta = {};
 
     await Promise.all([saveRunHistory(nextHistory), saveMeta(nextMeta)]);
killedBy: useRsipDomain records collapse and increments run number
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:386:25
     const nextHistory = [record, ...(state?.rsipRunHistory ?? [])];
     const nextMeta: RSIPMeta = {
       ...meta,
-      currentRunNumber: runNumber + 1,
+      currentRunNumber: runNumber - 1,
       currentRunStartedAt: now,
     };
killedBy: useRsipDomain records collapse and increments run number
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:394:68
     return nextMeta;
   };
 
-  const startNewRun = async (meta: RSIPMeta): Promise<RSIPMeta> => {
-    if (meta.currentRunNumber && meta.currentRunStartedAt) return meta;
-
-    const nextMeta: RSIPMeta = {
-      ...meta,
-      currentRunNumber: meta.currentRunNumber ?? 1,
-      currentRunStartedAt: meta.currentRunStartedAt ?? new Date(),
-    };
-    await saveMeta(nextMeta);
-    return nextMeta;
-  };
+  const startNewRun = async (meta: RSIPMeta): Promise<RSIPMeta> => {};
 
   const getMode = (meta: RSIPMeta): RSIPMode => {
killedBy: useRsipDomain starts a new run when saving the first node into existing meta state
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:395:9
   };
 
   const startNewRun = async (meta: RSIPMeta): Promise<RSIPMeta> => {
-    if (meta.currentRunNumber && meta.currentRunStartedAt) return meta;
+    if (false) return meta;
 
     const nextMeta: RSIPMeta = {
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:395:9
   };
 
   const startNewRun = async (meta: RSIPMeta): Promise<RSIPMeta> => {
-    if (meta.currentRunNumber && meta.currentRunStartedAt) return meta;
+    if (true) return meta;
 
     const nextMeta: RSIPMeta = {
killedBy: useRsipDomain starts a new run when saving the first node into existing meta state
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:399:25
 
     const nextMeta: RSIPMeta = {
       ...meta,
-      currentRunNumber: meta.currentRunNumber ?? 1,
+      currentRunNumber: meta.currentRunNumber && 1,
       currentRunStartedAt: meta.currentRunStartedAt ?? new Date(),
     };
killedBy: useRsipDomain starts a new run when saving the first node into existing meta state
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:400:28
     const nextMeta: RSIPMeta = {
       ...meta,
       currentRunNumber: meta.currentRunNumber ?? 1,
-      currentRunStartedAt: meta.currentRunStartedAt ?? new Date(),
+      currentRunStartedAt: meta.currentRunStartedAt && new Date(),
     };
     await saveMeta(nextMeta);
killedBy: useRsipDomain starts a new run when saving the first node into existing meta state
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:406:49
     return nextMeta;
   };
 
-  const getMode = (meta: RSIPMeta): RSIPMode => {
-    return meta.allowMultiplePerDay ? 'free' : 'strict';
-  };
+  const getMode = (meta: RSIPMeta): RSIPMode => {};
 
   const isStrictMode = (meta: RSIPMeta): boolean => {
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected undefined to be 'strict' // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:410:53
     return meta.allowMultiplePerDay ? 'free' : 'strict';
   };
 
-  const isStrictMode = (meta: RSIPMeta): boolean => {
-    return !meta.allowMultiplePerDay;
-  };
+  const isStrictMode = (meta: RSIPMeta): boolean => {};
 
   const reinforceNode = async (
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:411:12
   };
 
   const isStrictMode = (meta: RSIPMeta): boolean => {
-    return !meta.allowMultiplePerDay;
+    return meta.allowMultiplePerDay;
   };
 
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:418:29
     nodeId: string,
     nodes: RSIPNode[],
     levelDelta = 1,
-  ): Promise<RSIPNode[]> => {
-    const delta = Math.max(1, Math.floor(levelDelta));
-    const updatedNodes = nodes.map((node) => {
-      if (node.id !== nodeId) return node;
-      if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
-
-      const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
-      return {
-        ...node,
-        reinforcementLevel,
-        maxReinforcementLevel: Math.max(
-          node.maxReinforcementLevel ?? 0,
-          reinforcementLevel,
-        ),
-      };
-    });
-
-    await saveNodes(updatedNodes);
-    return updatedNodes;
-  };
+  ): Promise<RSIPNode[]> => {};
 
   const markExecuted = async (
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:419:19
     nodes: RSIPNode[],
     levelDelta = 1,
   ): Promise<RSIPNode[]> => {
-    const delta = Math.max(1, Math.floor(levelDelta));
+    const delta = Math.min(1, Math.floor(levelDelta));
     const updatedNodes = nodes.map((node) => {
       if (node.id !== nodeId) return node;
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:420:46
     levelDelta = 1,
   ): Promise<RSIPNode[]> => {
     const delta = Math.max(1, Math.floor(levelDelta));
-    const updatedNodes = nodes.map((node) => {
-      if (node.id !== nodeId) return node;
-      if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
-
-      const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
-      return {
-        ...node,
-        reinforcementLevel,
-        maxReinforcementLevel: Math.max(
-          node.maxReinforcementLevel ?? 0,
-          reinforcementLevel,
-        ),
-      };
-    });
+    const updatedNodes = nodes.map((node) => {});
 
     await saveNodes(updatedNodes);
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:421:11
   ): Promise<RSIPNode[]> => {
     const delta = Math.max(1, Math.floor(levelDelta));
     const updatedNodes = nodes.map((node) => {
-      if (node.id !== nodeId) return node;
+      if (node.id === nodeId) return node;
       if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
 
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:421:11
   ): Promise<RSIPNode[]> => {
     const delta = Math.max(1, Math.floor(levelDelta));
     const updatedNodes = nodes.map((node) => {
-      if (node.id !== nodeId) return node;
+      if (true) return node;
       if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
 
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:422:12
     const delta = Math.max(1, Math.floor(levelDelta));
     const updatedNodes = nodes.map((node) => {
       if (node.id !== nodeId) return node;
-      if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
+      if ((node.stabilityPhase && 'E0') !== 'E2') return node;
 
       const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:422:11
     const delta = Math.max(1, Math.floor(levelDelta));
     const updatedNodes = nodes.map((node) => {
       if (node.id !== nodeId) return node;
-      if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
+      if (true) return node;
 
       const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:424:34
       if (node.id !== nodeId) return node;
       if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
 
-      const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
+      const reinforcementLevel = (node.reinforcementLevel ?? 0) - delta;
       return {
         ...node,
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:424:35
       if (node.id !== nodeId) return node;
       if ((node.stabilityPhase ?? 'E0') !== 'E2') return node;
 
-      const reinforcementLevel = (node.reinforcementLevel ?? 0) + delta;
+      const reinforcementLevel = (node.reinforcementLevel && 0) + delta;
       return {
         ...node,
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:428:32
       return {
         ...node,
         reinforcementLevel,
-        maxReinforcementLevel: Math.max(
-          node.maxReinforcementLevel ?? 0,
-          reinforcementLevel,
-        ),
+        maxReinforcementLevel: Math.min(node.maxReinforcementLevel ?? 0, reinforcementLevel),
       };
     });
killedBy: useRsipDomain starts new runs idempotently and reinforces only E2 nodes
statusReason: expected { id: 'reinforce-target', …(8) } to match object { reinforcementLevel: 3, …(1) }
(7 matching properties omitted from actual)

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:429:11
         ...node,
         reinforcementLevel,
         maxReinforcementLevel: Math.max(
-          node.maxReinforcementLevel ?? 0,
+          node.maxReinforcementLevel && 0,
           reinforcementLevel,
         ),

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:447:11
   ): Promise<RSIPNode[]> => {
     const now = new Date();
     const updatedNodes = nodes.map((node) => {
-      if (node.id !== nodeId) return node;
+      if (false) return node;
 
       const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
killedBy: useRsipDomain should update only target node when marking execution
statusReason: expected { id: 'exec-untouched', …(14) } to deeply equal { id: 'exec-untouched', …(8) }

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:449:37
     const updatedNodes = nodes.map((node) => {
       if (node.id !== nodeId) return node;
 
-      const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
+      const consecutiveExecutions = (node.consecutiveExecutions ?? 0) - 1;
       const totalExecutions = (node.totalExecutions ?? 0) + 1;
       const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: expected 5 to be 7 // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:449:38
     const updatedNodes = nodes.map((node) => {
       if (node.id !== nodeId) return node;
 
-      const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
+      const consecutiveExecutions = (node.consecutiveExecutions && 0) + 1;
       const totalExecutions = (node.totalExecutions ?? 0) + 1;
       const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: expected 1 to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:450:31
       if (node.id !== nodeId) return node;
 
       const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
-      const totalExecutions = (node.totalExecutions ?? 0) + 1;
+      const totalExecutions = (node.totalExecutions ?? 0) - 1;
       const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
 
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: expected 3 to be 5 // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:450:32
       if (node.id !== nodeId) return node;
 
       const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
-      const totalExecutions = (node.totalExecutions ?? 0) + 1;
+      const totalExecutions = (node.totalExecutions && 0) + 1;
       const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
 
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: expected 1 to be 5 // Object.is equality

[Survived] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:451:39
 
       const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
       const totalExecutions = (node.totalExecutions ?? 0) + 1;
-      const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
+      const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) - 1;
 
       let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase ?? 'E0';

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:451:40
 
       const consecutiveExecutions = (node.consecutiveExecutions ?? 0) + 1;
       const totalExecutions = (node.totalExecutions ?? 0) + 1;
-      const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
+      const cumulativeExecutionDays = (node.cumulativeExecutionDays && 0) + 1;
 
       let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase ?? 'E0';

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:453:48
       const totalExecutions = (node.totalExecutions ?? 0) + 1;
       const cumulativeExecutionDays = (node.cumulativeExecutionDays ?? 0) + 1;
 
-      let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase ?? 'E0';
+      let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase && 'E0';
       let phaseStartedAt = node.phaseStartedAt;
 
killedBy: useRsipDomain should mark execution and advance phase from E1 to E2
statusReason: expected 'E1' to be 'E2' // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:456:11
       let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase ?? 'E0';
       let phaseStartedAt = node.phaseStartedAt;
 
-      if (stabilityPhase === 'E0' && consecutiveExecutions >= 7) {
+      if (stabilityPhase === 'E0' || consecutiveExecutions >= 7) {
         stabilityPhase = 'E1';
         phaseStartedAt = now;
killedBy: useRsipDomain should not transition stability phase before threshold and should not transition E0 directly to E2
statusReason: expected 'E1' to be 'E0' // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:456:38
       let stabilityPhase: RSIPStabilityPhase = node.stabilityPhase ?? 'E0';
       let phaseStartedAt = node.phaseStartedAt;
 
-      if (stabilityPhase === 'E0' && consecutiveExecutions >= 7) {
+      if (stabilityPhase === 'E0' && consecutiveExecutions < 7) {
         stabilityPhase = 'E1';
         phaseStartedAt = now;
killedBy: useRsipDomain should mark execution and advance phase from E0 to E1
statusReason: expected 'E0' to be 'E1' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:459:18
       if (stabilityPhase === 'E0' && consecutiveExecutions >= 7) {
         stabilityPhase = 'E1';
         phaseStartedAt = now;
-      } else if (stabilityPhase === 'E1' && consecutiveExecutions >= 21) {
+      } else if (false) {
         stabilityPhase = 'E2';
         phaseStartedAt = now;
killedBy: useRsipDomain should mark execution and advance phase from E1 to E2
statusReason: expected 'E1' to be 'E2' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:459:45
       if (stabilityPhase === 'E0' && consecutiveExecutions >= 7) {
         stabilityPhase = 'E1';
         phaseStartedAt = now;
-      } else if (stabilityPhase === 'E1' && consecutiveExecutions >= 21) {
+      } else if (stabilityPhase === 'E1' && true) {
         stabilityPhase = 'E2';
         phaseStartedAt = now;
killedBy: useRsipDomain should not transition stability phase before threshold and should not transition E0 directly to E2
statusReason: expected 'E2' to be 'E1' // Object.is equality

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:464:32
         phaseStartedAt = now;
       }
 
-      let reinforcementLevel = node.reinforcementLevel ?? 0;
+      let reinforcementLevel = node.reinforcementLevel && 0;
       let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
       if (stabilityPhase === 'E2' && options?.reinforce) {
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected { id: 'reinforced-e2', …(14) } to match object { reinforcementLevel: 2, …(2) }
(12 matching properties omitted from actual)

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:465:35
       }
 
       let reinforcementLevel = node.reinforcementLevel ?? 0;
-      let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
+      let maxReinforcementLevel = node.maxReinforcementLevel && 0;
       if (stabilityPhase === 'E2' && options?.reinforce) {
         reinforcementLevel += 1;

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:466:38
 
       let reinforcementLevel = node.reinforcementLevel ?? 0;
       let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
-      if (stabilityPhase === 'E2' && options?.reinforce) {
+      if (stabilityPhase === 'E2' && options.reinforce) {
         reinforcementLevel += 1;
         maxReinforcementLevel = Math.max(
killedBy: useRsipDomain should mark execution and advance phase from E1 to E2
statusReason: Cannot read properties of undefined (reading 'reinforce')

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:466:58
 
       let reinforcementLevel = node.reinforcementLevel ?? 0;
       let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
-      if (stabilityPhase === 'E2' && options?.reinforce) {
-        reinforcementLevel += 1;
-        maxReinforcementLevel = Math.max(
-          maxReinforcementLevel,
-          reinforcementLevel,
-        );
-      }
+      if (stabilityPhase === 'E2' && options?.reinforce) {}
 
       return {
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected { id: 'reinforced-e2', …(14) } to match object { reinforcementLevel: 2, …(2) }
(12 matching properties omitted from actual)

[Killed] AssignmentOperator
src/hooks/domains/useRsipDomain.ts:467:9
       let reinforcementLevel = node.reinforcementLevel ?? 0;
       let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
       if (stabilityPhase === 'E2' && options?.reinforce) {
-        reinforcementLevel += 1;
+        reinforcementLevel -= 1;
         maxReinforcementLevel = Math.max(
           maxReinforcementLevel,
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected { id: 'reinforced-e2', …(14) } to match object { reinforcementLevel: 2, …(2) }
(12 matching properties omitted from actual)
