[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:468:33
       let maxReinforcementLevel = node.maxReinforcementLevel ?? 0;
       if (stabilityPhase === 'E2' && options?.reinforce) {
         reinforcementLevel += 1;
-        maxReinforcementLevel = Math.max(
-          maxReinforcementLevel,
-          reinforcementLevel,
-        );
+        maxReinforcementLevel = Math.min(maxReinforcementLevel, reinforcementLevel);
       }
 
killedBy: useRsipDomain reinforces E2 executions, appends records beside existing state, and logs append failures
statusReason: expected { id: 'reinforced-e2', …(14) } to match object { reinforcementLevel: 2, …(2) }
(12 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:503:45
   ): Promise<RSIPNode[]> => {
     const state = readState();
     const now = new Date();
-    const targetNode = nodes.find((node) => node.id === nodeId);
+    const targetNode = nodes.find((node) => node.id !== nodeId);
     if (!targetNode) return nodes;
 
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:503:35
   ): Promise<RSIPNode[]> => {
     const state = readState();
     const now = new Date();
-    const targetNode = nodes.find((node) => node.id === nodeId);
+    const targetNode = nodes.find(() => undefined);
     if (!targetNode) return nodes;
 
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(3) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:504:9
     const state = readState();
     const now = new Date();
     const targetNode = nodes.find((node) => node.id === nodeId);
-    if (!targetNode) return nodes;
+    if (true) return nodes;
 
     // 1) Reinforcement shield first.
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(3) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:504:9
     const state = readState();
     const now = new Date();
     const targetNode = nodes.find((node) => node.id === nodeId);
-    if (!targetNode) return nodes;
+    if (targetNode) return nodes;
 
     // 1) Reinforcement shield first.
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(3) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:507:34
     if (!targetNode) return nodes;
 
     // 1) Reinforcement shield first.
-    const currentReinforcement = targetNode.reinforcementLevel ?? 0;
+    const currentReinforcement = targetNode.reinforcementLevel && 0;
     if (currentReinforcement > 0) {
       const updatedNodes = nodes.map((node) => {
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:508:35
 
     // 1) Reinforcement shield first.
     const currentReinforcement = targetNode.reinforcementLevel ?? 0;
-    if (currentReinforcement > 0) {
-      const updatedNodes = nodes.map((node) => {
-        if (node.id !== nodeId) return node;
-        return {
-          ...node,
-          reinforcementLevel: Math.max(0, currentReinforcement - 1),
-          lastViolatedAt: now,
-          consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
-          totalViolations: (node.totalViolations ?? 0) + 1,
-          consecutiveExecutions: 0,
-        };
-      });
-
-      await saveNodes(updatedNodes);
-      await appendExecutionRecord(
-        buildExecutionRecord(nodeId, 'violated', notes, options),
-      );
-      return updatedNodes;
-    }
+    if (currentReinforcement > 0) {}
 
     const groups = state?.rsipGroups ?? [];
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:508:9
 
     // 1) Reinforcement shield first.
     const currentReinforcement = targetNode.reinforcementLevel ?? 0;
-    if (currentReinforcement > 0) {
+    if (false) {
       const updatedNodes = nodes.map((node) => {
         if (node.id !== nodeId) return node;
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:509:48
     // 1) Reinforcement shield first.
     const currentReinforcement = targetNode.reinforcementLevel ?? 0;
     if (currentReinforcement > 0) {
-      const updatedNodes = nodes.map((node) => {
-        if (node.id !== nodeId) return node;
-        return {
-          ...node,
-          reinforcementLevel: Math.max(0, currentReinforcement - 1),
-          lastViolatedAt: now,
-          consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
-          totalViolations: (node.totalViolations ?? 0) + 1,
-          consecutiveExecutions: 0,
-        };
-      });
+      const updatedNodes = nodes.map((node) => {});
 
       await saveNodes(updatedNodes);
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: Cannot read properties of undefined (reading 'reinforcementLevel')

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:511:16
     if (currentReinforcement > 0) {
       const updatedNodes = nodes.map((node) => {
         if (node.id !== nodeId) return node;
-        return {
-          ...node,
-          reinforcementLevel: Math.max(0, currentReinforcement - 1),
-          lastViolatedAt: now,
-          consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
-          totalViolations: (node.totalViolations ?? 0) + 1,
-          consecutiveExecutions: 0,
-        };
+        return {};
       });
 
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:513:31
         if (node.id !== nodeId) return node;
         return {
           ...node,
-          reinforcementLevel: Math.max(0, currentReinforcement - 1),
+          reinforcementLevel: Math.min(0, currentReinforcement - 1),
           lastViolatedAt: now,
           consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:513:43
         if (node.id !== nodeId) return node;
         return {
           ...node,
-          reinforcementLevel: Math.max(0, currentReinforcement - 1),
+          reinforcementLevel: Math.max(0, currentReinforcement + 1),
           lastViolatedAt: now,
           consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected 3 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:515:34
           ...node,
           reinforcementLevel: Math.max(0, currentReinforcement - 1),
           lastViolatedAt: now,
-          consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
+          consecutiveViolations: (node.consecutiveViolations ?? 0) - 1,
           totalViolations: (node.totalViolations ?? 0) + 1,
           consecutiveExecutions: 0,

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:515:35
           ...node,
           reinforcementLevel: Math.max(0, currentReinforcement - 1),
           lastViolatedAt: now,
-          consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
+          consecutiveViolations: (node.consecutiveViolations && 0) + 1,
           totalViolations: (node.totalViolations ?? 0) + 1,
           consecutiveExecutions: 0,

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:516:28
           reinforcementLevel: Math.max(0, currentReinforcement - 1),
           lastViolatedAt: now,
           consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
-          totalViolations: (node.totalViolations ?? 0) + 1,
+          totalViolations: (node.totalViolations ?? 0) - 1,
           consecutiveExecutions: 0,
         };
killedBy: useRsipDomain consumes reinforcement on violation before deleting node
statusReason: expected -1 to be 1 // Object.is equality

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:516:29
           reinforcementLevel: Math.max(0, currentReinforcement - 1),
           lastViolatedAt: now,
           consecutiveViolations: (node.consecutiveViolations ?? 0) + 1,
-          totalViolations: (node.totalViolations ?? 0) + 1,
+          totalViolations: (node.totalViolations && 0) + 1,
           consecutiveExecutions: 0,
         };

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:528:20
       return updatedNodes;
     }
 
-    const groups = state?.rsipGroups ?? [];
+    const groups = state?.rsipGroups && [];
     const group = targetNode.groupId
       ? groups.find((item) => item.id === targetNode.groupId)
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:528:20
       return updatedNodes;
     }
 
-    const groups = state?.rsipGroups ?? [];
+    const groups = state.rsipGroups ?? [];
     const group = targetNode.groupId
       ? groups.find((item) => item.id === targetNode.groupId)
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of null (reading 'rsipGroups')

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:530:21
 
     const groups = state?.rsipGroups ?? [];
     const group = targetNode.groupId
-      ? groups.find((item) => item.id === targetNode.groupId)
+      ? groups.find(() => undefined)
       : undefined;
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:530:31
 
     const groups = state?.rsipGroups ?? [];
     const group = targetNode.groupId
-      ? groups.find((item) => item.id === targetNode.groupId)
+      ? groups.find((item) => item.id !== targetNode.groupId)
       : undefined;
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:534:44
       : undefined;
 
     const removedIds = new Set<string>();
-    const addSubtree = (rootId: string) => {
-      removedIds.add(rootId);
-      for (const descendantId of getDescendantIds(nodes, rootId)) {
-        removedIds.add(descendantId);
-      }
-    };
+    const addSubtree = (rootId: string) => {};
 
     let triggeredGroupCollapse = false;
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(3) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:536:67
     const removedIds = new Set<string>();
     const addSubtree = (rootId: string) => {
       removedIds.add(rootId);
-      for (const descendantId of getDescendantIds(nodes, rootId)) {
-        removedIds.add(descendantId);
-      }
+      for (const descendantId of getDescendantIds(nodes, rootId)) {}
     };
 
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'child', …(5) }, …(2) ] to deeply equal [ { id: 'keep', …(5) } ]

[Survived] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:541:34
       }
     };
 
-    let triggeredGroupCollapse = false;
+    let triggeredGroupCollapse = true;
     if (group) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:542:9
     };
 
     let triggeredGroupCollapse = false;
-    if (group) {
+    if (true) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);
       const survivorsAfterLoss = groupNodes.length - 1;
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:542:9
     };
 
     let triggeredGroupCollapse = false;
-    if (group) {
+    if (false) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);
       const survivorsAfterLoss = groupNodes.length - 1;
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:543:49
 
     let triggeredGroupCollapse = false;
     if (group) {
-      const groupNodes = nodes.filter((node) => node.groupId === group.id);
+      const groupNodes = nodes.filter((node) => false);
       const survivorsAfterLoss = groupNodes.length - 1;
       const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [ Array(3) ] to deeply equal [ 'group-node-b', 'independent-node' ]

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:543:49
 
     let triggeredGroupCollapse = false;
     if (group) {
-      const groupNodes = nodes.filter((node) => node.groupId === group.id);
+      const groupNodes = nodes.filter((node) => node.groupId !== group.id);
       const survivorsAfterLoss = groupNodes.length - 1;
       const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(2) ] to deeply equal [ Array(1) ]

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:544:34
     let triggeredGroupCollapse = false;
     if (group) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);
-      const survivorsAfterLoss = groupNodes.length - 1;
+      const survivorsAfterLoss = groupNodes.length + 1;
       const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:545:24
     if (group) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);
       const survivorsAfterLoss = groupNodes.length - 1;
-      const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
+      const minAlive = Math.min(0, groupNodes.length - group.faultTolerance);
 
       // 2) Group fault tolerance check before normal cascade.
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:545:36
     if (group) {
       const groupNodes = nodes.filter((node) => node.groupId === group.id);
       const survivorsAfterLoss = groupNodes.length - 1;
-      const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
+      const minAlive = Math.max(0, groupNodes.length + group.faultTolerance);
 
       // 2) Group fault tolerance check before normal cascade.
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [ 'independent-node' ] to deeply equal [ 'group-node-b', 'independent-node' ]

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:548:11
       const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
 
       // 2) Group fault tolerance check before normal cascade.
-      if (survivorsAfterLoss >= minAlive) {
+      if (survivorsAfterLoss > minAlive) {
         addSubtree(nodeId);
       } else {
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [ 'independent-node' ] to deeply equal [ 'group-node-b', 'independent-node' ]

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:548:11
       const minAlive = Math.max(0, groupNodes.length - group.faultTolerance);
 
       // 2) Group fault tolerance check before normal cascade.
-      if (survivorsAfterLoss >= minAlive) {
+      if (false) {
         addSubtree(nodeId);
       } else {
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [ 'independent-node' ] to deeply equal [ 'group-node-b', 'independent-node' ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:550:14
       // 2) Group fault tolerance check before normal cascade.
       if (survivorsAfterLoss >= minAlive) {
         addSubtree(nodeId);
-      } else {
-        triggeredGroupCollapse = true;
-        for (const groupNode of groupNodes) {
-          addSubtree(groupNode.id);
-        }
-      }
+      } else {}
     } else {
       // 3) Normal recursive rollback.
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(3) ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:551:34
       if (survivorsAfterLoss >= minAlive) {
         addSubtree(nodeId);
       } else {
-        triggeredGroupCollapse = true;
+        triggeredGroupCollapse = false;
         for (const groupNode of groupNodes) {
           addSubtree(groupNode.id);
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected undefined to match object { runNumber: 4, maxNodeCount: 3, …(3) }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:552:45
         addSubtree(nodeId);
       } else {
         triggeredGroupCollapse = true;
-        for (const groupNode of groupNodes) {
-          addSubtree(groupNode.id);
-        }
+        for (const groupNode of groupNodes) {}
       }
     } else {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(3) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:556:12
           addSubtree(groupNode.id);
         }
       }
-    } else {
-      // 3) Normal recursive rollback.
-      addSubtree(nodeId);
-    }
+    } else {}
 
     const removedNodes = nodes.filter((node) => removedIds.has(node.id));
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(3) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:561:26
       addSubtree(nodeId);
     }
 
-    const removedNodes = nodes.filter((node) => removedIds.has(node.id));
+    const removedNodes = nodes;
     const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
 
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [ { id: 'group-node-a', …(11) }, …(2) ] to have a length of 1 but got 3

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:561:39
       addSubtree(nodeId);
     }
 
-    const removedNodes = nodes.filter((node) => removedIds.has(node.id));
+    const removedNodes = nodes.filter(() => undefined);
     const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
 
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:562:49
     }
 
     const removedNodes = nodes.filter((node) => removedIds.has(node.id));
-    const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
+    const updatedNodes = nodes.filter((node) => removedIds.has(node.id));
 
     // Archive removed nodes into policy library.
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [ { id: 'root', …(5) }, …(2) ] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:562:39
     }
 
     const removedNodes = nodes.filter((node) => removedIds.has(node.id));
-    const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
+    const updatedNodes = nodes.filter(() => undefined);
 
     // Archive removed nodes into policy library.
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: expected [] to deeply equal [ { id: 'keep', …(5) } ]

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:565:26
     const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
 
     // Archive removed nodes into policy library.
-    let updatedLibrary = state?.rsipPolicyLibrary ?? [];
+    let updatedLibrary = state.rsipPolicyLibrary ?? [];
     for (const removedNode of removedNodes) {
       updatedLibrary = await archiveToLibrary(removedNode, updatedLibrary);
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of null (reading 'rsipPolicyLibrary')

[Survived] LogicalOperator
src/hooks/domains/useRsipDomain.ts:565:26
     const updatedNodes = nodes.filter((node) => !removedIds.has(node.id));
 
     // Archive removed nodes into policy library.
-    let updatedLibrary = state?.rsipPolicyLibrary ?? [];
+    let updatedLibrary = state?.rsipPolicyLibrary && [];
     for (const removedNode of removedNodes) {
       updatedLibrary = await archiveToLibrary(removedNode, updatedLibrary);

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:566:45
 
     // Archive removed nodes into policy library.
     let updatedLibrary = state?.rsipPolicyLibrary ?? [];
-    for (const removedNode of removedNodes) {
-      updatedLibrary = await archiveToLibrary(removedNode, updatedLibrary);
-    }
+    for (const removedNode of removedNodes) {}
 
     await saveNodes(updatedNodes);
killedBy: useRsipDomain respects group fault tolerance on violation
statusReason: expected [] to have a length of 1 but got +0

[Survived] EqualityOperator
src/hooks/domains/useRsipDomain.ts:575:31
       buildExecutionRecord(nodeId, 'violated', notes, options),
     );
 
-    const collapsedRootNode = targetNode.parentId == null;
+    const collapsedRootNode = targetNode.parentId != null;
     const shouldRecordCollapse =
       triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;

[Survived] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:575:31
       buildExecutionRecord(nodeId, 'violated', notes, options),
     );
 
-    const collapsedRootNode = targetNode.parentId == null;
+    const collapsedRootNode = false;
     const shouldRecordCollapse =
       triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:577:7
 
     const collapsedRootNode = targetNode.parentId == null;
     const shouldRecordCollapse =
-      triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;
+      (triggeredGroupCollapse || collapsedRootNode) && updatedNodes.length === 0;
 
     if (shouldRecordCollapse) {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected undefined to match object { runNumber: 4, maxNodeCount: 3, …(3) }

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:577:7
 
     const collapsedRootNode = targetNode.parentId == null;
     const shouldRecordCollapse =
-      triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;
+      triggeredGroupCollapse && collapsedRootNode || updatedNodes.length === 0;
 
     if (shouldRecordCollapse) {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected undefined to match object { runNumber: 4, maxNodeCount: 3, …(3) }

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:579:9
     const shouldRecordCollapse =
       triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;
 
-    if (shouldRecordCollapse) {
+    if (false) {
       await recordCollapse(
         state?.rsipMeta ?? {},
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected undefined to match object { runNumber: 4, maxNodeCount: 3, …(3) }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:579:31
     const shouldRecordCollapse =
       triggeredGroupCollapse || collapsedRootNode || updatedNodes.length === 0;
 
-    if (shouldRecordCollapse) {
-      await recordCollapse(
-        state?.rsipMeta ?? {},
-        options?.collapseReason ?? options?.reasonCode ?? notes,
-        targetNode.title,
-        nodes.length,
-      );
-    }
+    if (shouldRecordCollapse) {}
 
     return updatedNodes;
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected undefined to match object { runNumber: 4, maxNodeCount: 3, …(3) }

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:581:9
 
     if (shouldRecordCollapse) {
       await recordCollapse(
-        state?.rsipMeta ?? {},
+        state.rsipMeta ?? {},
         options?.collapseReason ?? options?.reasonCode ?? notes,
         targetNode.title,
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of null (reading 'rsipMeta')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:581:9
 
     if (shouldRecordCollapse) {
       await recordCollapse(
-        state?.rsipMeta ?? {},
+        state?.rsipMeta && {},
         options?.collapseReason ?? options?.reasonCode ?? notes,
         targetNode.title,
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of undefined (reading 'currentRunNumber')

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:582:9
     if (shouldRecordCollapse) {
       await recordCollapse(
         state?.rsipMeta ?? {},
-        options?.collapseReason ?? options?.reasonCode ?? notes,
+        options.collapseReason ?? options?.reasonCode ?? notes,
         targetNode.title,
         nodes.length,
killedBy: useRsipDomain should delete violated node with all descendants
statusReason: Cannot read properties of undefined (reading 'collapseReason')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:582:9
     if (shouldRecordCollapse) {
       await recordCollapse(
         state?.rsipMeta ?? {},
-        options?.collapseReason ?? options?.reasonCode ?? notes,
+        options?.collapseReason && options?.reasonCode ?? notes,
         targetNode.title,
         nodes.length,
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { runNumber: 4, …(6) } to match object { runNumber: 4, maxNodeCount: 3, …(3) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:591:73
     return updatedNodes;
   };
 
-  const recordTreeOpened = async (meta: RSIPMeta): Promise<RSIPMeta> => {
-    const now = new Date();
-    const today = now.toDateString();
-    const lastOpened = meta.lastTreeOpenedAt?.toDateString();
-
-    let treeOpenStreak = meta.treeOpenStreak ?? 0;
-    if (lastOpened !== today) {
-      const yesterday = new Date(now);
-      yesterday.setDate(yesterday.getDate() - 1);
-      treeOpenStreak =
-        lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
-    }
-
-    const updatedMeta: RSIPMeta = {
-      ...meta,
-      lastTreeOpenedAt: now,
-      treeOpenStreak,
-    };
-
-    await saveMeta(updatedMeta);
-    return updatedMeta;
-  };
+  const recordTreeOpened = async (meta: RSIPMeta): Promise<RSIPMeta> => {};
 
   const hasOpenedToday = (meta: RSIPMeta): boolean => {
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: Cannot read properties of undefined (reading 'treeOpenStreak')

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:594:24
   const recordTreeOpened = async (meta: RSIPMeta): Promise<RSIPMeta> => {
     const now = new Date();
     const today = now.toDateString();
-    const lastOpened = meta.lastTreeOpenedAt?.toDateString();
+    const lastOpened = meta.lastTreeOpenedAt.toDateString();
 
     let treeOpenStreak = meta.treeOpenStreak ?? 0;
killedBy: useRsipDomain should initialize streak when no last open date and keep streak when reopened on same day
statusReason: Cannot read properties of undefined (reading 'toDateString')

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:596:26
     const today = now.toDateString();
     const lastOpened = meta.lastTreeOpenedAt?.toDateString();
 
-    let treeOpenStreak = meta.treeOpenStreak ?? 0;
+    let treeOpenStreak = meta.treeOpenStreak && 0;
     if (lastOpened !== today) {
       const yesterday = new Date(now);
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 1 to be 4 // Object.is equality
