[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:597:9
     const lastOpened = meta.lastTreeOpenedAt?.toDateString();
 
     let treeOpenStreak = meta.treeOpenStreak ?? 0;
-    if (lastOpened !== today) {
+    if (lastOpened === today) {
       const yesterday = new Date(now);
       yesterday.setDate(yesterday.getDate() - 1);
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 3 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:597:9
     const lastOpened = meta.lastTreeOpenedAt?.toDateString();
 
     let treeOpenStreak = meta.treeOpenStreak ?? 0;
-    if (lastOpened !== today) {
+    if (true) {
       const yesterday = new Date(now);
       yesterday.setDate(yesterday.getDate() - 1);
killedBy: useRsipDomain should initialize streak when no last open date and keep streak when reopened on same day
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:599:25
     let treeOpenStreak = meta.treeOpenStreak ?? 0;
     if (lastOpened !== today) {
       const yesterday = new Date(now);
-      yesterday.setDate(yesterday.getDate() - 1);
+      yesterday.setDate(yesterday.getDate() + 1);
       treeOpenStreak =
         lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 1 to be 4 // Object.is equality

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:599:7
     let treeOpenStreak = meta.treeOpenStreak ?? 0;
     if (lastOpened !== today) {
       const yesterday = new Date(now);
-      yesterday.setDate(yesterday.getDate() - 1);
+      yesterday.setTime(yesterday.getDate() - 1);
       treeOpenStreak =
         lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:601:51
       const yesterday = new Date(now);
       yesterday.setDate(yesterday.getDate() - 1);
       treeOpenStreak =
-        lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
+        lastOpened === yesterday.toDateString() ? treeOpenStreak - 1 : 1;
     }
 
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:601:9
       const yesterday = new Date(now);
       yesterday.setDate(yesterday.getDate() - 1);
       treeOpenStreak =
-        lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
+        false ? treeOpenStreak + 1 : 1;
     }
 
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:604:35
         lastOpened === yesterday.toDateString() ? treeOpenStreak + 1 : 1;
     }
 
-    const updatedMeta: RSIPMeta = {
-      ...meta,
-      lastTreeOpenedAt: now,
-      treeOpenStreak,
-    };
+    const updatedMeta: RSIPMeta = {};
 
     await saveMeta(updatedMeta);
killedBy: useRsipDomain should record tree opened streak with increment and reset behavior
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:614:55
     return updatedMeta;
   };
 
-  const hasOpenedToday = (meta: RSIPMeta): boolean => {
-    if (!meta.lastTreeOpenedAt) return false;
-    return meta.lastTreeOpenedAt.toDateString() === new Date().toDateString();
-  };
+  const hasOpenedToday = (meta: RSIPMeta): boolean => {};
 
   const calculateConstraintPower = (
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:615:9
   };
 
   const hasOpenedToday = (meta: RSIPMeta): boolean => {
-    if (!meta.lastTreeOpenedAt) return false;
+    if (true) return false;
     return meta.lastTreeOpenedAt.toDateString() === new Date().toDateString();
   };
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:615:9
   };
 
   const hasOpenedToday = (meta: RSIPMeta): boolean => {
-    if (!meta.lastTreeOpenedAt) return false;
+    if (meta.lastTreeOpenedAt) return false;
     return meta.lastTreeOpenedAt.toDateString() === new Date().toDateString();
   };
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: Cannot read properties of undefined (reading 'toDateString')

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:616:12
 
   const hasOpenedToday = (meta: RSIPMeta): boolean => {
     if (!meta.lastTreeOpenedAt) return false;
-    return meta.lastTreeOpenedAt.toDateString() === new Date().toDateString();
+    return false;
   };
 
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:616:12
 
   const hasOpenedToday = (meta: RSIPMeta): boolean => {
     if (!meta.lastTreeOpenedAt) return false;
-    return meta.lastTreeOpenedAt.toDateString() === new Date().toDateString();
+    return meta.lastTreeOpenedAt.toDateString() !== new Date().toDateString();
   };
 
killedBy: useRsipDomain should provide strict/free mode helpers and opened-today check
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:622:58
   const calculateConstraintPower = (
     nodeId: string,
     nodes: RSIPNode[],
-  ): { descendantCount: number; failureCost: number } => {
-    const node = nodes.find((item) => item.id === nodeId);
-    if (!node) return { descendantCount: 0, failureCost: 0 };
-
-    const descendantCount = getDescendantCount(nodes, nodeId);
-
-    const phaseWeight: Record<RSIPStabilityPhase, number> = {
-      E0: 1,
-      E1: 2,
-      E2: 3,
-    };
-    const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
-    const reinforcementMultiplier =
-      (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
-    const failureCost =
-      Math.round(
-        (descendantCount + 1) * weight * reinforcementMultiplier * 100,
-      ) / 100;
-
-    return { descendantCount, failureCost };
-  };
+  ): { descendantCount: number; failureCost: number } => {};
 
   const calculatePhaseDistribution = (
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected undefined to deeply equal { Object (descendantCount, failureCost) }

[Killed] ArrowFunction
src/hooks/domains/useRsipDomain.ts:623:29
     nodeId: string,
     nodes: RSIPNode[],
   ): { descendantCount: number; failureCost: number } => {
-    const node = nodes.find((item) => item.id === nodeId);
+    const node = nodes.find(() => undefined);
     if (!node) return { descendantCount: 0, failureCost: 0 };
 
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:623:39
     nodeId: string,
     nodes: RSIPNode[],
   ): { descendantCount: number; failureCost: number } => {
-    const node = nodes.find((item) => item.id === nodeId);
+    const node = nodes.find((item) => false);
     if (!node) return { descendantCount: 0, failureCost: 0 };
 
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:624:9
     nodes: RSIPNode[],
   ): { descendantCount: number; failureCost: number } => {
     const node = nodes.find((item) => item.id === nodeId);
-    if (!node) return { descendantCount: 0, failureCost: 0 };
+    if (true) return { descendantCount: 0, failureCost: 0 };
 
     const descendantCount = getDescendantCount(nodes, nodeId);
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:624:9
     nodes: RSIPNode[],
   ): { descendantCount: number; failureCost: number } => {
     const node = nodes.find((item) => item.id === nodeId);
-    if (!node) return { descendantCount: 0, failureCost: 0 };
+    if (node) return { descendantCount: 0, failureCost: 0 };
 
     const descendantCount = getDescendantCount(nodes, nodeId);
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: Cannot read properties of undefined (reading 'stabilityPhase')

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:628:61
 
     const descendantCount = getDescendantCount(nodes, nodeId);
 
-    const phaseWeight: Record<RSIPStabilityPhase, number> = {
-      E0: 1,
-      E1: 2,
-      E2: 3,
-    };
+    const phaseWeight: Record<RSIPStabilityPhase, number> = {};
     const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
     const reinforcementMultiplier =
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:633:32
       E1: 2,
       E2: 3,
     };
-    const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
+    const weight = phaseWeight[node.stabilityPhase && 'E0'];
     const reinforcementMultiplier =
       (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { descendantCount: 3, failureCost: 4 } to deeply equal { descendantCount: 3, failureCost: 12 }

[NoCoverage] StringLiteral
src/hooks/domains/useRsipDomain.ts:633:55
       E1: 2,
       E2: 3,
     };
-    const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
+    const weight = phaseWeight[node.stabilityPhase ?? ""];
     const reinforcementMultiplier =
       (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:635:7
     };
     const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
     const reinforcementMultiplier =
-      (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
+      (node.reinforcementLevel ?? 0) >= 0 ? 0.3 : 1;
     const failureCost =
       Math.round(
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:635:7
     };
     const weight = phaseWeight[node.stabilityPhase ?? 'E0'];
     const reinforcementMultiplier =
-      (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
+      true ? 0.3 : 1;
     const failureCost =
       Math.round(
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { Object (descendantCount, failureCost) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:637:7
     const reinforcementMultiplier =
       (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
     const failureCost =
-      Math.round(
-        (descendantCount + 1) * weight * reinforcementMultiplier * 100,
-      ) / 100;
+      Math.round((descendantCount + 1) * weight * reinforcementMultiplier * 100) * 100;
 
     return { descendantCount, failureCost };
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { descendantCount: 3, …(1) } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:638:10
       (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
     const failureCost =
       Math.round(
-        (descendantCount + 1) * weight * reinforcementMultiplier * 100,
+        (descendantCount - 1) * weight * reinforcementMultiplier * 100,
       ) / 100;
 
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { descendantCount: 3, failureCost: 6 } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] ArithmeticOperator
src/hooks/domains/useRsipDomain.ts:638:9
       (node.reinforcementLevel ?? 0) > 0 ? 0.3 : 1;
     const failureCost =
       Math.round(
-        (descendantCount + 1) * weight * reinforcementMultiplier * 100,
+        (descendantCount + 1) * weight * reinforcementMultiplier / 100,
       ) / 100;
 
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { descendantCount: 3, failureCost: +0 } to deeply equal { descendantCount: 3, failureCost: 12 }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:646:48
 
   const calculatePhaseDistribution = (
     nodes: RSIPNode[],
-  ): { E0: number; E1: number; E2: number } => {
-    const distribution = { E0: 0, E1: 0, E2: 0 };
-    for (const node of nodes) {
-      const phase = node.stabilityPhase ?? 'E0';
-      distribution[phase]++;
-    }
-    return distribution;
-  };
+  ): { E0: number; E1: number; E2: number } => {};
 
   const upsertTaskLinks = async (links: RSIPTaskLink[]) => {
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected undefined to deeply equal { E0: 2, E1: 1, E2: 1 }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:648:31
     nodes: RSIPNode[],
   ): { E0: number; E1: number; E2: number } => {
     const distribution = { E0: 0, E1: 0, E2: 0 };
-    for (const node of nodes) {
-      const phase = node.stabilityPhase ?? 'E0';
-      distribution[phase]++;
-    }
+    for (const node of nodes) {}
     return distribution;
   };
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { E0: +0, E1: +0, E2: +0 } to deeply equal { E0: 2, E1: 1, E2: 1 }

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:649:21
   ): { E0: number; E1: number; E2: number } => {
     const distribution = { E0: 0, E1: 0, E2: 0 };
     for (const node of nodes) {
-      const phase = node.stabilityPhase ?? 'E0';
+      const phase = node.stabilityPhase && 'E0';
       distribution[phase]++;
     }
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { E0: 3, E1: +0, E2: +0, …(1) } to deeply equal { E0: 2, E1: 1, E2: 1 }

[Killed] UpdateOperator
src/hooks/domains/useRsipDomain.ts:650:7
     const distribution = { E0: 0, E1: 0, E2: 0 };
     for (const node of nodes) {
       const phase = node.stabilityPhase ?? 'E0';
-      distribution[phase]++;
+      distribution[phase]--;
     }
     return distribution;
killedBy: useRsipDomain should calculate constraint power and phase distribution
statusReason: expected { E0: -2, E1: -1, E2: -1 } to deeply equal { E0: 2, E1: 1, E2: 1 }

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:655:60
     return distribution;
   };
 
-  const upsertTaskLinks = async (links: RSIPTaskLink[]) => {
-    const state = readState();
-    const merged = rsipTaskIntegrationService.upsertLinks(
-      state?.rsipTaskLinks ?? [],
-      links,
-    );
-    await saveTaskLinks(merged);
-    return merged;
-  };
+  const upsertTaskLinks = async (links: RSIPTaskLink[]) => {};
 
   const handleTaskEventIntegration = async (
killedBy: useRsipDomain upserts task links and returns RSIP task actions for rsip_mark_executed prompts
statusReason: expected undefined to deeply equal ArrayContaining{…}

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:658:7
   const upsertTaskLinks = async (links: RSIPTaskLink[]) => {
     const state = readState();
     const merged = rsipTaskIntegrationService.upsertLinks(
-      state?.rsipTaskLinks ?? [],
+      state?.rsipTaskLinks && [],
       links,
     );
killedBy: useRsipDomain returns empty task-link integrations when state is unavailable
statusReason: promise rejected "TypeError: existingLinks is not iterable" instead of resolving

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:658:7
   const upsertTaskLinks = async (links: RSIPTaskLink[]) => {
     const state = readState();
     const merged = rsipTaskIntegrationService.upsertLinks(
-      state?.rsipTaskLinks ?? [],
+      state.rsipTaskLinks ?? [],
       links,
     );
killedBy: useRsipDomain returns empty task-link integrations when state is unavailable
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:669:9
     payload: RSIPTaskEventPayload,
   ): Promise<RSIPNode[]> => {
     const state = readState();
-    if (!state) return [];
+    if (false) return [];
 
     const matches = rsipTaskIntegrationService.matchTaskEventLinks(
killedBy: useRsipDomain returns empty task-link integrations when state is unavailable
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:669:9
     payload: RSIPTaskEventPayload,
   ): Promise<RSIPNode[]> => {
     const state = readState();
-    if (!state) return [];
+    if (true) return [];
 
     const matches = rsipTaskIntegrationService.matchTaskEventLinks(
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected undefined to match object { stabilityPhase: 'E1', …(2) }

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:672:7
     if (!state) return [];
 
     const matches = rsipTaskIntegrationService.matchTaskEventLinks(
-      state.rsipTaskLinks ?? [],
+      state.rsipTaskLinks && [],
       payload,
     );
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected { id: 'integration-node', …(8) } to match object { stabilityPhase: 'E1', …(2) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:678:11
 
     let latestNodes = state.rsipNodes;
     for (const match of matches) {
-      if (match.deduped) continue;
+      if (false) continue;
 
       const nodeExists = latestNodes.some(
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected [ { id: 'integration-node', …(14) } ] to deeply equal [ { id: 'integration-node', …(14) } ]

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:678:11
 
     let latestNodes = state.rsipNodes;
     for (const match of matches) {
-      if (match.deduped) continue;
+      if (true) continue;
 
       const nodeExists = latestNodes.some(
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected { id: 'integration-node', …(8) } to match object { stabilityPhase: 'E1', …(2) }
(6 matching properties omitted from actual)

[Killed] MethodExpression
src/hooks/domains/useRsipDomain.ts:680:26
     for (const match of matches) {
       if (match.deduped) continue;
 
-      const nodeExists = latestNodes.some(
-        (node) => node.id === match.link.rsipNodeId,
-      );
+      const nodeExists = latestNodes.every(node => node.id === match.link.rsipNodeId);
       if (!nodeExists) {
         logger.warn('RSIP', 'RSIP integration skipped: target node missing', {
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(3) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:681:19
       if (match.deduped) continue;
 
       const nodeExists = latestNodes.some(
-        (node) => node.id === match.link.rsipNodeId,
+        (node) => true,
       );
       if (!nodeExists) {
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:681:19
       if (match.deduped) continue;
 
       const nodeExists = latestNodes.some(
-        (node) => node.id === match.link.rsipNodeId,
+        (node) => false,
       );
       if (!nodeExists) {
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected { id: 'integration-node', …(8) } to match object { stabilityPhase: 'E1', …(2) }
(6 matching properties omitted from actual)

[Killed] BooleanLiteral
src/hooks/domains/useRsipDomain.ts:683:11
       const nodeExists = latestNodes.some(
         (node) => node.id === match.link.rsipNodeId,
       );
-      if (!nodeExists) {
+      if (nodeExists) {
         logger.warn('RSIP', 'RSIP integration skipped: target node missing', {
           event: payload.event,
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected { id: 'integration-node', …(8) } to match object { stabilityPhase: 'E1', …(2) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:683:24
       const nodeExists = latestNodes.some(
         (node) => node.id === match.link.rsipNodeId,
       );
-      if (!nodeExists) {
-        logger.warn('RSIP', 'RSIP integration skipped: target node missing', {
-          event: payload.event,
-          rsipNodeId: match.link.rsipNodeId,
-          chainId: payload.chainId,
-        });
-        continue;
-      }
+      if (!nodeExists) {}
 
       if (match.link.effect === 'mark_rsip_executed') {
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected "vi.fn()" to be called with arguments: [ 'RSIP', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useRsipDomain.ts:692:11
         continue;
       }
 
-      if (match.link.effect === 'mark_rsip_executed') {
+      if (true) {
         latestNodes = await markExecuted(
           match.link.rsipNodeId,
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ …(3) ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:692:11
         continue;
       }
 
-      if (match.link.effect === 'mark_rsip_executed') {
+      if (match.link.effect !== 'mark_rsip_executed') {
         latestNodes = await markExecuted(
           match.link.rsipNodeId,
killedBy: useRsipDomain handles task integration execution, dedupe, and missing-node warnings
statusReason: expected { id: 'integration-node', …(8) } to match object { stabilityPhase: 'E1', …(2) }
(6 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/domains/useRsipDomain.ts:703:18
             reasonCode: 'integration_task_completed',
           },
         );
-      } else if (match.link.effect === 'mark_rsip_violated') {
+      } else if (match.link.effect !== 'mark_rsip_violated') {
         latestNodes = await markViolated(
           match.link.rsipNodeId,
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(3) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:703:62
             reasonCode: 'integration_task_completed',
           },
         );
-      } else if (match.link.effect === 'mark_rsip_violated') {
-        latestNodes = await markViolated(
-          match.link.rsipNodeId,
-          latestNodes,
-          undefined,
-          {
-            sourceChainId: payload.chainId,
-            sourceEvent: payload.event,
-            reasonCode: 'integration_task_interrupted',
-          },
-        );
-      }
+      } else if (match.link.effect === 'mark_rsip_violated') {}
     }
 
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected [ Array(3) ] to deeply equal [ Array(1) ]

[Killed] ObjectLiteral
src/hooks/domains/useRsipDomain.ts:708:11
           match.link.rsipNodeId,
           latestNodes,
           undefined,
-          {
-            sourceChainId: payload.chainId,
-            sourceEvent: payload.event,
-            reasonCode: 'integration_task_interrupted',
-          },
+          {},
         );
       }
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { id: 'violation-record-id', …(8) } to match object { id: 'violation-record-id', …(5) }
(3 matching properties omitted from actual)

[Killed] StringLiteral
src/hooks/domains/useRsipDomain.ts:711:25
           {
             sourceChainId: payload.chainId,
             sourceEvent: payload.event,
-            reasonCode: 'integration_task_interrupted',
+            reasonCode: "",
           },
         );
killedBy: useRsipDomain handles task integration violation effects and records collapse details
statusReason: expected { id: 'violation-record-id', …(8) } to match object { id: 'violation-record-id', …(5) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/domains/useRsipDomain.ts:720:70
     return latestNodes;
   };
 
-  const getRsipTaskActions = (rsipNodeId: string): RSIPTaskLink[] => {
-    const state = readState();
-    return rsipTaskIntegrationService.getRsipToTaskLinks(
-      state?.rsipTaskLinks ?? [],
-      rsipNodeId,
-    );
-  };
+  const getRsipTaskActions = (rsipNodeId: string): RSIPTaskLink[] => {};
 
   return {
killedBy: useRsipDomain upserts task links and returns RSIP task actions for rsip_mark_executed prompts
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Killed] LogicalOperator
src/hooks/domains/useRsipDomain.ts:723:7
   const getRsipTaskActions = (rsipNodeId: string): RSIPTaskLink[] => {
     const state = readState();
     return rsipTaskIntegrationService.getRsipToTaskLinks(
-      state?.rsipTaskLinks ?? [],
+      state?.rsipTaskLinks && [],
       rsipNodeId,
     );
killedBy: useRsipDomain upserts task links and returns RSIP task actions for rsip_mark_executed prompts
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] OptionalChaining
src/hooks/domains/useRsipDomain.ts:723:7
   const getRsipTaskActions = (rsipNodeId: string): RSIPTaskLink[] => {
     const state = readState();
     return rsipTaskIntegrationService.getRsipToTaskLinks(
-      state?.rsipTaskLinks ?? [],
+      state.rsipTaskLinks ?? [],
       rsipNodeId,
     );
killedBy: useRsipDomain returns empty task-link integrations when state is unavailable
statusReason: Cannot read properties of null (reading 'rsipTaskLinks')
