[Killed] StringLiteral
infra/storage/supabase/retry.ts:7:3
 import { formatSupabaseError, getSupabaseErrorCode } from './supabaseError';
 
 const NON_RETRYABLE_ERROR_CODES = new Set([
-  'PGRST204',
+  "",
   'PGRST116',
   '42703',
killedBy: supabase/retry does not retry for non-retryable error code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
infra/storage/supabase/retry.ts:16:38
   'converting circular structure to json',
   'do not know how to serialize a bigint',
 ];
-const AUTH_ERROR_MESSAGE_FRAGMENTS = [
-  'violates row-level security policy',
-  'rls',
-  'authentication',
-  'auth',
-];
+const AUTH_ERROR_MESSAGE_FRAGMENTS = [];
 
 interface ErrorWithSupabaseMetadata extends Error {
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] StringLiteral
infra/storage/supabase/retry.ts:17:3
   'do not know how to serialize a bigint',
 ];
 const AUTH_ERROR_MESSAGE_FRAGMENTS = [
-  'violates row-level security policy',
+  "",
   'rls',
   'authentication',
killedBy: supabase/retry does not retry retryWithAuth for non-auth non-retryable code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
infra/storage/supabase/retry.ts:19:3
 const AUTH_ERROR_MESSAGE_FRAGMENTS = [
   'violates row-level security policy',
   'rls',
-  'authentication',
+  "",
   'auth',
 ];
killedBy: supabase/retry does not retry retryWithAuth for non-auth non-retryable code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
infra/storage/supabase/retry.ts:27:73
   code?: string;
 }
 
-function toErrorWithMetadata(error: unknown): ErrorWithSupabaseMetadata {
-  if (error instanceof Error) return error;
-
-  const wrapped: ErrorWithSupabaseMetadata = new Error(
-    formatSupabaseError(error, String(error)),
-  );
-  const code = getSupabaseErrorCode(error);
-  if (code) wrapped.code = code;
-  return wrapped;
-
-  // unreachable
-}
+function toErrorWithMetadata(error: unknown): ErrorWithSupabaseMetadata {}
 
 function isNonRetryableMessage(message: string): boolean {
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:28:7
 }
 
 function toErrorWithMetadata(error: unknown): ErrorWithSupabaseMetadata {
-  if (error instanceof Error) return error;
+  if (false) return error;
 
   const wrapped: ErrorWithSupabaseMetadata = new Error(
killedBy: supabase/retry preserves original Error instances when retries are exhausted
statusReason: expected Error: boom to be Error: boom // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Error: boom
Received: serializes to the same string

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:28:7
 }
 
 function toErrorWithMetadata(error: unknown): ErrorWithSupabaseMetadata {
-  if (error instanceof Error) return error;
+  if (true) return error;
 
   const wrapped: ErrorWithSupabaseMetadata = new Error(
killedBy: supabase/retry wraps non-Error failures and surfaces formatted message when retries are exhausted
statusReason: expected [Function] to throw error including 'code=500 | raw failure | details=deta…' but got 'raw failure'

[Survived] ConditionalExpression
infra/storage/supabase/retry.ts:34:7
     formatSupabaseError(error, String(error)),
   );
   const code = getSupabaseErrorCode(error);
-  if (code) wrapped.code = code;
+  if (false) wrapped.code = code;
   return wrapped;
 

[Survived] ConditionalExpression
infra/storage/supabase/retry.ts:34:7
     formatSupabaseError(error, String(error)),
   );
   const code = getSupabaseErrorCode(error);
-  if (code) wrapped.code = code;
+  if (true) wrapped.code = code;
   return wrapped;
 

[Killed] BlockStatement
infra/storage/supabase/retry.ts:40:58
   // unreachable
 }
 
-function isNonRetryableMessage(message: string): boolean {
-  const normalizedMessage = message.toLowerCase();
-  return NON_RETRYABLE_ERROR_MESSAGES.some((fragment) =>
-    normalizedMessage.includes(fragment),
-  );
-}
+function isNonRetryableMessage(message: string): boolean {}
 
 function isNonRetryableCode(error: unknown): boolean {
killedBy: supabase/retry does not retry for non-retryable serialization errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
infra/storage/supabase/retry.ts:41:29
 }
 
 function isNonRetryableMessage(message: string): boolean {
-  const normalizedMessage = message.toLowerCase();
+  const normalizedMessage = message.toUpperCase();
   return NON_RETRYABLE_ERROR_MESSAGES.some((fragment) =>
     normalizedMessage.includes(fragment),
killedBy: supabase/retry does not retry for non-retryable serialization errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
infra/storage/supabase/retry.ts:42:10
 
 function isNonRetryableMessage(message: string): boolean {
   const normalizedMessage = message.toLowerCase();
-  return NON_RETRYABLE_ERROR_MESSAGES.some((fragment) =>
-    normalizedMessage.includes(fragment),
-  );
+  return NON_RETRYABLE_ERROR_MESSAGES.every(fragment => normalizedMessage.includes(fragment));
 }
 
killedBy: supabase/retry does not retry for non-retryable serialization errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
infra/storage/supabase/retry.ts:42:44
 
 function isNonRetryableMessage(message: string): boolean {
   const normalizedMessage = message.toLowerCase();
-  return NON_RETRYABLE_ERROR_MESSAGES.some((fragment) =>
-    normalizedMessage.includes(fragment),
+  return NON_RETRYABLE_ERROR_MESSAGES.some(() => undefined,
   );
 }
killedBy: supabase/retry does not retry for non-retryable serialization errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
infra/storage/supabase/retry.ts:47:54
   );
 }
 
-function isNonRetryableCode(error: unknown): boolean {
-  const errorCode = getSupabaseErrorCode(error);
-  return (
-    Boolean(errorCode) && NON_RETRYABLE_ERROR_CODES.has(errorCode as string)
-  );
-}
+function isNonRetryableCode(error: unknown): boolean {}
 
 function isAuthRelatedMessage(message: string): boolean {
killedBy: supabase/retry does not retry for non-retryable error code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
infra/storage/supabase/retry.ts:50:5
 function isNonRetryableCode(error: unknown): boolean {
   const errorCode = getSupabaseErrorCode(error);
   return (
-    Boolean(errorCode) && NON_RETRYABLE_ERROR_CODES.has(errorCode as string)
+    Boolean(errorCode) || NON_RETRYABLE_ERROR_CODES.has(errorCode as string)
   );
 }
killedBy: supabase/retry wraps non-Error failures and surfaces formatted message when retries are exhausted
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:50:5
 function isNonRetryableCode(error: unknown): boolean {
   const errorCode = getSupabaseErrorCode(error);
   return (
-    Boolean(errorCode) && NON_RETRYABLE_ERROR_CODES.has(errorCode as string)
+    true
   );
 }
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
infra/storage/supabase/retry.ts:54:57
   );
 }
 
-function isAuthRelatedMessage(message: string): boolean {
-  const normalizedMessage = message.toLowerCase();
-  return AUTH_ERROR_MESSAGE_FRAGMENTS.some((fragment) =>
-    normalizedMessage.includes(fragment),
-  );
-}
+function isAuthRelatedMessage(message: string): boolean {}
 
 function getRetryDelayMs(baseDelay: number, attempt: number): number {
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] MethodExpression
infra/storage/supabase/retry.ts:55:29
 }
 
 function isAuthRelatedMessage(message: string): boolean {
-  const normalizedMessage = message.toLowerCase();
+  const normalizedMessage = message.toUpperCase();
   return AUTH_ERROR_MESSAGE_FRAGMENTS.some((fragment) =>
     normalizedMessage.includes(fragment),
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] ArrowFunction
infra/storage/supabase/retry.ts:56:44
 
 function isAuthRelatedMessage(message: string): boolean {
   const normalizedMessage = message.toLowerCase();
-  return AUTH_ERROR_MESSAGE_FRAGMENTS.some((fragment) =>
-    normalizedMessage.includes(fragment),
+  return AUTH_ERROR_MESSAGE_FRAGMENTS.some(() => undefined,
   );
 }
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] MethodExpression
infra/storage/supabase/retry.ts:56:10
 
 function isAuthRelatedMessage(message: string): boolean {
   const normalizedMessage = message.toLowerCase();
-  return AUTH_ERROR_MESSAGE_FRAGMENTS.some((fragment) =>
-    normalizedMessage.includes(fragment),
-  );
+  return AUTH_ERROR_MESSAGE_FRAGMENTS.every(fragment => normalizedMessage.includes(fragment));
 }
 
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] BlockStatement
infra/storage/supabase/retry.ts:61:70
   );
 }
 
-function getRetryDelayMs(baseDelay: number, attempt: number): number {
-  return baseDelay * Math.pow(2, attempt);
-}
+function getRetryDelayMs(baseDelay: number, attempt: number): number {}
 
 function sleep(ms: number): Promise<void> {
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] ArithmeticOperator
infra/storage/supabase/retry.ts:62:10
 }
 
 function getRetryDelayMs(baseDelay: number, attempt: number): number {
-  return baseDelay * Math.pow(2, attempt);
+  return baseDelay / Math.pow(2, attempt);
 }
 
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times

[Killed] BlockStatement
infra/storage/supabase/retry.ts:65:43
   return baseDelay * Math.pow(2, attempt);
 }
 
-function sleep(ms: number): Promise<void> {
-  return new Promise((resolve) => setTimeout(resolve, ms));
-}
+function sleep(ms: number): Promise<void> {}
 
 async function ensureAuthenticatedForRetry(
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] BlockStatement
infra/storage/supabase/retry.ts:77:18
     ): Promise<{ user: User | null; isAuthenticated: boolean }>;
   },
   attempt: number,
-): Promise<void> {
-  const isAuthenticated = await deps.isUserAuthenticated();
-  if (isAuthenticated || attempt === 0) return;
-
-  const { user, isAuthenticated: isAuthenticatedAfterWait } =
-    await deps.waitForAuthentication(5000);
-  if (!isAuthenticatedAfterWait || !user) {
-    throw new Error('Authentication failed after waiting');
-  }
-}
+): Promise<void> {}
 
 function logAuthAwareRetryAttempt(details: {
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'violates row-level security policy'

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:79:7
   attempt: number,
 ): Promise<void> {
   const isAuthenticated = await deps.isUserAuthenticated();
-  if (isAuthenticated || attempt === 0) return;
+  if (false) return;
 
   const { user, isAuthenticated: isAuthenticatedAfterWait } =
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:79:26
   attempt: number,
 ): Promise<void> {
   const isAuthenticated = await deps.isUserAuthenticated();
-  if (isAuthenticated || attempt === 0) return;
+  if (isAuthenticated || false) return;
 
   const { user, isAuthenticated: isAuthenticatedAfterWait } =
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:83:7
 
   const { user, isAuthenticated: isAuthenticatedAfterWait } =
     await deps.waitForAuthentication(5000);
-  if (!isAuthenticatedAfterWait || !user) {
+  if (false) {
     throw new Error('Authentication failed after waiting');
   }
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'violates row-level security policy'

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:83:7
 
   const { user, isAuthenticated: isAuthenticatedAfterWait } =
     await deps.waitForAuthentication(5000);
-  if (!isAuthenticatedAfterWait || !user) {
+  if (true) {
     throw new Error('Authentication failed after waiting');
   }
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Authentication failed after waiting" instead of resolving

[Killed] StringLiteral
infra/storage/supabase/retry.ts:84:21
   const { user, isAuthenticated: isAuthenticatedAfterWait } =
     await deps.waitForAuthentication(5000);
   if (!isAuthenticatedAfterWait || !user) {
-    throw new Error('Authentication failed after waiting');
+    throw new Error("");
   }
 }
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got ''

[Killed] BlockStatement
infra/storage/supabase/retry.ts:94:10
   maxRetries: number;
   error: string;
   isAuthError: boolean;
-}): void {
-  if (!isDev) return;
-  logger.warn('SUPABASE_STORAGE', 'Auth-aware retry', details);
-}
+}): void {}
 
 export async function retryOperation<T>(
killedBy: supabase/retry logs auth-aware retry details and terminal auth failure payloads in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:95:7
   error: string;
   isAuthError: boolean;
 }): void {
-  if (!isDev) return;
+  if (true) return;
   logger.warn('SUPABASE_STORAGE', 'Auth-aware retry', details);
 }
killedBy: supabase/retry logs auth-aware retry details and terminal auth failure payloads in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Number of calls: 0

[Killed] BooleanLiteral
infra/storage/supabase/retry.ts:95:7
   error: string;
   isAuthError: boolean;
 }): void {
-  if (!isDev) return;
+  if (isDev) return;
   logger.warn('SUPABASE_STORAGE', 'Auth-aware retry', details);
 }
killedBy: supabase/retry logs auth-aware retry details and terminal auth failure payloads in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Number of calls: 0

[Killed] StringLiteral
infra/storage/supabase/retry.ts:96:35
   isAuthError: boolean;
 }): void {
   if (!isDev) return;
-  logger.warn('SUPABASE_STORAGE', 'Auth-aware retry', details);
+  logger.warn('SUPABASE_STORAGE', "", details);
 }
 
killedBy: supabase/retry logs auth-aware retry details and terminal auth failure payloads in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "SUPABASE_STORAGE",

[Killed] EqualityOperator
infra/storage/supabase/retry.ts:106:25
 ): Promise<T> {
   let lastError: Error | undefined;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt++) {
+  for (let attempt = 0; attempt < maxRetries; attempt++) {
     try {
       return await operation();
killedBy: supabase/retry wraps non-Error failures and surfaces formatted message when retries are exhausted
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] UpdateOperator
infra/storage/supabase/retry.ts:106:48
 ): Promise<T> {
   let lastError: Error | undefined;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt++) {
+  for (let attempt = 0; attempt <= maxRetries; attempt--) {
     try {
       return await operation();
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times

[Killed] BlockStatement
infra/storage/supabase/retry.ts:107:9
   let lastError: Error | undefined;
 
   for (let attempt = 0; attempt <= maxRetries; attempt++) {
-    try {
-      return await operation();
-    } catch (error) {
+    try {} catch (error) {
       lastError = toErrorWithMetadata(error);
 
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:113:9
       lastError = toErrorWithMetadata(error);
 
       if (
-        isNonRetryableMessage(lastError.message) ||
-        isNonRetryableCode(error)
+        true
       ) {
         throw lastError;
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:113:9
       lastError = toErrorWithMetadata(error);
 
       if (
-        isNonRetryableMessage(lastError.message) ||
-        isNonRetryableCode(error)
+        false
       ) {
         throw lastError;
killedBy: supabase/retry does not retry for non-retryable error code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
infra/storage/supabase/retry.ts:115:9
       if (
         isNonRetryableMessage(lastError.message) ||
         isNonRetryableCode(error)
-      ) {
-        throw lastError;
-      }
+      ) {}
 
       if (attempt === maxRetries) {
killedBy: supabase/retry does not retry for non-retryable error code
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
infra/storage/supabase/retry.ts:119:35
         throw lastError;
       }
 
-      if (attempt === maxRetries) {
-        logger.error(
-          'SUPABASE_STORAGE',
-          'Database operation failed after retries',
-          {
-            maxRetries,
-            error: lastError.message,
-          },
-        );
-        throw lastError;
-      }
+      if (attempt === maxRetries) {}
 
       const delay = getRetryDelayMs(baseDelay, attempt);
killedBy: supabase/retry preserves original Error instances when retries are exhausted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
infra/storage/supabase/retry.ts:119:11
         throw lastError;
       }
 
-      if (attempt === maxRetries) {
+      if (attempt !== maxRetries) {
         logger.error(
           'SUPABASE_STORAGE',
killedBy: supabase/retry retries with exponential backoff and eventually succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ObjectLiteral
infra/storage/supabase/retry.ts:123:11
         logger.error(
           'SUPABASE_STORAGE',
           'Database operation failed after retries',
-          {
-            maxRetries,
-            error: lastError.message,
-          },
+          {},
         );
         throw lastError;
killedBy: supabase/retry logs terminal retry failures with metadata
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "SUPABASE_STORAGE",

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:132:11
       }
 
       const delay = getRetryDelayMs(baseDelay, attempt);
-      if (isDev) {
+      if (true) {
         logger.warn('SUPABASE_STORAGE', 'Operation failed; retrying', {
           delay,
killedBy: supabase/retry does not log intermediate retry warnings outside dev mode
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "SUPABASE_STORAGE",

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:132:11
       }
 
       const delay = getRetryDelayMs(baseDelay, attempt);
-      if (isDev) {
+      if (false) {
         logger.warn('SUPABASE_STORAGE', 'Operation failed; retrying', {
           delay,
killedBy: supabase/retry logs intermediate retry warnings only in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Number of calls: 0

[Killed] StringLiteral
infra/storage/supabase/retry.ts:133:41
 
       const delay = getRetryDelayMs(baseDelay, attempt);
       if (isDev) {
-        logger.warn('SUPABASE_STORAGE', 'Operation failed; retrying', {
+        logger.warn('SUPABASE_STORAGE', "", {
           delay,
           attempt: attempt + 1,
killedBy: supabase/retry logs intermediate retry warnings only in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "SUPABASE_STORAGE",

[Killed] ArithmeticOperator
infra/storage/supabase/retry.ts:135:20
       if (isDev) {
         logger.warn('SUPABASE_STORAGE', 'Operation failed; retrying', {
           delay,
-          attempt: attempt + 1,
+          attempt: attempt - 1,
           maxRetries,
           error: lastError.message,
killedBy: supabase/retry logs intermediate retry warnings only in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "SUPABASE_STORAGE",

[NoCoverage] LogicalOperator
infra/storage/supabase/retry.ts:144:9
     }
   }
 
-  throw lastError ?? new Error('Retry operation failed');
+  throw lastError && new Error('Retry operation failed');
 }
 

[NoCoverage] StringLiteral
infra/storage/supabase/retry.ts:144:32
     }
   }
 
-  throw lastError ?? new Error('Retry operation failed');
+  throw lastError ?? new Error("");
 }
 

[Killed] EqualityOperator
infra/storage/supabase/retry.ts:160:25
 ): Promise<T> {
   let lastError: Error | undefined;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt++) {
+  for (let attempt = 0; attempt > maxRetries; attempt++) {
     try {
       await ensureAuthenticatedForRetry(deps, attempt);
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'Retry with auth failed'

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:160:25
 ): Promise<T> {
   let lastError: Error | undefined;
 
-  for (let attempt = 0; attempt <= maxRetries; attempt++) {
+  for (let attempt = 0; false; attempt++) {
     try {
       await ensureAuthenticatedForRetry(deps, attempt);
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'Retry with auth failed'

[Killed] BlockStatement
infra/storage/supabase/retry.ts:161:9
   let lastError: Error | undefined;
 
   for (let attempt = 0; attempt <= maxRetries; attempt++) {
-    try {
-      await ensureAuthenticatedForRetry(deps, attempt);
-      return await operation();
-    } catch (error) {
+    try {} catch (error) {
       lastError = toErrorWithMetadata(error);
 
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'Retry with auth failed'

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:167:11
     } catch (error) {
       lastError = toErrorWithMetadata(error);
 
-      if (isNonRetryableMessage(lastError.message)) {
+      if (true) {
         throw lastError;
       }
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'violates row-level security policy'

[Survived] ConditionalExpression
infra/storage/supabase/retry.ts:167:11
     } catch (error) {
       lastError = toErrorWithMetadata(error);
 
-      if (isNonRetryableMessage(lastError.message)) {
+      if (false) {
         throw lastError;
       }

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:172:11
       }
 
       const isAuthError = isAuthRelatedMessage(lastError.message);
-      if (!isAuthError && isNonRetryableCode(error)) {
+      if (true) {
         throw lastError;
       }
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'violates row-level security policy'

[Killed] LogicalOperator
infra/storage/supabase/retry.ts:172:11
       }
 
       const isAuthError = isAuthRelatedMessage(lastError.message);
-      if (!isAuthError && isNonRetryableCode(error)) {
+      if (!isAuthError || isNonRetryableCode(error)) {
         throw lastError;
       }
killedBy: supabase/retry retries auth-related failures even when error code is normally non-retryable
statusReason: promise rejected "Error: Auth token violates row-level secu… { code: '…' }" instead of resolving

[Killed] BlockStatement
infra/storage/supabase/retry.ts:176:35
         throw lastError;
       }
 
-      if (attempt === maxRetries) {
-        logger.error(
-          'SUPABASE_STORAGE',
-          'Database operation failed after retries with auth',
-          {
-            maxRetries,
-            error: lastError.message,
-            isAuthError,
-          },
-        );
-        throw lastError;
-      }
+      if (attempt === maxRetries) {}
 
       const delay = getRetryDelayMs(baseDelay, attempt);
killedBy: supabase/retry logs auth-aware retry details and terminal auth failure payloads in dev mode
statusReason: expected "vi.fn()" to be called with arguments: [ 'SUPABASE_STORAGE', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
infra/storage/supabase/retry.ts:176:11
         throw lastError;
       }
 
-      if (attempt === maxRetries) {
+      if (true) {
         logger.error(
           'SUPABASE_STORAGE',
killedBy: supabase/retry fails when auth cannot be re-established for retryWithAuth
statusReason: expected [Function] to throw error including 'Authentication failed after waiting' but got 'violates row-level security policy'

[NoCoverage] LogicalOperator
infra/storage/supabase/retry.ts:202:9
     }
   }
 
-  throw lastError ?? new Error('Retry with auth failed');
+  throw lastError && new Error('Retry with auth failed');
 }
 
