[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:18:12
 function checkTypeActionMatch(
   ruleType: ExceptionRuleType,
   actionType: ActionType,
-): boolean {
-  switch (actionType) {
-    case 'pause':
-      return ruleType === ExceptionRuleType.PAUSE_ONLY;
-    case 'early_completion':
-      return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
-    default:
-      return false;
-  }
-}
+): boolean {}
 
 function isValidRuleType(type: string): type is ExceptionRuleType {
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected { isValid: false, …(4) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:20:5
   actionType: ActionType,
 ): boolean {
   switch (actionType) {
-    case 'pause':
-      return ruleType === ExceptionRuleType.PAUSE_ONLY;
+    case 'pause':
     case 'early_completion':
       return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
killedBy: validateRuleTypeForAction returns pause-side mismatch message and actions when early-completion rule is used for pause
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:20:10
   actionType: ActionType,
 ): boolean {
   switch (actionType) {
-    case 'pause':
+    case "":
       return ruleType === ExceptionRuleType.PAUSE_ONLY;
     case 'early_completion':
killedBy: validateRuleTypeForAction returns valid result for pause action with pause-only rule
statusReason: expected { isValid: false, …(4) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:21:14
 ): boolean {
   switch (actionType) {
     case 'pause':
-      return ruleType === ExceptionRuleType.PAUSE_ONLY;
+      return false;
     case 'early_completion':
       return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
killedBy: validateRuleTypeForAction returns valid result for pause action with pause-only rule
statusReason: expected { isValid: false, …(4) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:21:14
 ): boolean {
   switch (actionType) {
     case 'pause':
-      return ruleType === ExceptionRuleType.PAUSE_ONLY;
+      return true;
     case 'early_completion':
       return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
killedBy: validateRuleTypeForAction returns pause-side mismatch message and actions when early-completion rule is used for pause
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:22:5
   switch (actionType) {
     case 'pause':
       return ruleType === ExceptionRuleType.PAUSE_ONLY;
-    case 'early_completion':
-      return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
+    case 'early_completion':
     default:
       return false;
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected { isValid: false, …(4) } to deeply equal ObjectContaining{…}

[Killed] EqualityOperator
services/enhanced-rule-validation/validators/typeMatch.ts:23:14
     case 'pause':
       return ruleType === ExceptionRuleType.PAUSE_ONLY;
     case 'early_completion':
-      return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
+      return ruleType !== ExceptionRuleType.EARLY_COMPLETION_ONLY;
     default:
       return false;
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:23:14
     case 'pause':
       return ruleType === ExceptionRuleType.PAUSE_ONLY;
     case 'early_completion':
-      return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
+      return false;
     default:
       return false;
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected { isValid: false, …(4) } to deeply equal ObjectContaining{…}

[NoCoverage] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:24:5
       return ruleType === ExceptionRuleType.PAUSE_ONLY;
     case 'early_completion':
       return ruleType === ExceptionRuleType.EARLY_COMPLETION_ONLY;
-    default:
-      return false;
+    default:
   }
 }

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:29:67
   }
 }
 
-function isValidRuleType(type: string): type is ExceptionRuleType {
-  return Object.values(ExceptionRuleType).includes(type as ExceptionRuleType);
-}
+function isValidRuleType(type: string): type is ExceptionRuleType {}
 
 function isValidActionType(actionType: string): actionType is ActionType {
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected 'INVALID_RULE_TYPE' to be 'VALIDATION_ERROR' // Object.is equality

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:33:74
   return Object.values(ExceptionRuleType).includes(type as ExceptionRuleType);
 }
 
-function isValidActionType(actionType: string): actionType is ActionType {
-  return actionType === 'pause' || actionType === 'early_completion';
-}
+function isValidActionType(actionType: string): actionType is ActionType {}
 
 function getRuleTypeDisplayName(type: ExceptionRuleType): string {
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected 'VALIDATION_ERROR' to be 'RULE_TYPE_MISMATCH' // Object.is equality

[Killed] EqualityOperator
services/enhanced-rule-validation/validators/typeMatch.ts:34:10
 }
 
 function isValidActionType(actionType: string): actionType is ActionType {
-  return actionType === 'pause' || actionType === 'early_completion';
+  return actionType !== 'pause' || actionType === 'early_completion';
 }
 
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected 'RULE_TYPE_MISMATCH' to be 'VALIDATION_ERROR' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:34:10
 }
 
 function isValidActionType(actionType: string): actionType is ActionType {
-  return actionType === 'pause' || actionType === 'early_completion';
+  return false;
 }
 
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected 'VALIDATION_ERROR' to be 'RULE_TYPE_MISMATCH' // Object.is equality

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:37:66
   return actionType === 'pause' || actionType === 'early_completion';
 }
 
-function getRuleTypeDisplayName(type: ExceptionRuleType): string {
-  switch (type) {
-    case ExceptionRuleType.PAUSE_ONLY:
-      return '暂停';
-    case ExceptionRuleType.EARLY_COMPLETION_ONLY:
-      return '提前完成';
-    default:
-      return '未知类型';
-  }
-}
+function getRuleTypeDisplayName(type: ExceptionRuleType): string {}
 
 function getActionTypeDisplayName(actionType: ActionType): string {
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected '规则 "Test rule" 是undefined类型，不能用于提前完成操作' to be '规则 "Test rule" 是暂停类型，不能用于提前完成操作' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:39:5
 
 function getRuleTypeDisplayName(type: ExceptionRuleType): string {
   switch (type) {
-    case ExceptionRuleType.PAUSE_ONLY:
-      return '暂停';
+    case ExceptionRuleType.PAUSE_ONLY:
     case ExceptionRuleType.EARLY_COMPLETION_ONLY:
       return '提前完成';
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected '规则 "Test rule" 是提前完成类型，不能用于提前完成操作' to be '规则 "Test rule" 是暂停类型，不能用于提前完成操作' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:41:5
   switch (type) {
     case ExceptionRuleType.PAUSE_ONLY:
       return '暂停';
-    case ExceptionRuleType.EARLY_COMPLETION_ONLY:
-      return '提前完成';
+    case ExceptionRuleType.EARLY_COMPLETION_ONLY:
     default:
       return '未知类型';
killedBy: validateRuleTypeForAction returns pause-side mismatch message and actions when early-completion rule is used for pause
statusReason: expected '规则 "Test rule" 是未知类型类型，不能用于暂停操作' to be '规则 "Test rule" 是提前完成类型，不能用于暂停操作' // Object.is equality

[NoCoverage] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:43:5
       return '暂停';
     case ExceptionRuleType.EARLY_COMPLETION_ONLY:
       return '提前完成';
-    default:
-      return '未知类型';
+    default:
   }
 }

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:48:67
   }
 }
 
-function getActionTypeDisplayName(actionType: ActionType): string {
-  switch (actionType) {
-    case 'pause':
-      return '暂停';
-    case 'early_completion':
-      return '提前完成';
-    default:
-      return '未知操作';
-  }
-}
+function getActionTypeDisplayName(actionType: ActionType): string {}
 
 function getSuggestedActionsForMismatch(
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected '规则 "Test rule" 是暂停类型，不能用于undefined操作' to be '规则 "Test rule" 是暂停类型，不能用于提前完成操作' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:50:5
 
 function getActionTypeDisplayName(actionType: ActionType): string {
   switch (actionType) {
-    case 'pause':
-      return '暂停';
+    case 'pause':
     case 'early_completion':
       return '提前完成';
killedBy: validateRuleTypeForAction returns pause-side mismatch message and actions when early-completion rule is used for pause
statusReason: expected '规则 "Test rule" 是提前完成类型，不能用于提前完成操作' to be '规则 "Test rule" 是提前完成类型，不能用于暂停操作' // Object.is equality

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:51:14
 function getActionTypeDisplayName(actionType: ActionType): string {
   switch (actionType) {
     case 'pause':
-      return '暂停';
+      return "";
     case 'early_completion':
       return '提前完成';
killedBy: validateRuleTypeForAction returns pause-side mismatch message and actions when early-completion rule is used for pause
statusReason: expected '规则 "Test rule" 是提前完成类型，不能用于操作' to be '规则 "Test rule" 是提前完成类型，不能用于暂停操作' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:52:5
   switch (actionType) {
     case 'pause':
       return '暂停';
-    case 'early_completion':
-      return '提前完成';
+    case 'early_completion':
     default:
       return '未知操作';
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected '规则 "Test rule" 是暂停类型，不能用于未知操作操作' to be '规则 "Test rule" 是暂停类型，不能用于提前完成操作' // Object.is equality

[NoCoverage] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:54:5
       return '暂停';
     case 'early_completion':
       return '提前完成';
-    default:
-      return '未知操作';
+    default:
   }
 }

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:62:23
 function getSuggestedActionsForMismatch(
   rule: ExceptionRule,
   actionType: ActionType,
-): ValidationAction[] {
-  const correctType =
-    actionType === 'pause'
-      ? ExceptionRuleType.PAUSE_ONLY
-      : ExceptionRuleType.EARLY_COMPLETION_ONLY;
-
-  const actionName = getActionTypeDisplayName(actionType);
-  ignoreUnused(rule, correctType);
-
-  return [
-    {
-      type: 'create_new',
-      label: `创建${actionName}规则`,
-      description: `创建一个新的${actionName}类型规则`,
-      handler: async () => ignoreUnused(rule, actionType),
-    },
-    {
-      type: 'use_existing',
-      label: `选择${actionName}规则`,
-      description: `从现有的${actionName}规则中选择`,
-      handler: async () => ignoreUnused(rule, actionType),
-    },
-  ];
-}
+): ValidationAction[] {}
 
 export function validateRuleTypeForAction(
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: Target cannot be null or undefined.

[Survived] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:64:5
   actionType: ActionType,
 ): ValidationAction[] {
   const correctType =
-    actionType === 'pause'
+    false
       ? ExceptionRuleType.PAUSE_ONLY
       : ExceptionRuleType.EARLY_COMPLETION_ONLY;

[Survived] EqualityOperator
services/enhanced-rule-validation/validators/typeMatch.ts:64:5
   actionType: ActionType,
 ): ValidationAction[] {
   const correctType =
-    actionType === 'pause'
+    actionType !== 'pause'
       ? ExceptionRuleType.PAUSE_ONLY
       : ExceptionRuleType.EARLY_COMPLETION_ONLY;

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:73:13
 
   return [
     {
-      type: 'create_new',
+      type: "",
       label: `创建${actionName}规则`,
       description: `创建一个新的${actionName}类型规则`,
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected { type: '', label: '创建提前完成规则', …(2) } to deeply equal ObjectContaining{…}

[Killed] ArrowFunction
services/enhanced-rule-validation/validators/typeMatch.ts:76:16
       type: 'create_new',
       label: `创建${actionName}规则`,
       description: `创建一个新的${actionName}类型规则`,
-      handler: async () => ignoreUnused(rule, actionType),
+      handler: () => undefined,
     },
     {
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] ArrowFunction
services/enhanced-rule-validation/validators/typeMatch.ts:82:16
       type: 'use_existing',
       label: `选择${actionName}规则`,
       description: `从现有的${actionName}规则中选择`,
-      handler: async () => ignoreUnused(rule, actionType),
+      handler: () => undefined,
     },
   ];
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] BooleanLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:92:9
   actionType: ActionType,
 ): RuleValidationResult {
   try {
-    if (!rule) {
+    if (rule) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns RULE_NOT_FOUND when rule is missing
statusReason: expected 'VALIDATION_ERROR' to be 'RULE_NOT_FOUND' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:92:9
   actionType: ActionType,
 ): RuleValidationResult {
   try {
-    if (!rule) {
+    if (true) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: expected 'RULE_NOT_FOUND' to be 'INVALID_RULE_TYPE' // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:93:14
 ): RuleValidationResult {
   try {
     if (!rule) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.RULE_NOT_FOUND,
-        errorMessage: '规则对象为空',
-        debugInfo: { rule, actionType },
-      };
+      return {};
     }
 
killedBy: validateRuleTypeForAction returns RULE_NOT_FOUND when rule is missing
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:101:9
       };
     }
 
-    if (!rule.type) {
+    if (false) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:101:21
       };
     }
 
-    if (!rule.type) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.INVALID_RULE_TYPE,
-        errorMessage: `规则 "${rule.name}" 缺少类型定义`,
-        suggestedActions: [
-          {
-            type: 'fix_data',
-            label: '修复规则类型',
-            description: '为规则设置正确的类型',
-            handler: async () => ignoreUnused(rule, actionType),
-          },
-        ],
-        debugInfo: { rule, actionType },
-      };
-    }
+    if (!rule.type) {}
 
     const validRuleType = isValidRuleType(rule.type);
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:102:14
     }
 
     if (!rule.type) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.INVALID_RULE_TYPE,
-        errorMessage: `规则 "${rule.name}" 缺少类型定义`,
-        suggestedActions: [
-          {
-            type: 'fix_data',
-            label: '修复规则类型',
-            description: '为规则设置正确的类型',
-            handler: async () => ignoreUnused(rule, actionType),
-          },
-        ],
-        debugInfo: { rule, actionType },
-      };
+      return {};
     }
 
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: expected undefined to be false // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:107:11
         errorType: ExceptionRuleError.INVALID_RULE_TYPE,
         errorMessage: `规则 "${rule.name}" 缺少类型定义`,
         suggestedActions: [
-          {
-            type: 'fix_data',
-            label: '修复规则类型',
-            description: '为规则设置正确的类型',
-            handler: async () => ignoreUnused(rule, actionType),
-          },
+          {},
         ],
         debugInfo: { rule, actionType },
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: expected {} to deeply equal ObjectContaining{…}

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:108:19
         errorMessage: `规则 "${rule.name}" 缺少类型定义`,
         suggestedActions: [
           {
-            type: 'fix_data',
+            type: "",
             label: '修复规则类型',
             description: '为规则设置正确的类型',
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: expected { type: '', label: '修复规则类型', …(2) } to deeply equal ObjectContaining{…}

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:110:26
           {
             type: 'fix_data',
             label: '修复规则类型',
-            description: '为规则设置正确的类型',
+            description: "",
             handler: async () => ignoreUnused(rule, actionType),
           },
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is missing
statusReason: expected { type: 'fix_data', …(3) } to deeply equal ObjectContaining{…}

[Survived] ArrowFunction
services/enhanced-rule-validation/validators/typeMatch.ts:111:22
             type: 'fix_data',
             label: '修复规则类型',
             description: '为规则设置正确的类型',
-            handler: async () => ignoreUnused(rule, actionType),
+            handler: () => undefined,
           },
         ],

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:119:9
     }
 
     const validRuleType = isValidRuleType(rule.type);
-    if (!validRuleType) {
+    if (false) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is not in enum
statusReason: expected 'RULE_TYPE_MISMATCH' to be 'INVALID_RULE_TYPE' // Object.is equality

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:119:25
     }
 
     const validRuleType = isValidRuleType(rule.type);
-    if (!validRuleType) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.INVALID_RULE_TYPE,
-        errorMessage: `规则 "${rule.name}" 的类型 "${rule.type}" 无效`,
-        debugInfo: {
-          rule,
-          actionType,
-          validTypes: Object.values(ExceptionRuleType),
-        },
-      };
-    }
+    if (!validRuleType) {}
 
     const validActionType = isValidActionType(actionType);
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is not in enum
statusReason: expected 'RULE_TYPE_MISMATCH' to be 'INVALID_RULE_TYPE' // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:120:14
 
     const validRuleType = isValidRuleType(rule.type);
     if (!validRuleType) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.INVALID_RULE_TYPE,
-        errorMessage: `规则 "${rule.name}" 的类型 "${rule.type}" 无效`,
-        debugInfo: {
-          rule,
-          actionType,
-          validTypes: Object.values(ExceptionRuleType),
-        },
-      };
+      return {};
     }
 
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is not in enum
statusReason: expected undefined to be false // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:124:20
         isValid: false,
         errorType: ExceptionRuleError.INVALID_RULE_TYPE,
         errorMessage: `规则 "${rule.name}" 的类型 "${rule.type}" 无效`,
-        debugInfo: {
-          rule,
-          actionType,
-          validTypes: Object.values(ExceptionRuleType),
-        },
+        debugInfo: {},
       };
     }
killedBy: validateRuleTypeForAction returns INVALID_RULE_TYPE when rule type is not in enum
statusReason: expected {} to deeply equal ObjectContaining{…}

[Killed] BooleanLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:133:9
     }
 
     const validActionType = isValidActionType(actionType);
-    if (!validActionType) {
+    if (validActionType) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected 'RULE_TYPE_MISMATCH' to be 'VALIDATION_ERROR' // Object.is equality

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:133:9
     }
 
     const validActionType = isValidActionType(actionType);
-    if (!validActionType) {
+    if (true) {
       return {
         isValid: false,
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected 'VALIDATION_ERROR' to be 'RULE_TYPE_MISMATCH' // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:134:14
 
     const validActionType = isValidActionType(actionType);
     if (!validActionType) {
-      return {
-        isValid: false,
-        errorType: ExceptionRuleError.VALIDATION_ERROR,
-        errorMessage: `操作类型 "${actionType}" 无效`,
-        debugInfo: {
-          rule,
-          actionType,
-          validActions: ['pause', 'early_completion'],
-        },
-      };
+      return {};
     }
 
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:137:23
       return {
         isValid: false,
         errorType: ExceptionRuleError.VALIDATION_ERROR,
-        errorMessage: `操作类型 "${actionType}" 无效`,
+        errorMessage: ``,
         debugInfo: {
           rule,
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected '' to be '操作类型 "invalid" 无效' // Object.is equality

[Killed] ArrayDeclaration
services/enhanced-rule-validation/validators/typeMatch.ts:141:25
         debugInfo: {
           rule,
           actionType,
-          validActions: ['pause', 'early_completion'],
+          validActions: [],
         },
       };
killedBy: validateRuleTypeForAction returns VALIDATION_ERROR for invalid action type
statusReason: expected { rule: { id: 'rule-1', …(6) }, …(2) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
services/enhanced-rule-validation/validators/typeMatch.ts:147:9
     }
 
     const matches = checkTypeActionMatch(rule.type, actionType);
-    if (!matches) {
+    if (false) {
       const ruleTypeName = getRuleTypeDisplayName(rule.type);
       const actionName = getActionTypeDisplayName(actionType);
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:147:9
     }
 
     const matches = checkTypeActionMatch(rule.type, actionType);
-    if (!matches) {
+    if (matches) {
       const ruleTypeName = getRuleTypeDisplayName(rule.type);
       const actionName = getActionTypeDisplayName(actionType);
killedBy: validateRuleTypeForAction returns mismatch result and executable suggested actions for non-matching type
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:160:12
       };
     }
 
-    return {
-      isValid: true,
-      debugInfo: { rule, actionType, match: true },
-    };
+    return {};
   } catch (error) {
     const isExpectedError = error instanceof ExceptionRuleException;
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected {} to deeply equal ObjectContaining{…}

[Killed] BooleanLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:161:16
     }
 
     return {
-      isValid: true,
+      isValid: false,
       debugInfo: { rule, actionType, match: true },
     };
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected { isValid: false, debugInfo: { …(3) } } to deeply equal ObjectContaining{…}

[Killed] BooleanLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:162:45
 
     return {
       isValid: true,
-      debugInfo: { rule, actionType, match: true },
+      debugInfo: { rule, actionType, match: false },
     };
   } catch (error) {
killedBy: validateRuleTypeForAction returns valid result when rule type matches action
statusReason: expected { isValid: true, debugInfo: { …(3) } } to deeply equal ObjectContaining{…}

[Killed] BlockStatement
services/enhanced-rule-validation/validators/typeMatch.ts:164:19
       isValid: true,
       debugInfo: { rule, actionType, match: true },
     };
-  } catch (error) {
-    const isExpectedError = error instanceof ExceptionRuleException;
-    ignoreUnused(isExpectedError);
-
-    return {
-      isValid: false,
-      errorType: ExceptionRuleError.VALIDATION_ERROR,
-      errorMessage: `验证过程中发生错误: ${getErrorMessage(error)}`,
-      debugInfo: { rule, actionType, error },
-    };
-  }
+  } catch (error) {}
 }
 
killedBy: validateRuleTypeForAction falls back to VALIDATION_ERROR when validation throws unexpectedly
statusReason: Cannot read properties of undefined (reading 'isValid')

[Killed] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:168:12
     const isExpectedError = error instanceof ExceptionRuleException;
     ignoreUnused(isExpectedError);
 
-    return {
-      isValid: false,
-      errorType: ExceptionRuleError.VALIDATION_ERROR,
-      errorMessage: `验证过程中发生错误: ${getErrorMessage(error)}`,
-      debugInfo: { rule, actionType, error },
-    };
+    return {};
   }
 }
killedBy: validateRuleTypeForAction falls back to VALIDATION_ERROR when validation throws unexpectedly
statusReason: expected undefined to be false // Object.is equality

[Survived] ObjectLiteral
services/enhanced-rule-validation/validators/typeMatch.ts:172:18
       isValid: false,
       errorType: ExceptionRuleError.VALIDATION_ERROR,
       errorMessage: `验证过程中发生错误: ${getErrorMessage(error)}`,
-      debugInfo: { rule, actionType, error },
+      debugInfo: {},
     };
   }
