[Killed] ArrayDeclaration
src/utils/chain-tree/treeBuilder.ts:11:28
 const validateChainData = (
   chains: Chain[],
 ): { isValid: boolean; errors: string[] } => {
-  const errors: string[] = [];
+  const errors: string[] = ["Stryker was here"];
   const ids = new Set<string>();
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:14:31
   const errors: string[] = [];
   const ids = new Set<string>();
 
-  for (const chain of chains) {
-    // Check for required fields
-    if (!chain.id) {
-      errors.push(`链条缺少ID: ${JSON.stringify(chain)}`);
-      continue;
-    }
-
-    if (!chain.name) {
-      errors.push(`链条 ${chain.id} 缺少名称`);
-    }
-
-    // Check for duplicate IDs
-    if (ids.has(chain.id)) {
-      errors.push(`重复的链条ID: ${chain.id}`);
-    }
-    ids.add(chain.id);
-
-    // Check for invalid parent references (will be handled in tree building)
-    if (chain.parentId === chain.id) {
-      errors.push(`链条 ${chain.id} (${chain.name}) 存在循环引用`);
-    }
-  }
+  for (const chain of chains) {}
 
   return { isValid: errors.length === 0, errors };
killedBy: chain-tree/treeBuilder logs data integrity warnings for duplicate ids and missing names
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:16:9
 
   for (const chain of chains) {
     // Check for required fields
-    if (!chain.id) {
+    if (false) {
       errors.push(`链条缺少ID: ${JSON.stringify(chain)}`);
       continue;
killedBy: chain-tree/treeBuilder skips malformed chains without ids while keeping valid entries
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:16:20
 
   for (const chain of chains) {
     // Check for required fields
-    if (!chain.id) {
-      errors.push(`链条缺少ID: ${JSON.stringify(chain)}`);
-      continue;
-    }
+    if (!chain.id) {}
 
     if (!chain.name) {
killedBy: chain-tree/treeBuilder skips malformed chains without ids while keeping valid entries
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:21:9
       continue;
     }
 
-    if (!chain.name) {
+    if (true) {
       errors.push(`链条 ${chain.id} 缺少名称`);
     }
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] BooleanLiteral
src/utils/chain-tree/treeBuilder.ts:21:9
       continue;
     }
 
-    if (!chain.name) {
+    if (chain.name) {
       errors.push(`链条 ${chain.id} 缺少名称`);
     }
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:26:9
     }
 
     // Check for duplicate IDs
-    if (ids.has(chain.id)) {
+    if (true) {
       errors.push(`重复的链条ID: ${chain.id}`);
     }
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Survived] BlockStatement
src/utils/chain-tree/treeBuilder.ts:26:28
     }
 
     // Check for duplicate IDs
-    if (ids.has(chain.id)) {
-      errors.push(`重复的链条ID: ${chain.id}`);
-    }
+    if (ids.has(chain.id)) {}
     ids.add(chain.id);
 

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:32:9
     ids.add(chain.id);
 
     // Check for invalid parent references (will be handled in tree building)
-    if (chain.parentId === chain.id) {
+    if (true) {
       errors.push(`链条 ${chain.id} (${chain.name}) 存在循环引用`);
     }
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] EqualityOperator
src/utils/chain-tree/treeBuilder.ts:32:9
     ids.add(chain.id);
 
     // Check for invalid parent references (will be handled in tree building)
-    if (chain.parentId === chain.id) {
+    if (chain.parentId !== chain.id) {
       errors.push(`链条 ${chain.id} (${chain.name}) 存在循环引用`);
     }
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] EqualityOperator
src/utils/chain-tree/treeBuilder.ts:37:21
     }
   }
 
-  return { isValid: errors.length === 0, errors };
+  return { isValid: errors.length !== 0, errors };
 };
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:37:21
     }
   }
 
-  return { isValid: errors.length === 0, errors };
+  return { isValid: false, errors };
 };
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:47:11
   return performanceLogger.time('buildChainTree', () => {
     try {
       // Validate input data
-      if (!Array.isArray(chains)) {
+      if (false) {
         performanceLogger.error('buildChainTree: 输入不是数组');
         return [];
killedBy: chain-tree/treeBuilder returns empty and logs error for non-array input
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/ ]

Received: 

  1st vi.fn() call:

  [
-   StringMatching /.+/,

[Killed] BooleanLiteral
src/utils/chain-tree/treeBuilder.ts:47:11
   return performanceLogger.time('buildChainTree', () => {
     try {
       // Validate input data
-      if (!Array.isArray(chains)) {
+      if (Array.isArray(chains)) {
         performanceLogger.error('buildChainTree: 输入不是数组');
         return [];
killedBy: chain-tree/treeBuilder returns empty and logs error for non-array input
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/ ]

Received: 

  1st vi.fn() call:

  [
-   StringMatching /.+/,

[Killed] ArrayDeclaration
src/utils/chain-tree/treeBuilder.ts:49:16
       // Validate input data
       if (!Array.isArray(chains)) {
         performanceLogger.error('buildChainTree: 输入不是数组');
-        return [];
+        return ["Stryker was here"];
       }
 
killedBy: chain-tree/treeBuilder returns empty and logs error for non-array input
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:52:11
         return [];
       }
 
-      if (chains.length === 0) {
+      if (true) {
         performanceLogger.debug('buildChainTree: 输入为空数组');
         return [];
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:52:11
         return [];
       }
 
-      if (chains.length === 0) {
+      if (false) {
         performanceLogger.debug('buildChainTree: 输入为空数组');
         return [];
killedBy: chain-tree/treeBuilder returns early for empty input and emits debug marker
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/ ]

Number of calls: 0

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:59:32
 
       // Validate chain data integrity
       const validation = validateChainData(chains);
-      if (!validation.isValid) {
-        performanceLogger.warn(
-          'buildChainTree: 数据完整性检查发现问题:',
-          validation.errors,
-        );
-        // Continue processing but log warnings
-      }
+      if (!validation.isValid) {}
 
       // 创建ID到节点的映射
killedBy: chain-tree/treeBuilder logs data integrity warnings for duplicate ids and missing names
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:59:11
 
       // Validate chain data integrity
       const validation = validateChainData(chains);
-      if (!validation.isValid) {
+      if (true) {
         performanceLogger.warn(
           'buildChainTree: 数据完整性检查发现问题:',
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 数据完整性检查发现问题:",

[Killed] StringLiteral
src/utils/chain-tree/treeBuilder.ts:61:11
       const validation = validateChainData(chains);
       if (!validation.isValid) {
         performanceLogger.warn(
-          'buildChainTree: 数据完整性检查发现问题:',
+          "",
           validation.errors,
         );
killedBy: chain-tree/treeBuilder logs data integrity warnings for duplicate ids and missing names
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringMatching /.+/,

[Survived] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:70:68
       // 创建ID到节点的映射
       const nodeMap = new Map<string, ChainTreeNode>();
 
-      performanceLogger.debugLazy('buildChainTree - input chains', () => ({
-        chainCount: chains.length,
-        chains: chains.map((c) => ({
-          id: c.id,
-          name: c.name,
-          parentId: c.parentId,
-          type: c.type,
-        })),
-      }));
+      performanceLogger.debugLazy('buildChainTree - input chains', () => undefined);
 
       // 修复循环引用和其他数据问题

[NoCoverage] ObjectLiteral
src/utils/chain-tree/treeBuilder.ts:70:75
       // 创建ID到节点的映射
       const nodeMap = new Map<string, ChainTreeNode>();
 
-      performanceLogger.debugLazy('buildChainTree - input chains', () => ({
-        chainCount: chains.length,
-        chains: chains.map((c) => ({
-          id: c.id,
-          name: c.name,
-          parentId: c.parentId,
-          type: c.type,
-        })),
-      }));
+      performanceLogger.debugLazy('buildChainTree - input chains', () => ({}));
 
       // 修复循环引用和其他数据问题

[NoCoverage] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:72:28
 
       performanceLogger.debugLazy('buildChainTree - input chains', () => ({
         chainCount: chains.length,
-        chains: chains.map((c) => ({
-          id: c.id,
-          name: c.name,
-          parentId: c.parentId,
-          type: c.type,
-        })),
+        chains: chains.map(() => undefined),
       }));
 

[Killed] MethodExpression
src/utils/chain-tree/treeBuilder.ts:81:29
       }));
 
       // 修复循环引用和其他数据问题
-      const cleanedChains = chains
-        .map((chain) => {
-          if (!chain.id) {
-            performanceLogger.error(`跳过无效链条（缺少ID）:`, chain);
-            return null;
-          }
-
-          if (chain.parentId === chain.id) {
-            performanceLogger.warn(
-              `修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`,
-            );
-            return { ...chain, parentId: undefined };
-          }
-
-          return chain;
-        })
-        .filter((chain): chain is Chain => chain !== null);
+      const cleanedChains = chains.map(chain => {
+  if (!chain.id) {
+    performanceLogger.error(`跳过无效链条（缺少ID）:`, chain);
+    return null;
+  }
+  if (chain.parentId === chain.id) {
+    performanceLogger.warn(`修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`);
+    return {
+      ...chain,
+      parentId: undefined
+    };
+  }
+  return chain;
+});
 
       // 初始化所有节点
killedBy: chain-tree/treeBuilder skips malformed chains without ids while keeping valid entries
statusReason: expected [] to deeply equal [ 'valid-id' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:82:25
 
       // 修复循环引用和其他数据问题
       const cleanedChains = chains
-        .map((chain) => {
-          if (!chain.id) {
-            performanceLogger.error(`跳过无效链条（缺少ID）:`, chain);
-            return null;
-          }
-
-          if (chain.parentId === chain.id) {
-            performanceLogger.warn(
-              `修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`,
-            );
-            return { ...chain, parentId: undefined };
-          }
-
-          return chain;
-        })
+        .map((chain) => {})
         .filter((chain): chain is Chain => chain !== null);
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:83:26
       // 修复循环引用和其他数据问题
       const cleanedChains = chains
         .map((chain) => {
-          if (!chain.id) {
-            performanceLogger.error(`跳过无效链条（缺少ID）:`, chain);
-            return null;
-          }
+          if (!chain.id) {}
 
           if (chain.parentId === chain.id) {
killedBy: chain-tree/treeBuilder skips malformed chains without ids while keeping valid entries
statusReason: expected [ 'valid-id', '' ] to deeply equal [ 'valid-id' ]

[Killed] BooleanLiteral
src/utils/chain-tree/treeBuilder.ts:83:15
       // 修复循环引用和其他数据问题
       const cleanedChains = chains
         .map((chain) => {
-          if (!chain.id) {
+          if (chain.id) {
             performanceLogger.error(`跳过无效链条（缺少ID）:`, chain);
             return null;
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:88:15
             return null;
           }
 
-          if (chain.parentId === chain.id) {
+          if (false) {
             performanceLogger.warn(
               `修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`,
killedBy: chain-tree/treeBuilder converts self-parent references to root nodes
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:88:15
             return null;
           }
 
-          if (chain.parentId === chain.id) {
+          if (true) {
             performanceLogger.warn(
               `修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`,
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'g-2', 'c-b', 'gc', 'g-1', 'c-a' ] to deeply equal [ 'g-2', 'g-1' ]

[Survived] StringLiteral
src/utils/chain-tree/treeBuilder.ts:90:15
 
           if (chain.parentId === chain.id) {
             performanceLogger.warn(
-              `修复循环引用: 链条 ${chain.name} (${chain.id}) 的父节点是自己，重置为根节点`,
+              ``,
             );
             return { ...chain, parentId: undefined };

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:97:44
 
           return chain;
         })
-        .filter((chain): chain is Chain => chain !== null);
+        .filter((chain): chain is Chain => true);
 
       // 初始化所有节点
killedBy: chain-tree/treeBuilder skips malformed chains without ids while keeping valid entries
statusReason: expected [] to deeply equal [ 'valid-id' ]

[Killed] EqualityOperator
src/utils/chain-tree/treeBuilder.ts:97:44
 
           return chain;
         })
-        .filter((chain): chain is Chain => chain !== null);
+        .filter((chain): chain is Chain => chain === null);
 
       // 初始化所有节点
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:100:40
         .filter((chain): chain is Chain => chain !== null);
 
       // 初始化所有节点
-      cleanedChains.forEach((chain) => {
-        nodeMap.set(chain.id, {
-          ...chain,
-          children: [],
-          depth: 0,
-        });
-      });
+      cleanedChains.forEach((chain) => {});
 
       const rootNodes: ChainTreeNode[] = [];
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ArrayDeclaration
src/utils/chain-tree/treeBuilder.ts:103:21
       cleanedChains.forEach((chain) => {
         nodeMap.set(chain.id, {
           ...chain,
-          children: [],
+          children: ["Stryker was here"],
           depth: 0,
         });
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ArrayDeclaration
src/utils/chain-tree/treeBuilder.ts:108:42
         });
       });
 
-      const rootNodes: ChainTreeNode[] = [];
+      const rootNodes: ChainTreeNode[] = ["Stryker was here"];
 
       // 构建树结构
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:111:40
       const rootNodes: ChainTreeNode[] = [];
 
       // 构建树结构
-      cleanedChains.forEach((chain) => {
-        const node = nodeMap.get(chain.id)!;
-
-        if (chain.parentId) {
-          const parent = nodeMap.get(chain.parentId);
-          if (parent) {
-            parent.children.push(node);
-            node.depth = parent.depth + 1;
-            performanceLogger.debug(
-              `节点 ${chain.name} 作为 ${parent.name} 的子节点`,
-            );
-          } else {
-            // 父节点不存在，作为根节点处理
-            performanceLogger.warn(
-              `父节点 ${chain.parentId} 不存在，节点 ${chain.name} (${chain.id}) 将作为根节点处理`,
-            );
-            // Reset parentId to undefined and add to rootNodes
-            node.parentId = undefined;
-            rootNodes.push(node);
-          }
-        } else {
-          performanceLogger.debug(`节点 ${chain.name} 是根节点`);
-          rootNodes.push(node);
-        }
-      });
+      cleanedChains.forEach((chain) => {});
 
       // 对每个节点的子节点按 sortOrder 排序
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:114:13
       cleanedChains.forEach((chain) => {
         const node = nodeMap.get(chain.id)!;
 
-        if (chain.parentId) {
+        if (true) {
           const parent = nodeMap.get(chain.parentId);
           if (parent) {
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received: 

  1st vi.fn() call:

    Array [
      "父节点 undefined 不存在，节点 Group Chain (g-1) 将作为根节点处理",

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:114:13
       cleanedChains.forEach((chain) => {
         const node = nodeMap.get(chain.id)!;
 
-        if (chain.parentId) {
+        if (false) {
           const parent = nodeMap.get(chain.parentId);
           if (parent) {
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'g-2', 'c-b', 'gc', 'g-1', 'c-a' ] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:116:15
 
         if (chain.parentId) {
           const parent = nodeMap.get(chain.parentId);
-          if (parent) {
+          if (false) {
             parent.children.push(node);
             node.depth = parent.depth + 1;
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'g-2', 'c-b', 'gc', 'g-1', 'c-a' ] to deeply equal [ 'g-2', 'g-1' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:116:23
 
         if (chain.parentId) {
           const parent = nodeMap.get(chain.parentId);
-          if (parent) {
-            parent.children.push(node);
-            node.depth = parent.depth + 1;
-            performanceLogger.debug(
-              `节点 ${chain.name} 作为 ${parent.name} 的子节点`,
-            );
-          } else {
+          if (parent) {} else {
             // 父节点不存在，作为根节点处理
             performanceLogger.warn(
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'c-b', 'c-a' ]

[Killed] ArithmeticOperator
src/utils/chain-tree/treeBuilder.ts:118:26
           const parent = nodeMap.get(chain.parentId);
           if (parent) {
             parent.children.push(node);
-            node.depth = parent.depth + 1;
+            node.depth = parent.depth - 1;
             performanceLogger.debug(
               `节点 ${chain.name} 作为 ${parent.name} 的子节点`,
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected -1 to be 1 // Object.is equality

[Survived] StringLiteral
src/utils/chain-tree/treeBuilder.ts:120:15
             parent.children.push(node);
             node.depth = parent.depth + 1;
             performanceLogger.debug(
-              `节点 ${chain.name} 作为 ${parent.name} 的子节点`,
+              ``,
             );
           } else {

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:122:18
             performanceLogger.debug(
               `节点 ${chain.name} 作为 ${parent.name} 的子节点`,
             );
-          } else {
-            // 父节点不存在，作为根节点处理
-            performanceLogger.warn(
-              `父节点 ${chain.parentId} 不存在，节点 ${chain.name} (${chain.id}) 将作为根节点处理`,
-            );
-            // Reset parentId to undefined and add to rootNodes
-            node.parentId = undefined;
-            rootNodes.push(node);
-          }
+          } else {}
         } else {
           performanceLogger.debug(`节点 ${chain.name} 是根节点`);
killedBy: chain-tree/treeBuilder promotes nodes with missing parents to roots
statusReason: expected [ 'root' ] to deeply equal [ 'root', 'orphan' ]

[Survived] StringLiteral
src/utils/chain-tree/treeBuilder.ts:125:15
           } else {
             // 父节点不存在，作为根节点处理
             performanceLogger.warn(
-              `父节点 ${chain.parentId} 不存在，节点 ${chain.name} (${chain.id}) 将作为根节点处理`,
+              ``,
             );
             // Reset parentId to undefined and add to rootNodes

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:131:16
             node.parentId = undefined;
             rootNodes.push(node);
           }
-        } else {
-          performanceLogger.debug(`节点 ${chain.name} 是根节点`);
-          rootNodes.push(node);
-        }
+        } else {}
       });
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [] to deeply equal [ 'g-2', 'g-1' ]

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:138:53
       });
 
       // 对每个节点的子节点按 sortOrder 排序
-      const sortChildren = (node: ChainTreeNode) => {
-        node.children.sort((a, b) => a.sortOrder - b.sortOrder);
-        node.children.forEach(sortChildren);
-      };
+      const sortChildren = (node: ChainTreeNode) => {};
 
       rootNodes.forEach(sortChildren);
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'c-a', 'c-b' ] to deeply equal [ 'c-b', 'c-a' ]

[Killed] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:139:28
 
       // 对每个节点的子节点按 sortOrder 排序
       const sortChildren = (node: ChainTreeNode) => {
-        node.children.sort((a, b) => a.sortOrder - b.sortOrder);
+        node.children.sort(() => undefined);
         node.children.forEach(sortChildren);
       };
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'c-a', 'c-b' ] to deeply equal [ 'c-b', 'c-a' ]

[Killed] ArithmeticOperator
src/utils/chain-tree/treeBuilder.ts:139:38
 
       // 对每个节点的子节点按 sortOrder 排序
       const sortChildren = (node: ChainTreeNode) => {
-        node.children.sort((a, b) => a.sortOrder - b.sortOrder);
+        node.children.sort((a, b) => a.sortOrder + b.sortOrder);
         node.children.forEach(sortChildren);
       };
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'c-a', 'c-b' ] to deeply equal [ 'c-b', 'c-a' ]

[Killed] MethodExpression
src/utils/chain-tree/treeBuilder.ts:146:7
       rootNodes.forEach(sortChildren);
 
       // 对根节点也进行排序
-      rootNodes.sort((a, b) => a.sortOrder - b.sortOrder);
+      rootNodes;
 
       if (isDev) {
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'g-1', 'g-2' ] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ArithmeticOperator
src/utils/chain-tree/treeBuilder.ts:146:32
       rootNodes.forEach(sortChildren);
 
       // 对根节点也进行排序
-      rootNodes.sort((a, b) => a.sortOrder - b.sortOrder);
+      rootNodes.sort((a, b) => a.sortOrder + b.sortOrder);
 
       if (isDev) {
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected [ 'g-1', 'g-2' ] to deeply equal [ 'g-2', 'g-1' ]

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:148:11
       // 对根节点也进行排序
       rootNodes.sort((a, b) => a.sortOrder - b.sortOrder);
 
-      if (isDev) {
+      if (true) {
         performanceLogger.debugLazy(
           'buildChainTree - root nodes built',
killedBy: chain-tree/treeBuilder emits extra dev diagnostics only when isDev is true
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/utils/chain-tree/treeBuilder.ts:148:11
       // 对根节点也进行排序
       rootNodes.sort((a, b) => a.sortOrder - b.sortOrder);
 
-      if (isDev) {
+      if (false) {
         performanceLogger.debugLazy(
           'buildChainTree - root nodes built',
killedBy: chain-tree/treeBuilder emits extra dev diagnostics only when isDev is true
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] StringLiteral
src/utils/chain-tree/treeBuilder.ts:150:11
 
       if (isDev) {
         performanceLogger.debugLazy(
-          'buildChainTree - root nodes built',
+          "",
           () => ({
             rootNodeCount: rootNodes.length,

[Survived] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:151:11
       if (isDev) {
         performanceLogger.debugLazy(
           'buildChainTree - root nodes built',
-          () => ({
-            rootNodeCount: rootNodes.length,
-            roots: rootNodes.map((r) => ({
-              id: r.id,
-              name: r.name,
-              childrenCount: r.children.length,
-            })),
-          }),
+          () => undefined,
         );
       }

[NoCoverage] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:153:34
           'buildChainTree - root nodes built',
           () => ({
             rootNodeCount: rootNodes.length,
-            roots: rootNodes.map((r) => ({
-              id: r.id,
-              name: r.name,
-              childrenCount: r.children.length,
-            })),
+            roots: rootNodes.map(() => undefined),
           }),
         );

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:164:54
 
       // Final validation - ensure all input chains are represented in the tree
       const treeNodeIds = new Set<string>();
-      const collectIds = (nodes: ChainTreeNode[]) => {
-        nodes.forEach((node) => {
-          treeNodeIds.add(node.id);
-          collectIds(node.children);
-        });
-      };
+      const collectIds = (nodes: ChainTreeNode[]) => {};
       collectIds(rootNodes);
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 以下链条在树中丢失:",

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:165:33
       // Final validation - ensure all input chains are represented in the tree
       const treeNodeIds = new Set<string>();
       const collectIds = (nodes: ChainTreeNode[]) => {
-        nodes.forEach((node) => {
-          treeNodeIds.add(node.id);
-          collectIds(node.children);
-        });
+        nodes.forEach((node) => {});
       };
       collectIds(rootNodes);
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 以下链条在树中丢失:",
