[Killed] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:172:50
       };
       collectIds(rootNodes);
 
-      const inputIds = new Set(cleanedChains.map((c) => c.id));
+      const inputIds = new Set(cleanedChains.map(() => undefined));
       const missingIds = [...inputIds].filter((id) => !treeNodeIds.has(id));
 
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 以下链条在树中丢失:",

[Killed] BooleanLiteral
src/utils/chain-tree/treeBuilder.ts:173:55
       collectIds(rootNodes);
 
       const inputIds = new Set(cleanedChains.map((c) => c.id));
-      const missingIds = [...inputIds].filter((id) => !treeNodeIds.has(id));
+      const missingIds = [...inputIds].filter((id) => treeNodeIds.has(id));
 
       if (missingIds.length > 0) {
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 以下链条在树中丢失:",

[Killed] ArrowFunction
src/utils/chain-tree/treeBuilder.ts:173:47
       collectIds(rootNodes);
 
       const inputIds = new Set(cleanedChains.map((c) => c.id));
-      const missingIds = [...inputIds].filter((id) => !treeNodeIds.has(id));
+      const missingIds = [...inputIds].filter(() => undefined);
 
       if (missingIds.length > 0) {
killedBy: chain-tree/treeBuilder logs missing-node errors for two-node circular references
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/chain-tree/treeBuilder.ts:175:34
       const inputIds = new Set(cleanedChains.map((c) => c.id));
       const missingIds = [...inputIds].filter((id) => !treeNodeIds.has(id));
 
-      if (missingIds.length > 0) {
-        performanceLogger.error(
-          'buildChainTree: 以下链条在树中丢失:',
-          missingIds,
-        );
-      }
+      if (missingIds.length > 0) {}
 
       return rootNodes;
killedBy: chain-tree/treeBuilder logs missing-node errors for two-node circular references
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /.+/, …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/utils/chain-tree/treeBuilder.ts:175:11
       const inputIds = new Set(cleanedChains.map((c) => c.id));
       const missingIds = [...inputIds].filter((id) => !treeNodeIds.has(id));
 
-      if (missingIds.length > 0) {
+      if (missingIds.length <= 0) {
         performanceLogger.error(
           'buildChainTree: 以下链条在树中丢失:',
killedBy: chain-tree/treeBuilder builds sorted tree structure with correct depth propagation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "buildChainTree: 以下链条在树中丢失:",

[NoCoverage] BlockStatement
src/utils/chain-tree/treeBuilder.ts:183:21
       }
 
       return rootNodes;
-    } catch (error) {
-      performanceLogger.error('buildChainTree: 构建树时发生错误:', error);
-      // Return empty array to prevent app crash
-      return [];
-    }
+    } catch (error) {}
   }); // End performanceLogger.time
 };
