[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:5:75
 import { LOCAL_STORAGE_KEYS } from './keys';
 import type { TimerPersistData } from './types';
 
-export function getTimerState(sessionId: string): TimerPersistData | null {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    const stored = localStorage.getItem(key);
-    if (!stored) return null;
-    return JSON.parse(stored) as TimerPersistData;
-  } catch {
-    return null;
-  }
-}
+export function getTimerState(sessionId: string): TimerPersistData | null {}
 
 export function setTimerState(sessionId: string, data: TimerPersistData): void {
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected undefined to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:6:7
 import type { TimerPersistData } from './types';
 
 export function getTimerState(sessionId: string): TimerPersistData | null {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    const stored = localStorage.getItem(key);
-    if (!stored) return null;
-    return JSON.parse(stored) as TimerPersistData;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected undefined to be null

[Killed] BooleanLiteral
src/utils/local-preferences/timerState.ts:9:9
   try {
     const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
     const stored = localStorage.getItem(key);
-    if (!stored) return null;
+    if (stored) return null;
     return JSON.parse(stored) as TimerPersistData;
   } catch {
killedBy: ForwardTimerManager 持久化功能 应该能够恢复计时器状态
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:9:9
   try {
     const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
     const stored = localStorage.getItem(key);
-    if (!stored) return null;
+    if (true) return null;
     return JSON.parse(stored) as TimerPersistData;
   } catch {
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected null to deeply equal { sessionId: 'session-1', …(5) }

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:11:11
     const stored = localStorage.getItem(key);
     if (!stored) return null;
     return JSON.parse(stored) as TimerPersistData;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: local-preferences/timerState returns safe fallbacks and logs warnings when storage operations throw
statusReason: expected undefined to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:16:80
   }
 }
 
-export function setTimerState(sessionId: string, data: TimerPersistData): void {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    localStorage.setItem(key, JSON.stringify(data));
-  } catch (error) {
-    const err = error instanceof Error ? error : new Error(String(error));
-    logger.warn(
-      'LOCAL_PREFERENCES',
-      'Failed to persist timer state',
-      { sessionId },
-      err,
-    );
-  }
-}
+export function setTimerState(sessionId: string, data: TimerPersistData): void {}
 
 export function clearTimerState(sessionId: string): void {
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected null to deeply equal { sessionId: 'session-1', …(5) }

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:17:7
 }
 
 export function setTimerState(sessionId: string, data: TimerPersistData): void {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    localStorage.setItem(key, JSON.stringify(data));
-  } catch (error) {
+  try {} catch (error) {
     const err = error instanceof Error ? error : new Error(String(error));
     logger.warn(
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected null to deeply equal { sessionId: 'session-1', …(5) }

[Killed] StringLiteral
src/utils/local-preferences/timerState.ts:18:17
 
 export function setTimerState(sessionId: string, data: TimerPersistData): void {
   try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
+    const key = ``;
     localStorage.setItem(key, JSON.stringify(data));
   } catch (error) {
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected null to deeply equal { sessionId: 'session-1', …(5) }

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:20:19
   try {
     const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
     localStorage.setItem(key, JSON.stringify(data));
-  } catch (error) {
-    const err = error instanceof Error ? error : new Error(String(error));
-    logger.warn(
-      'LOCAL_PREFERENCES',
-      'Failed to persist timer state',
-      { sessionId },
-      err,
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: local-preferences/timerState returns safe fallbacks and logs warnings when storage operations throw
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:31:58
   }
 }
 
-export function clearTimerState(sessionId: string): void {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    localStorage.removeItem(key);
-  } catch (error) {
-    const err = error instanceof Error ? error : new Error(String(error));
-    logger.warn(
-      'LOCAL_PREFERENCES',
-      'Failed to remove timer state',
-      { sessionId },
-      err,
-    );
-  }
-}
+export function clearTimerState(sessionId: string): void {}
 
 export function getAllTimerKeys(): string[] {
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected { sessionId: 'session-1', …(5) } to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:32:7
 }
 
 export function clearTimerState(sessionId: string): void {
-  try {
-    const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
-    localStorage.removeItem(key);
-  } catch (error) {
+  try {} catch (error) {
     const err = error instanceof Error ? error : new Error(String(error));
     logger.warn(
killedBy: local-preferences/timerState gets, sets and clears timer state by session id
statusReason: expected { sessionId: 'session-1', …(5) } to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:35:19
   try {
     const key = `${LOCAL_STORAGE_KEYS.TIMER_PREFIX}${sessionId}`;
     localStorage.removeItem(key);
-  } catch (error) {
-    const err = error instanceof Error ? error : new Error(String(error));
-    logger.warn(
-      'LOCAL_PREFERENCES',
-      'Failed to remove timer state',
-      { sessionId },
-      err,
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: local-preferences/timerState returns safe fallbacks and logs warnings when storage operations throw
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] StringLiteral
src/utils/local-preferences/timerState.ts:38:7
   } catch (error) {
     const err = error instanceof Error ? error : new Error(String(error));
     logger.warn(
-      'LOCAL_PREFERENCES',
+      "",
       'Failed to remove timer state',
       { sessionId },
killedBy: local-preferences/timerState returns safe fallbacks and logs warnings when storage operations throw
statusReason: expected [ '', …(3) ] to deeply equal [ 'LOCAL_PREFERENCES', …(3) ]

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:53:7
     const storageLike = storage as Partial<Storage>;
 
     if (
-      typeof storageLike.length === 'number' &&
-      typeof storageLike.key === 'function'
+      false
     ) {
       for (let i = 0; i < storageLike.length; i++) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:53:7
     const storageLike = storage as Partial<Storage>;
 
     if (
-      typeof storageLike.length === 'number' &&
-      typeof storageLike.key === 'function'
+      true
     ) {
       for (let i = 0; i < storageLike.length; i++) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] EqualityOperator
src/utils/local-preferences/timerState.ts:54:7
 
     if (
       typeof storageLike.length === 'number' &&
-      typeof storageLike.key === 'function'
+      typeof storageLike.key !== 'function'
     ) {
       for (let i = 0; i < storageLike.length; i++) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:54:7
 
     if (
       typeof storageLike.length === 'number' &&
-      typeof storageLike.key === 'function'
+      true
     ) {
       for (let i = 0; i < storageLike.length; i++) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:55:7
     if (
       typeof storageLike.length === 'number' &&
       typeof storageLike.key === 'function'
-    ) {
-      for (let i = 0; i < storageLike.length; i++) {
-        const key = storageLike.key(i);
-        if (key && key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
-          keys.push(key);
-        }
-      }
-    } else if (storage && typeof storage === 'object') {
+    ) {} else if (storage && typeof storage === 'object') {
       const allKeys = Object.keys(storage as Record<string, unknown>);
       keys.push(
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:56:23
       typeof storageLike.length === 'number' &&
       typeof storageLike.key === 'function'
     ) {
-      for (let i = 0; i < storageLike.length; i++) {
+      for (let i = 0; false; i++) {
         const key = storageLike.key(i);
         if (key && key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] EqualityOperator
src/utils/local-preferences/timerState.ts:56:23
       typeof storageLike.length === 'number' &&
       typeof storageLike.key === 'function'
     ) {
-      for (let i = 0; i < storageLike.length; i++) {
+      for (let i = 0; i >= storageLike.length; i++) {
         const key = storageLike.key(i);
         if (key && key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] MethodExpression
src/utils/local-preferences/timerState.ts:58:20
     ) {
       for (let i = 0; i < storageLike.length; i++) {
         const key = storageLike.key(i);
-        if (key && key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
+        if (key && key.endsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
           keys.push(key);
         }
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] LogicalOperator
src/utils/local-preferences/timerState.ts:58:13
     ) {
       for (let i = 0; i < storageLike.length; i++) {
         const key = storageLike.key(i);
-        if (key && key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
+        if (key || key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX)) {
           keys.push(key);
         }
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [ 'momentum_timer_session-3', …(1) ] to deeply equal [ 'momentum_timer_session-3' ]

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:62:56
           keys.push(key);
         }
       }
-    } else if (storage && typeof storage === 'object') {
-      const allKeys = Object.keys(storage as Record<string, unknown>);
-      keys.push(
-        ...allKeys.filter((key) =>
-          key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX),
-        ),
-      );
-    }
+    } else if (storage && typeof storage === 'object') {}
 
     return keys;
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] EqualityOperator
src/utils/local-preferences/timerState.ts:62:27
           keys.push(key);
         }
       }
-    } else if (storage && typeof storage === 'object') {
+    } else if (storage && typeof storage !== 'object') {
       const allKeys = Object.keys(storage as Record<string, unknown>);
       keys.push(
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] ArrowFunction
src/utils/local-preferences/timerState.ts:65:27
     } else if (storage && typeof storage === 'object') {
       const allKeys = Object.keys(storage as Record<string, unknown>);
       keys.push(
-        ...allKeys.filter((key) =>
-          key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX),
+        ...allKeys.filter(() => undefined,
         ),
       );
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] MethodExpression
src/utils/local-preferences/timerState.ts:65:12
     } else if (storage && typeof storage === 'object') {
       const allKeys = Object.keys(storage as Record<string, unknown>);
       keys.push(
-        ...allKeys.filter((key) =>
-          key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX),
-        ),
+        ...allKeys,
       );
     }
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [ 'length', 'momentum_timer_a', …(2) ] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] MethodExpression
src/utils/local-preferences/timerState.ts:66:11
       const allKeys = Object.keys(storage as Record<string, unknown>);
       keys.push(
         ...allKeys.filter((key) =>
-          key.startsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX),
+          key.endsWith(LOCAL_STORAGE_KEYS.TIMER_PREFIX),
         ),
       );
killedBy: local-preferences/timerState collects timer keys via standard storage API and object fallback
statusReason: expected [] to deeply equal [ 'momentum_timer_a', …(1) ]

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:72:11
     }
 
     return keys;
-  } catch {
-    return [];
-  }
+  } catch {}
 }
 
killedBy: local-preferences/timerState returns [] when collecting timer keys throws
statusReason: expected undefined to deeply equal []

[NoCoverage] ArithmeticOperator
src/utils/local-preferences/timerState.ts:78:22
 }
 
 export function cleanupExpiredTimers(
-  maxAgeMs: number = 24 * 60 * 60 * 1000,
+  maxAgeMs: number = 24 * 60 * 60 / 1000,
 ): void {
   try {

[NoCoverage] ArithmeticOperator
src/utils/local-preferences/timerState.ts:78:22
 }
 
 export function cleanupExpiredTimers(
-  maxAgeMs: number = 24 * 60 * 60 * 1000,
+  maxAgeMs: number = 24 / 60 * 60 * 1000,
 ): void {
   try {

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:80:7
 export function cleanupExpiredTimers(
   maxAgeMs: number = 24 * 60 * 60 * 1000,
 ): void {
-  try {
-    const keys = getAllTimerKeys();
-    const now = Date.now();
-
-    keys.forEach((key) => {
-      try {
-        const dataStr = localStorage.getItem(key);
-        if (dataStr) {
-          const data = JSON.parse(dataStr) as TimerPersistData;
-          if (now - data.timestamp > maxAgeMs) {
-            localStorage.removeItem(key);
-          }
-        }
-      } catch {
-        localStorage.removeItem(key);
-      }
-    });
-  } catch (error) {
+  try {} catch (error) {
     const err = error instanceof Error ? error : new Error(String(error));
     logger.warn(
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected '{"sessionId":"expired","startTime":1,…' to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:84:27
     const keys = getAllTimerKeys();
     const now = Date.now();
 
-    keys.forEach((key) => {
-      try {
-        const dataStr = localStorage.getItem(key);
-        if (dataStr) {
-          const data = JSON.parse(dataStr) as TimerPersistData;
-          if (now - data.timestamp > maxAgeMs) {
-            localStorage.removeItem(key);
-          }
-        }
-      } catch {
-        localStorage.removeItem(key);
-      }
-    });
+    keys.forEach((key) => {});
   } catch (error) {
     const err = error instanceof Error ? error : new Error(String(error));
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected '{"sessionId":"expired","startTime":1,…' to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:85:11
     const now = Date.now();
 
     keys.forEach((key) => {
-      try {
-        const dataStr = localStorage.getItem(key);
-        if (dataStr) {
-          const data = JSON.parse(dataStr) as TimerPersistData;
-          if (now - data.timestamp > maxAgeMs) {
-            localStorage.removeItem(key);
-          }
-        }
-      } catch {
+      try {} catch {
         localStorage.removeItem(key);
       }
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected '{"sessionId":"expired","startTime":1,…' to be null

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:87:13
     keys.forEach((key) => {
       try {
         const dataStr = localStorage.getItem(key);
-        if (dataStr) {
+        if (true) {
           const data = JSON.parse(dataStr) as TimerPersistData;
           if (now - data.timestamp > maxAgeMs) {
killedBy: local-preferences/timerState keeps non-expired boundary timers and empty payload entries
statusReason: expected null to be '' // Object.is equality

[Killed] ConditionalExpression
src/utils/local-preferences/timerState.ts:87:13
     keys.forEach((key) => {
       try {
         const dataStr = localStorage.getItem(key);
-        if (dataStr) {
+        if (false) {
           const data = JSON.parse(dataStr) as TimerPersistData;
           if (now - data.timestamp > maxAgeMs) {
killedBy: ForwardTimerManager 持久化功能 应该能够清理过期的持久化数据
statusReason: expected "vi.fn()" to be called with arguments: [ 'momentum_timer_session1' ]

Number of calls: 0

[Killed] EqualityOperator
src/utils/local-preferences/timerState.ts:89:15
         const dataStr = localStorage.getItem(key);
         if (dataStr) {
           const data = JSON.parse(dataStr) as TimerPersistData;
-          if (now - data.timestamp > maxAgeMs) {
+          if (now - data.timestamp <= maxAgeMs) {
             localStorage.removeItem(key);
           }
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected null not to be null

[Killed] ArithmeticOperator
src/utils/local-preferences/timerState.ts:89:15
         const dataStr = localStorage.getItem(key);
         if (dataStr) {
           const data = JSON.parse(dataStr) as TimerPersistData;
-          if (now - data.timestamp > maxAgeMs) {
+          if (now + data.timestamp > maxAgeMs) {
             localStorage.removeItem(key);
           }
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected null not to be null

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:93:15
             localStorage.removeItem(key);
           }
         }
-      } catch {
-        localStorage.removeItem(key);
-      }
+      } catch {}
     });
   } catch (error) {
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected "vi.fn()" to be called with arguments: [ 'LOCAL_PREFERENCES', …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/local-preferences/timerState.ts:97:19
         localStorage.removeItem(key);
       }
     });
-  } catch (error) {
-    const err = error instanceof Error ? error : new Error(String(error));
-    logger.warn(
-      'LOCAL_PREFERENCES',
-      'Failed to cleanup expired timers',
-      undefined,
-      err,
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected "vi.fn()" to be called with arguments: [ 'LOCAL_PREFERENCES', …(3) ]

Number of calls: 0

[Killed] StringLiteral
src/utils/local-preferences/timerState.ts:101:7
     const err = error instanceof Error ? error : new Error(String(error));
     logger.warn(
       'LOCAL_PREFERENCES',
-      'Failed to cleanup expired timers',
+      "",
       undefined,
       err,
killedBy: local-preferences/timerState cleans up expired or malformed timer entries and logs outer cleanup errors
statusReason: expected "vi.fn()" to be called with arguments: [ 'LOCAL_PREFERENCES', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "LOCAL_PREFERENCES",
