[Killed] BlockStatement
src/domain/result.ts:7:52
   return { ok: true, value };
 }
 
-export function err<E>(error: E): Result<never, E> {
-  return { ok: false, error };
-}
+export function err<E>(error: E): Result<never, E> {}
 
killedBy: useImportExportDomain should warn and wait for authentication when initial auth check fails with error
statusReason: expected [Function] to throw error including 'Authentication failed during import' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/domain/result.ts:8:16
 }
 
 export function err<E>(error: E): Result<never, E> {
-  return { ok: false, error };
+  return { ok: true, error };
 }
 
killedBy: useImportExportDomain should warn and wait for authentication when initial auth check fails with error
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT', …(2) ]

Number of calls: 0
