[Killed] BlockStatement
hooks/domains/sessions/start.ts:42:19
   chainId: string;
   chain: Chain;
   bettingSessionId: string | null;
-}): ActiveSession {
-  return {
-    ...(params.bettingSessionId ? { id: params.bettingSessionId } : {}),
-    chainId: params.chainId,
-    startedAt: new Date(),
-    duration: params.chain.isDurationless ? 0 : params.chain.duration,
-    isPaused: false,
-    totalPausedTime: 0,
-  };
-}
+}): ActiveSession {}
 
 export function createStartChainHandler({
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected undefined to match object { chainId: 'unit-1', …(3) }

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:48:15
     chainId: params.chainId,
     startedAt: new Date(),
     duration: params.chain.isDurationless ? 0 : params.chain.duration,
-    isPaused: false,
+    isPaused: true,
     totalPausedTime: 0,
   };
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected { chainId: 'unit-1', …(4) } to match object { chainId: 'unit-1', …(3) }
(1 matching property omitted from actual)

[Killed] BlockStatement
hooks/domains/sessions/start.ts:66:67
   onRsipTaskEvent,
   tr,
 }: CreateStartChainHandlerParams) {
-  function emitRsipTaskEvent(payload: RSIPTaskEventPayload): void {
-    if (!onRsipTaskEvent) return;
-    Promise.resolve(onRsipTaskEvent(payload)).catch((error) => {
-      logger.warn(
-        'SESSIONS',
-        'RSIP integration event handler failed',
-        { ...payload },
-        normalizeUnknownError(error),
-      );
-    });
-  }
+  function emitRsipTaskEvent(payload: RSIPTaskEventPayload): void {}
 
   function findChain(chainId: string): Chain | null {
killedBy: createStartChainHandler should emit exact group cycle payload and warn when RSIP task event handler rejects
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:67:9
   tr,
 }: CreateStartChainHandlerParams) {
   function emitRsipTaskEvent(payload: RSIPTaskEventPayload): void {
-    if (!onRsipTaskEvent) return;
+    if (true) return;
     Promise.resolve(onRsipTaskEvent(payload)).catch((error) => {
       logger.warn(
killedBy: createStartChainHandler should emit exact group cycle payload and warn when RSIP task event handler rejects
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
hooks/domains/sessions/start.ts:72:9
       logger.warn(
         'SESSIONS',
         'RSIP integration event handler failed',
-        { ...payload },
+        {},
         normalizeUnknownError(error),
       );
killedBy: createStartChainHandler should emit exact group cycle payload and warn when RSIP task event handler rejects
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "SESSIONS",

[Killed] BlockStatement
hooks/domains/sessions/start.ts:78:53
     });
   }
 
-  function findChain(chainId: string): Chain | null {
-    return state.chains.find((chain) => chain.id === chainId) ?? null;
-  }
+  function findChain(chainId: string): Chain | null {}
 
   function findScheduledSession(chainId: string): ScheduledSession | null {
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
hooks/domains/sessions/start.ts:79:12
   }
 
   function findChain(chainId: string): Chain | null {
-    return state.chains.find((chain) => chain.id === chainId) ?? null;
+    return state.chains.find(chain => chain.id === chainId) && null;
   }
 
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:79:41
   }
 
   function findChain(chainId: string): Chain | null {
-    return state.chains.find((chain) => chain.id === chainId) ?? null;
+    return state.chains.find((chain) => chain.id !== chainId) ?? null;
   }
 
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
hooks/domains/sessions/start.ts:82:75
     return state.chains.find((chain) => chain.id === chainId) ?? null;
   }
 
-  function findScheduledSession(chainId: string): ScheduledSession | null {
-    return (
-      state.scheduledSessions.find((session) => session.chainId === chainId) ??
-      null
-    );
-  }
+  function findScheduledSession(chainId: string): ScheduledSession | null {}
 
   function persistScheduledSessions(
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:84:49
 
   function findScheduledSession(chainId: string): ScheduledSession | null {
     return (
-      state.scheduledSessions.find((session) => session.chainId === chainId) ??
+      state.scheduledSessions.find((session) => false) ??
       null
     );
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
hooks/domains/sessions/start.ts:84:7
 
   function findScheduledSession(chainId: string): ScheduledSession | null {
     return (
-      state.scheduledSessions.find((session) => session.chainId === chainId) ??
-      null
+      state.scheduledSessions.find(session => session.chainId === chainId) && null
     );
   }
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
hooks/domains/sessions/start.ts:92:11
   function persistScheduledSessions(
     chainId: string,
     scheduledSessions: AppState['scheduledSessions'],
-  ): void {
-    storage.saveScheduledSessions(scheduledSessions).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist scheduled sessions',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-    });
-  }
+  ): void {}
 
   function persistActiveSession(chainId: string, session: ActiveSession): void {
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:93:71
     chainId: string,
     scheduledSessions: AppState['scheduledSessions'],
   ): void {
-    storage.saveScheduledSessions(scheduledSessions).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist scheduled sessions',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-    });
+    storage.saveScheduledSessions(scheduledSessions).catch((error) => {});
   }
 
killedBy: createStartChainHandler should log when scheduled sessions persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Number of calls: 0

[Killed] ObjectLiteral
hooks/domains/sessions/start.ts:97:9
       logger.error(
         'SESSIONS',
         'Failed to persist scheduled sessions',
-        { chainId },
+        {},
         normalizeUnknownError(error),
       );
killedBy: createStartChainHandler should log when scheduled sessions persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "SESSIONS",

[Killed] BlockStatement
hooks/domains/sessions/start.ts:103:80
     });
   }
 
-  function persistActiveSession(chainId: string, session: ActiveSession): void {
-    storage.saveActiveSession(session).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist active session',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-      toast.error(
-        tr(
-          '无法保存任务会话：数据库可能处于只读状态或写入被拒绝（查看控制台）',
-          'Failed to persist session: database may be read-only or write is denied (check console).',
-        ),
-      );
-    });
-  }
+  function persistActiveSession(chainId: string, session: ActiveSession): void {}
 
   function persistChains(chainId: string, chains: AppState['chains']): void {
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
hooks/domains/sessions/start.ts:104:57
   }
 
   function persistActiveSession(chainId: string, session: ActiveSession): void {
-    storage.saveActiveSession(session).catch((error) => {
-      logger.error(
-        'SESSIONS',
-        'Failed to persist active session',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-      toast.error(
-        tr(
-          '无法保存任务会话：数据库可能处于只读状态或写入被拒绝（查看控制台）',
-          'Failed to persist session: database may be read-only or write is denied (check console).',
-        ),
-      );
-    });
+    storage.saveActiveSession(session).catch((error) => {});
   }
 
killedBy: createStartChainHandler should show toast and log when active session persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:120:77
     });
   }
 
-  function persistChains(chainId: string, chains: AppState['chains']): void {
-    safelySaveChains(chains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
-      logger.error(
-        'SESSIONS',
-        '开始任务时保存链条数据失败',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-    });
-  }
+  function persistChains(chainId: string, chains: AppState['chains']): void {}
 
   async function maybeStartBettingSession(chainId: string): Promise<boolean> {
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
hooks/domains/sessions/start.ts:121:47
   }
 
   function persistChains(chainId: string, chains: AppState['chains']): void {
-    safelySaveChains(chains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
-      logger.error(
-        'SESSIONS',
-        '开始任务时保存链条数据失败',
-        { chainId },
-        normalizeUnknownError(error),
-      );
-    });
+    safelySaveChains(chains).catch((error) => {});
   }
 
killedBy: createStartChainHandler should log and continue when chains persistence fails after consuming a schedule
statusReason: expected "vi.fn()" to be called with arguments: [ 'chains' ]

Number of calls: 0

[Killed] StringLiteral
hooks/domains/sessions/start.ts:122:35
 
   function persistChains(chainId: string, chains: AppState['chains']): void {
     safelySaveChains(chains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
+      queryOptimizer.onDataChange("");
       logger.error(
         'SESSIONS',
killedBy: createStartChainHandler should log and continue when chains persistence fails after consuming a schedule
statusReason: expected "vi.fn()" to be called with arguments: [ 'chains' ]

Received: 

  1st vi.fn() call:

  [
-   "chains",

[Survived] StringLiteral
hooks/domains/sessions/start.ts:125:9
       queryOptimizer.onDataChange('chains');
       logger.error(
         'SESSIONS',
-        '开始任务时保存链条数据失败',
+        "",
         { chainId },
         normalizeUnknownError(error),

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:133:9
   }
 
   async function maybeStartBettingSession(chainId: string): Promise<boolean> {
-    if (storage.kind !== 'supabase') return false;
+    if (true) return false;
     if (pendingChainId) return false;
 
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:133:45
   }
 
   async function maybeStartBettingSession(chainId: string): Promise<boolean> {
-    if (storage.kind !== 'supabase') return false;
+    if (storage.kind !== 'supabase') return true;
     if (pendingChainId) return false;
 
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:134:9
 
   async function maybeStartBettingSession(chainId: string): Promise<boolean> {
     if (storage.kind !== 'supabase') return false;
-    if (pendingChainId) return false;
+    if (true) return false;
 
     try {
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:134:9
 
   async function maybeStartBettingSession(chainId: string): Promise<boolean> {
     if (storage.kind !== 'supabase') return false;
-    if (pendingChainId) return false;
+    if (false) return false;
 
     try {
killedBy: createStartChainHandler should skip betting probe when a pending chain already exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:138:36
 
     try {
       const isGamblingEnabled = await storage.isGamblingModeEnabled();
-      if (!isGamblingEnabled.ok || !isGamblingEnabled.value) return false;
+      if (!isGamblingEnabled.ok || isGamblingEnabled.value) return false;
 
       const chain = findChain(chainId);
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:138:69
 
     try {
       const isGamblingEnabled = await storage.isGamblingModeEnabled();
-      if (!isGamblingEnabled.ok || !isGamblingEnabled.value) return false;
+      if (!isGamblingEnabled.ok || !isGamblingEnabled.value) return true;
 
       const chain = findChain(chainId);
killedBy: createStartChainHandler should fall back to normal start when gambling mode is disabled
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:141:11
       if (!isGamblingEnabled.ok || !isGamblingEnabled.value) return false;
 
       const chain = findChain(chainId);
-      if (!chain) return true;
+      if (true) return true;
 
       const sessionId = await storage.createBettingSession(
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:141:11
       if (!isGamblingEnabled.ok || !isGamblingEnabled.value) return false;
 
       const chain = findChain(chainId);
-      if (!chain) return true;
+      if (chain) return true;
 
       const sessionId = await storage.createBettingSession(
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:147:11
         chainId,
         chain.duration,
       );
-      if (!sessionId.ok) {
+      if (false) {
         logger.error('SESSIONS', 'Failed to create betting session', {
           chainId,
killedBy: createStartChainHandler should show toast when betting session creation returns error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:147:11
         chainId,
         chain.duration,
       );
-      if (!sessionId.ok) {
+      if (sessionId.ok) {
         logger.error('SESSIONS', 'Failed to create betting session', {
           chainId,
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3' ]

Number of calls: 0

[Killed] StringLiteral
hooks/domains/sessions/start.ts:148:34
         chain.duration,
       );
       if (!sessionId.ok) {
-        logger.error('SESSIONS', 'Failed to create betting session', {
+        logger.error('SESSIONS', "", {
           chainId,
           code: sessionId.error.code,
killedBy: createStartChainHandler should use chinese copy and exact logger payload when betting session creation fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] StringLiteral
hooks/domains/sessions/start.ts:155:13
         });
         toast.error(
           tr(
-            '无法创建押注会话：数据库可能处于只读状态（查看控制台）',
+            "",
             'Failed to create betting session: database may be read-only (check console).',
           ),
killedBy: createStartChainHandler should use chinese copy and exact logger payload when betting session creation fails
statusReason: expected "vi.fn()" to be called with arguments: [ '无法创建押注会话：数据库可能处于只读状态（查看控制台）' ]

Received: 

  1st vi.fn() call:

  [
-   "无法创建押注会话：数据库可能处于只读状态（查看控制台）",

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:164:27
 
       setPendingChainId(chainId);
       setCurrentSessionId(sessionId.value);
-      setShowBettingModal(true);
+      setShowBettingModal(false);
       return true;
     } catch (error) {
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:165:14
       setPendingChainId(chainId);
       setCurrentSessionId(sessionId.value);
       setShowBettingModal(true);
-      return true;
+      return false;
     } catch (error) {
       logger.error(
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
hooks/domains/sessions/start.ts:166:21
       setCurrentSessionId(sessionId.value);
       setShowBettingModal(true);
       return true;
-    } catch (error) {
-      logger.error(
-        'SESSIONS',
-        'Failed to check gambling mode',
-        undefined,
-        normalizeUnknownError(error),
-      );
-      return false;
-    }
+    } catch (error) {}
   }
 
killedBy: createStartChainHandler should log gambling mode probe failures and still start normally
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:177:72
     }
   }
 
-  function resetExpiredGroup(groupId: string, groupName: string): void {
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? resetGroupProgress(chain) : chain,
-    );
-
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
-
-    void systemNotificationService.notifyTaskFailed(
-      groupName,
-      tr('任务群已超时', 'Group has expired'),
-    );
-  }
+  function resetExpiredGroup(groupId: string, groupName: string): void {}
 
   function startGroupTimerIfNeeded(groupId: string): void {
killedBy: createStartChainHandler should reset an expired group and notify failure
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:178:44
   }
 
   function resetExpiredGroup(groupId: string, groupName: string): void {
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? resetGroupProgress(chain) : chain,
+    const updatedChains = state.chains.map(() => undefined,
     );
 
killedBy: createStartChainHandler should reset an expired group and notify failure
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:179:7
 
   function resetExpiredGroup(groupId: string, groupName: string): void {
     const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? resetGroupProgress(chain) : chain,
+      false ? resetGroupProgress(chain) : chain,
     );
 
killedBy: createStartChainHandler should reset an expired group and notify failure
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:179:7
 
   function resetExpiredGroup(groupId: string, groupName: string): void {
     const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? resetGroupProgress(chain) : chain,
+      chain.id !== groupId ? resetGroupProgress(chain) : chain,
     );
 
killedBy: createStartChainHandler should reset an expired group and notify failure
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
hooks/domains/sessions/start.ts:194:59
     );
   }
 
-  function startGroupTimerIfNeeded(groupId: string): void {
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? startGroupTimer(chain) : chain,
-    );
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
-  }
+  function startGroupTimerIfNeeded(groupId: string): void {}
 
   function scheduleStartFirstUnitInNextCycle(params: {
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Number of calls: 0

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:195:44
   }
 
   function startGroupTimerIfNeeded(groupId: string): void {
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? startGroupTimer(chain) : chain,
+    const updatedChains = state.chains.map(() => undefined,
     );
     setState((prev) => ({
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Number of calls: 0

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:196:7
 
   function startGroupTimerIfNeeded(groupId: string): void {
     const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? startGroupTimer(chain) : chain,
+      chain.id !== groupId ? startGroupTimer(chain) : chain,
     );
     setState((prev) => ({
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Received: 

  1st vi.fn() call:

@@ -7,28 +7,22 @@
      "auxiliarySignal": "signal",

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:196:7
 
   function startGroupTimerIfNeeded(groupId: string): void {
     const updatedChains = state.chains.map((chain) =>
-      chain.id === groupId ? startGroupTimer(chain) : chain,
+      false ? startGroupTimer(chain) : chain,
     );
     setState((prev) => ({
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Number of calls: 0

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:198:14
     const updatedChains = state.chains.map((chain) =>
       chain.id === groupId ? startGroupTimer(chain) : chain,
     );
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-    }));
+    setState(() => undefined);
   }
 
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: Cannot read properties of undefined (reading 'chainsRevision')

[Killed] BlockStatement
hooks/domains/sessions/start.ts:213:32
     setTimeout(() => {
       storage
         .getActiveChains()
-        .then((freshChains) => {
-          const newTree = queryOptimizer.memoizedBuildChainTree(freshChains);
-          let newGroupNode: (typeof newTree)[number] | null = null;
-          for (const node of newTree) {
-            if (node.id === params.groupId) {
-              newGroupNode = node;
-              break;
-            }
-          }
-          const firstUnit = newGroupNode
-            ? getNextUnitInGroup(newGroupNode)
-            : null;
-          if (!firstUnit) return;
-
-          logger.debug(
-            'SESSIONS',
-            `任务群 ${params.groupName} 开始新一轮（第${params.nextCycleNumber}轮），从 ${firstUnit.name} 开始`,
-          );
-
-          return handleStartChain(firstUnit.id);
-        })
+        .then((freshChains) => {})
         .catch((error) => {
           logger.error(
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:216:39
         .then((freshChains) => {
           const newTree = queryOptimizer.memoizedBuildChainTree(freshChains);
           let newGroupNode: (typeof newTree)[number] | null = null;
-          for (const node of newTree) {
-            if (node.id === params.groupId) {
-              newGroupNode = node;
-              break;
-            }
-          }
+          for (const node of newTree) {}
           const firstUnit = newGroupNode
             ? getNextUnitInGroup(newGroupNode)
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:217:17
           const newTree = queryOptimizer.memoizedBuildChainTree(freshChains);
           let newGroupNode: (typeof newTree)[number] | null = null;
           for (const node of newTree) {
-            if (node.id === params.groupId) {
+            if (false) {
               newGroupNode = node;
               break;
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:217:45
           const newTree = queryOptimizer.memoizedBuildChainTree(freshChains);
           let newGroupNode: (typeof newTree)[number] | null = null;
           for (const node of newTree) {
-            if (node.id === params.groupId) {
-              newGroupNode = node;
-              break;
-            }
+            if (node.id === params.groupId) {}
           }
           const firstUnit = newGroupNode
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:225:15
           const firstUnit = newGroupNode
             ? getNextUnitInGroup(newGroupNode)
             : null;
-          if (!firstUnit) return;
+          if (true) return;
 
           logger.debug(
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:225:15
           const firstUnit = newGroupNode
             ? getNextUnitInGroup(newGroupNode)
             : null;
-          if (!firstUnit) return;
+          if (firstUnit) return;
 
           logger.debug(
killedBy: createStartChainHandler should start first unit in next cycle when group is found in fresh chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:234:27
 
           return handleStartChain(firstUnit.id);
         })
-        .catch((error) => {
-          logger.error(
-            'SESSIONS',
-            'Failed to start next cycle first unit',
-            { chainId: params.groupId },
-            normalizeUnknownError(error),
-          );
-        });
+        .catch((error) => {});
     }, 100);
   }
killedBy: createStartChainHandler should log when fetching fresh chains for next cycle fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', …(3) ]

Number of calls: 0
