[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:255:56
     );
 
     const updatedChains = incrementGroupCompletionCount(state.chains, groupId);
-    const updatedGroup = updatedChains.find((chain) => chain.id === groupId);
+    const updatedGroup = updatedChains.find((chain) => false);
 
     if (updatedGroup) {
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cycling Group', 3, …(1) ]

Number of calls: 0

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:255:45
     );
 
     const updatedChains = incrementGroupCompletionCount(state.chains, groupId);
-    const updatedGroup = updatedChains.find((chain) => chain.id === groupId);
+    const updatedGroup = updatedChains.find(() => undefined);
 
     if (updatedGroup) {
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cycling Group', 3, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:257:9
     const updatedChains = incrementGroupCompletionCount(state.chains, groupId);
     const updatedGroup = updatedChains.find((chain) => chain.id === groupId);
 
-    if (updatedGroup) {
+    if (false) {
       void systemNotificationService.notifyTaskCompleted(
         updatedGroup.name,
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cycling Group', 3, …(1) ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:257:23
     const updatedChains = incrementGroupCompletionCount(state.chains, groupId);
     const updatedGroup = updatedChains.find((chain) => chain.id === groupId);
 
-    if (updatedGroup) {
-      void systemNotificationService.notifyTaskCompleted(
-        updatedGroup.name,
-        updatedGroup.totalCompletions,
-        tr(
-          `第${updatedGroup.totalCompletions}轮已完成，正在开始第${updatedGroup.totalCompletions + 1}轮`,
-          `Cycle ${updatedGroup.totalCompletions} completed. Starting cycle ${updatedGroup.totalCompletions + 1}.`,
-        ),
-      );
-    }
+    if (updatedGroup) {}
 
     try {
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cycling Group', 3, …(1) ]

Number of calls: 0

[Survived] ArithmeticOperator
hooks/domains/sessions/start.ts:262:57
         updatedGroup.name,
         updatedGroup.totalCompletions,
         tr(
-          `第${updatedGroup.totalCompletions}轮已完成，正在开始第${updatedGroup.totalCompletions + 1}轮`,
+          `第${updatedGroup.totalCompletions}轮已完成，正在开始第${updatedGroup.totalCompletions - 1}轮`,
           `Cycle ${updatedGroup.totalCompletions} completed. Starting cycle ${updatedGroup.totalCompletions + 1}.`,
         ),

[Killed] ArithmeticOperator
hooks/domains/sessions/start.ts:263:79
         updatedGroup.totalCompletions,
         tr(
           `第${updatedGroup.totalCompletions}轮已完成，正在开始第${updatedGroup.totalCompletions + 1}轮`,
-          `Cycle ${updatedGroup.totalCompletions} completed. Starting cycle ${updatedGroup.totalCompletions + 1}.`,
+          `Cycle ${updatedGroup.totalCompletions} completed. Starting cycle ${updatedGroup.totalCompletions - 1}.`,
         ),
       );
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cycling Group', 3, …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Cycling Group",

[Killed] BlockStatement
hooks/domains/sessions/start.ts:268:9
       );
     }
 
-    try {
-      await safelySaveChains(updatedChains);
-      queryOptimizer.onDataChange('chains');
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
-
-      emitRsipTaskEvent({
-        event: 'group_cycle_completed',
-        chainId: groupId,
-        chainKind: 'group',
-        occurredAt: new Date(),
-      });
-
-      scheduleStartFirstUnitInNextCycle({
-        groupId,
-        groupName,
-        nextCycleNumber: (updatedGroup?.totalCompletions ?? 0) + 1,
-      });
-    } catch (error) {
+    try {} catch (error) {
       logger.error(
         'SESSIONS',
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'group-2', …(29) } ] ]

Number of calls: 0

[Survived] ArrowFunction
hooks/domains/sessions/start.ts:271:16
     try {
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
+      setState(() => undefined);
 
       emitRsipTaskEvent({

[Survived] ObjectLiteral
hooks/domains/sessions/start.ts:271:27
     try {
       await safelySaveChains(updatedChains);
       queryOptimizer.onDataChange('chains');
-      setState((prev) => ({
-        ...prev,
-        chains: updatedChains,
-        chainsRevision: prev.chainsRevision + 1,
-      }));
+      setState((prev) => ({}));
 
       emitRsipTaskEvent({

[Killed] StringLiteral
hooks/domains/sessions/start.ts:280:20
       emitRsipTaskEvent({
         event: 'group_cycle_completed',
         chainId: groupId,
-        chainKind: 'group',
+        chainKind: "",
         occurredAt: new Date(),
       });
killedBy: createStartChainHandler should emit exact group cycle payload and warn when RSIP task event handler rejects
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] OptionalChaining
hooks/domains/sessions/start.ts:287:27
       scheduleStartFirstUnitInNextCycle({
         groupId,
         groupName,
-        nextCycleNumber: (updatedGroup?.totalCompletions ?? 0) + 1,
+        nextCycleNumber: (updatedGroup.totalCompletions ?? 0) + 1,
       });
     } catch (error) {

[Survived] LogicalOperator
hooks/domains/sessions/start.ts:287:27
       scheduleStartFirstUnitInNextCycle({
         groupId,
         groupName,
-        nextCycleNumber: (updatedGroup?.totalCompletions ?? 0) + 1,
+        nextCycleNumber: (updatedGroup?.totalCompletions && 0) + 1,
       });
     } catch (error) {

[Killed] BlockStatement
hooks/domains/sessions/start.ts:289:21
         groupName,
         nextCycleNumber: (updatedGroup?.totalCompletions ?? 0) + 1,
       });
-    } catch (error) {
-      logger.error(
-        'SESSIONS',
-        '保存任务群完成计数失败',
-        undefined,
-        normalizeUnknownError(error),
-      );
-    }
+    } catch (error) {}
   }
 
killedBy: createStartChainHandler should log when saving group cycle progress fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', Any<String>, …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:300:9
   }
 
   async function startGroupChain(groupChain: Chain): Promise<void> {
-    if (isGroupExpired(groupChain)) {
+    if (false) {
       resetExpiredGroup(groupChain.id, groupChain.name);
       return;
killedBy: createStartChainHandler should reset an expired group and notify failure
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:300:9
   }
 
   async function startGroupChain(groupChain: Chain): Promise<void> {
-    if (isGroupExpired(groupChain)) {
+    if (true) {
       resetExpiredGroup(groupChain.id, groupChain.name);
       return;
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:305:66
       return;
     }
 
-    if (groupChain.timeLimitHours && !groupChain.groupStartedAt) {
-      startGroupTimerIfNeeded(groupChain.id);
-    }
+    if (groupChain.timeLimitHours && !groupChain.groupStartedAt) {}
 
     const chainTree = queryOptimizer.memoizedBuildChainTree(
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'group-1', …(29) } ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:305:9
       return;
     }
 
-    if (groupChain.timeLimitHours && !groupChain.groupStartedAt) {
+    if (true) {
       startGroupTimerIfNeeded(groupChain.id);
     }
killedBy: createStartChainHandler should not start group timer when group already started
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:313:48
       state.chains,
       state.chainsRevision,
     );
-    const groupNode = chainTree.find((node) => node.id === groupChain.id);
+    const groupNode = chainTree.find((node) => node.id !== groupChain.id);
     if (!groupNode) {
       logger.error('SESSIONS', '无法找到任务群节点', {
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:313:38
       state.chains,
       state.chainsRevision,
     );
-    const groupNode = chainTree.find((node) => node.id === groupChain.id);
+    const groupNode = chainTree.find(() => undefined);
     if (!groupNode) {
       logger.error('SESSIONS', '无法找到任务群节点', {
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:314:9
       state.chainsRevision,
     );
     const groupNode = chainTree.find((node) => node.id === groupChain.id);
-    if (!groupNode) {
+    if (groupNode) {
       logger.error('SESSIONS', '无法找到任务群节点', {
         chainId: groupChain.id,
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:314:9
       state.chainsRevision,
     );
     const groupNode = chainTree.find((node) => node.id === groupChain.id);
-    if (!groupNode) {
+    if (false) {
       logger.error('SESSIONS', '无法找到任务群节点', {
         chainId: groupChain.id,
killedBy: createStartChainHandler should log and stop when group node cannot be found in tree
statusReason: expected "vi.fn()" to be called with arguments: [ 'SESSIONS', Any<String>, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:322:9
     }
 
     const nextUnit = getNextUnitInGroup(groupNode);
-    if (nextUnit) {
+    if (true) {
       logger.debug(
         'SESSIONS',
killedBy: createStartChainHandler should complete group cycle and schedule next cycle attempt when no next unit exists
statusReason: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:322:9
     }
 
     const nextUnit = getNextUnitInGroup(groupNode);
-    if (nextUnit) {
+    if (false) {
       logger.debug(
         'SESSIONS',
killedBy: createStartChainHandler should start next unit when group has available child
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:337:7
   function startSingleChain(chain: Chain): void {
     const existingScheduledSession = findScheduledSession(chain.id);
     const bettingSessionId =
-      pendingChainId === chain.id ? currentSessionId : null;
+      pendingChainId !== chain.id ? currentSessionId : null;
 
     const activeSession = buildActiveSession({
killedBy: createStartChainHandler should include betting session id and zero duration for durationless chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:337:7
   function startSingleChain(chain: Chain): void {
     const existingScheduledSession = findScheduledSession(chain.id);
     const bettingSessionId =
-      pendingChainId === chain.id ? currentSessionId : null;
+      true ? currentSessionId : null;
 
     const activeSession = buildActiveSession({
killedBy: createStartChainHandler should not probe gambling for local storage and should not reuse a mismatched betting session id
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectNotContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectNotContaining {

[Killed] ObjectLiteral
hooks/domains/sessions/start.ts:339:46
     const bettingSessionId =
       pendingChainId === chain.id ? currentSessionId : null;
 
-    const activeSession = buildActiveSession({
-      chainId: chain.id,
-      chain,
-      bettingSessionId,
-    });
+    const activeSession = buildActiveSession({});
     const updatedScheduledSessions = state.scheduledSessions.filter(
       (session) => session.chainId !== chain.id,
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: Cannot read properties of undefined (reading 'isDurationless')

[Killed] MethodExpression
hooks/domains/sessions/start.ts:344:38
       chain,
       bettingSessionId,
     });
-    const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chain.id,
-    );
+    const updatedScheduledSessions = state.scheduledSessions;
 
     const updatedChains = existingScheduledSession
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:345:20
       bettingSessionId,
     });
     const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chain.id,
+      (session) => session.chainId === chain.id,
     );
 
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:345:20
       bettingSessionId,
     });
     const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chain.id,
+      (session) => true,
     );
 
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received: 

  1st vi.fn() call:

  [
-   [],

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:349:26
     );
 
     const updatedChains = existingScheduledSession
-      ? state.chains.map((item) =>
-          item.id === chain.id
-            ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
-            : item,
+      ? state.chains.map(() => undefined,
         )
       : state.chains;
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:350:11
 
     const updatedChains = existingScheduledSession
       ? state.chains.map((item) =>
-          item.id === chain.id
+          true
             ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
             : item,
killedBy: createStartChainHandler should consume only the matching schedule when other schedules remain
statusReason: expected { id: 'other-chain', …(23) } to deeply equal { id: 'other-chain', …(23) }

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:350:11
 
     const updatedChains = existingScheduledSession
       ? state.chains.map((item) =>
-          item.id === chain.id
+          item.id !== chain.id
             ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
             : item,
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
hooks/domains/sessions/start.ts:351:43
     const updatedChains = existingScheduledSession
       ? state.chains.map((item) =>
           item.id === chain.id
-            ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
+            ? { ...item, auxiliaryStreak: item.auxiliaryStreak - 1 }
             : item,
         )
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ObjectLiteral
hooks/domains/sessions/start.ts:351:15
     const updatedChains = existingScheduledSession
       ? state.chains.map((item) =>
           item.id === chain.id
-            ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
+            ? {}
             : item,
         )
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:356:9
         )
       : state.chains;
 
-    if (existingScheduledSession) {
+    if (true) {
       void systemNotificationService.notifyTaskCompleted(
         chain.name,
killedBy: createStartChainHandler should preserve unrelated schedules and skip notification/persistChains when no matching schedule exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "Plain Chain",

[Killed] BlockStatement
hooks/domains/sessions/start.ts:356:35
         )
       : state.chains;
 
-    if (existingScheduledSession) {
-      void systemNotificationService.notifyTaskCompleted(
-        chain.name,
-        chain.auxiliaryStreak + 1,
-        tr('预约已完成', 'Schedule completed'),
-      );
-    }
+    if (existingScheduledSession) {}
 
     persistActiveSession(chain.id, activeSession);
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ 'Schedulable', 2, …(1) ]

Number of calls: 0

[Survived] StringLiteral
hooks/domains/sessions/start.ts:360:12
       void systemNotificationService.notifyTaskCompleted(
         chain.name,
         chain.auxiliaryStreak + 1,
-        tr('预约已完成', 'Schedule completed'),
+        tr("", 'Schedule completed'),
       );
     }

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:366:9
 
     persistActiveSession(chain.id, activeSession);
     persistScheduledSessions(chain.id, updatedScheduledSessions);
-    if (existingScheduledSession) {
+    if (true) {
       persistChains(chain.id, updatedChains);
     }
killedBy: createStartChainHandler should preserve unrelated schedules and skip notification/persistChains when no matching schedule exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:366:9
 
     persistActiveSession(chain.id, activeSession);
     persistScheduledSessions(chain.id, updatedScheduledSessions);
-    if (existingScheduledSession) {
+    if (false) {
       persistChains(chain.id, updatedChains);
     }
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
hooks/domains/sessions/start.ts:370:14
       persistChains(chain.id, updatedChains);
     }
 
-    setState((prev) => ({
-      ...prev,
-      activeSession,
-      scheduledSessions: updatedScheduledSessions,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-      currentView: 'focus',
-    }));
+    setState(() => undefined);
   }
 
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] StringLiteral
hooks/domains/sessions/start.ts:376:20
       scheduledSessions: updatedScheduledSessions,
       chains: updatedChains,
       chainsRevision: prev.chainsRevision + 1,
-      currentView: 'focus',
+      currentView: "",
     }));
   }
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected '' to be 'focus' // Object.is equality

[Killed] BlockStatement
hooks/domains/sessions/start.ts:380:67
     }));
   }
 
-  async function handleStartChain(chainId: string): Promise<void> {
-    if (await maybeStartBettingSession(chainId)) return;
-
-    const chain = findChain(chainId);
-    if (!chain) return;
-
-    if (chain.type === 'group') {
-      await startGroupChain(chain);
-      return;
-    }
-
-    startSingleChain(chain);
-  }
+  async function handleStartChain(chainId: string): Promise<void> {}
 
   return handleStartChain;
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:381:9
   }
 
   async function handleStartChain(chainId: string): Promise<void> {
-    if (await maybeStartBettingSession(chainId)) return;
+    if (false) return;
 
     const chain = findChain(chainId);
killedBy: createStartChainHandler should open betting modal for authenticated supabase users when betting is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'unit-3', 20 ]

Number of calls: 0

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:381:9
   }
 
   async function handleStartChain(chainId: string): Promise<void> {
-    if (await maybeStartBettingSession(chainId)) return;
+    if (true) return;
 
     const chain = findChain(chainId);
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:384:9
     if (await maybeStartBettingSession(chainId)) return;
 
     const chain = findChain(chainId);
-    if (!chain) return;
+    if (true) return;
 
     if (chain.type === 'group') {
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:384:9
     if (await maybeStartBettingSession(chainId)) return;
 
     const chain = findChain(chainId);
-    if (!chain) return;
+    if (false) return;
 
     if (chain.type === 'group') {
killedBy: createStartChainHandler should return early for missing local chains without persisting anything
statusReason: Cannot read properties of null (reading 'type')

[Killed] EqualityOperator
hooks/domains/sessions/start.ts:386:9
     const chain = findChain(chainId);
     if (!chain) return;
 
-    if (chain.type === 'group') {
+    if (chain.type !== 'group') {
       await startGroupChain(chain);
       return;
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:386:9
     const chain = findChain(chainId);
     if (!chain) return;
 
-    if (chain.type === 'group') {
+    if (true) {
       await startGroupChain(chain);
       return;
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
