[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:46:68
 }: UseBettingDomainParams) {
   const storage = useStorage();
 
-  const handleBetPlaced = async (betResult: BetPlacementResult) => {
-    if (isDev) {
-      logger.debug('BETTING', 'Bet placed successfully', { betResult });
-    }
-
-    emitPointsChanged();
-
-    if (pendingChainId) {
-      setActiveSessionId(currentSessionId);
-      await handleStartChain(pendingChainId);
-    }
-
-    setPendingChainId(null);
-    setCurrentSessionId(null);
-    setShowBettingModal(false);
-  };
+  const handleBetPlaced = async (betResult: BetPlacementResult) => {};
 
   const handleBetCancelled = async () => {
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:47:9
   const storage = useStorage();
 
   const handleBetPlaced = async (betResult: BetPlacementResult) => {
-    if (isDev) {
+    if (false) {
       logger.debug('BETTING', 'Bet placed successfully', { betResult });
     }
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:47:16
   const storage = useStorage();
 
   const handleBetPlaced = async (betResult: BetPlacementResult) => {
-    if (isDev) {
-      logger.debug('BETTING', 'Bet placed successfully', { betResult });
-    }
+    if (isDev) {}
 
     emitPointsChanged();
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
src/hooks/domains/useBettingDomain.ts:48:58
 
   const handleBetPlaced = async (betResult: BetPlacementResult) => {
     if (isDev) {
-      logger.debug('BETTING', 'Bet placed successfully', { betResult });
+      logger.debug('BETTING', 'Bet placed successfully', {});
     }
 
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "BETTING",

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:53:9
 
     emitPointsChanged();
 
-    if (pendingChainId) {
+    if (false) {
       setActiveSessionId(currentSessionId);
       await handleStartChain(pendingChainId);
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called with arguments: [ 'session-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:53:9
 
     emitPointsChanged();
 
-    if (pendingChainId) {
+    if (true) {
       setActiveSessionId(currentSessionId);
       await handleStartChain(pendingChainId);
killedBy: useBettingDomain should skip startup flow when no pending chain after bet placement
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "session-1",

[Killed] BooleanLiteral
src/hooks/domains/useBettingDomain.ts:60:25
 
     setPendingChainId(null);
     setCurrentSessionId(null);
-    setShowBettingModal(false);
+    setShowBettingModal(true);
   };
 
killedBy: useBettingDomain should continue pending chain startup after bet placement
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[Killed] EqualityOperator
src/hooks/domains/useBettingDomain.ts:64:29
   };
 
   const handleBetCancelled = async () => {
-    if (currentSessionId && storage.kind === 'supabase') {
+    if (currentSessionId && storage.kind !== 'supabase') {
       try {
         const result = await storage.deleteBettingSession(currentSessionId);
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'session-2' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:64:9
   };
 
   const handleBetCancelled = async () => {
-    if (currentSessionId && storage.kind === 'supabase') {
+    if (false) {
       try {
         const result = await storage.deleteBettingSession(currentSessionId);
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'session-2' ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:65:11
 
   const handleBetCancelled = async () => {
     if (currentSessionId && storage.kind === 'supabase') {
-      try {
-        const result = await storage.deleteBettingSession(currentSessionId);
-        if (!result.ok) {
-          logger.error('BETTING', 'Failed to delete cancelled session', {
-            sessionId: currentSessionId,
-            error: result.error,
-          });
-        }
-        if (isDev) {
-          logger.debug(
-            'BETTING',
-            'Cancelled session deleted (refund handled by trigger)',
-            { sessionId: currentSessionId },
-          );
-        }
-      } catch (error) {
+      try {} catch (error) {
         logger.error(
           'BETTING',
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'session-2' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:67:13
     if (currentSessionId && storage.kind === 'supabase') {
       try {
         const result = await storage.deleteBettingSession(currentSessionId);
-        if (!result.ok) {
+        if (false) {
           logger.error('BETTING', 'Failed to delete cancelled session', {
             sessionId: currentSessionId,
killedBy: useBettingDomain should keep cleanup flow even when delete session returns domain error
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:67:25
     if (currentSessionId && storage.kind === 'supabase') {
       try {
         const result = await storage.deleteBettingSession(currentSessionId);
-        if (!result.ok) {
-          logger.error('BETTING', 'Failed to delete cancelled session', {
-            sessionId: currentSessionId,
-            error: result.error,
-          });
-        }
+        if (!result.ok) {}
         if (isDev) {
           logger.debug(
killedBy: useBettingDomain should keep cleanup flow even when delete session returns domain error
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useBettingDomain.ts:68:35
       try {
         const result = await storage.deleteBettingSession(currentSessionId);
         if (!result.ok) {
-          logger.error('BETTING', 'Failed to delete cancelled session', {
+          logger.error('BETTING', "", {
             sessionId: currentSessionId,
             error: result.error,
killedBy: useBettingDomain should keep cleanup flow even when delete session returns domain error
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:73:20
             error: result.error,
           });
         }
-        if (isDev) {
-          logger.debug(
-            'BETTING',
-            'Cancelled session deleted (refund handled by trigger)',
-            { sessionId: currentSessionId },
-          );
-        }
+        if (isDev) {}
       } catch (error) {
         logger.error(
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/domains/useBettingDomain.ts:73:13
             error: result.error,
           });
         }
-        if (isDev) {
+        if (false) {
           logger.debug(
             'BETTING',
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useBettingDomain.ts:76:13
         if (isDev) {
           logger.debug(
             'BETTING',
-            'Cancelled session deleted (refund handled by trigger)',
+            "",
             { sessionId: currentSessionId },
           );
killedBy: useBettingDomain should cancel supabase session and emit points refresh
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "BETTING",

[Killed] BlockStatement
src/hooks/domains/useBettingDomain.ts:80:23
             { sessionId: currentSessionId },
           );
         }
-      } catch (error) {
-        logger.error(
-          'BETTING',
-          '删除取消的会话记录失败',
-          { sessionId: currentSessionId },
-          toError(error),
-        );
-      }
+      } catch (error) {}
 
       emitPointsChanged();
killedBy: useBettingDomain should log and continue cleanup when deleteBettingSession throws
statusReason: expected "vi.fn()" to be called with arguments: [ 'BETTING', Any<String>, …(2) ]

Number of calls: 0

[Survived] StringLiteral
src/hooks/domains/useBettingDomain.ts:83:11
       } catch (error) {
         logger.error(
           'BETTING',
-          '删除取消的会话记录失败',
+          "",
           { sessionId: currentSessionId },
           toError(error),

[Killed] BooleanLiteral
src/hooks/domains/useBettingDomain.ts:95:25
     setPendingChainId(null);
     setCurrentSessionId(null);
     setActiveSessionId(null);
-    setShowBettingModal(false);
+    setShowBettingModal(true);
   };
 
killedBy: useBettingDomain should reset local pending state without supabase delete call
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,
