[Survived] BlockStatement
src/hooks/domains/useChainsDomain.ts:29:75
 import { getSafeErrorDetailFromUnknown } from '../../utils/errorMessage';
 import { normalizeUnknownError } from '../../utils/errors/normalizeError';
 
-function normalizeOptionalParentId(parentId: unknown): string | undefined {
-  return typeof parentId === 'string' ? parentId : undefined;
-}
+function normalizeOptionalParentId(parentId: unknown): string | undefined {}
 
 function updateChainFromDraft(

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:30:10
 import { normalizeUnknownError } from '../../utils/errors/normalizeError';
 
 function normalizeOptionalParentId(parentId: unknown): string | undefined {
-  return typeof parentId === 'string' ? parentId : undefined;
+  return typeof parentId !== 'string' ? parentId : undefined;
 }
 
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected { bad: 'value' } to be undefined

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:30:10
 import { normalizeUnknownError } from '../../utils/errors/normalizeError';
 
 function normalizeOptionalParentId(parentId: unknown): string | undefined {
-  return typeof parentId === 'string' ? parentId : undefined;
+  return true ? parentId : undefined;
 }
 
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected { bad: 'value' } to be undefined

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:38:7
   chainData: ChainDraft,
   parentId: string | undefined,
 ): Chain {
-  if (chainData.type === 'group') {
+  if (true) {
     const updated: GroupChain = {
       ...existing,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:38:7
   chainData: ChainDraft,
   parentId: string | undefined,
 ): Chain {
-  if (chainData.type === 'group') {
+  if (chainData.type !== 'group') {
     const updated: GroupChain = {
       ...existing,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:48:7
     return updated;
   }
 
-  if (existing.type === 'group') {
+  if (false) {
     const {
       timeLimitHours,
killedBy: useChainsDomain should convert edited group chain into unit chain by removing group-only fields
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:48:7
     return updated;
   }
 
-  if (existing.type === 'group') {
+  if (existing.type !== 'group') {
     const {
       timeLimitHours,
killedBy: useChainsDomain should convert edited group chain into unit chain by removing group-only fields
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:70:11
   id: string;
   createdAt: Date;
   parentId: string | undefined;
-}): Chain {
-  const base = {
-    id: params.id,
-    parentId: params.parentId,
-    currentStreak: 0,
-    auxiliaryStreak: 0,
-    totalCompletions: 0,
-    totalFailures: 0,
-    auxiliaryFailures: 0,
-    createdAt: params.createdAt,
-  };
-
-  if (params.chainData.type === 'group') {
-    const newChain: GroupChain = {
-      ...base,
-      ...params.chainData,
-      type: 'group',
-    };
-    return newChain;
-  }
-
-  const newChain: UnitChain = { ...base, ...params.chainData };
-  return newChain;
-}
+}): Chain {}
 
 export type SafelySaveChains = (
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:71:16
   createdAt: Date;
   parentId: string | undefined;
 }): Chain {
-  const base = {
-    id: params.id,
-    parentId: params.parentId,
-    currentStreak: 0,
-    auxiliaryStreak: 0,
-    totalCompletions: 0,
-    totalFailures: 0,
-    auxiliaryFailures: 0,
-    createdAt: params.createdAt,
-  };
+  const base = {};
 
   if (params.chainData.type === 'group') {
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected { name: 'Draft Chain', …(15) } to match object { id: 'new-chain-id', …(7) }
(14 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:82:7
     createdAt: params.createdAt,
   };
 
-  if (params.chainData.type === 'group') {
+  if (params.chainData.type !== 'group') {
     const newChain: GroupChain = {
       ...base,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Create chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:82:7
     createdAt: params.createdAt,
   };
 
-  if (params.chainData.type === 'group') {
+  if (true) {
     const newChain: GroupChain = {
       ...base,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Create chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:114:53
   safelySaveChains,
 }: UseChainsDomainParams) {
   const { language, tr } = useI18n();
-  const handleCreateChain = (parentId?: unknown) => {
-    // React event handlers pass the event object as the first argument.
-    // If we treat it as a parentId, it can leak `Window` into persisted data and break JSON serialization.
-    const normalizedParentId = typeof parentId === 'string' ? parentId : null;
-
-    setState((prev) => ({
-      ...prev,
-      currentView: 'editor',
-      editingChain: null,
-      viewingChainId: normalizedParentId,
-    }));
-  };
+  const handleCreateChain = (parentId?: unknown) => {};
 
   const handleCreateTaskGroup = () => {
killedBy: useChainsDomain should open chain editor and ignore non-string parent input
statusReason: expected 'dashboard' to be 'editor' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:117:32
   const handleCreateChain = (parentId?: unknown) => {
     // React event handlers pass the event object as the first argument.
     // If we treat it as a parentId, it can leak `Window` into persisted data and break JSON serialization.
-    const normalizedParentId = typeof parentId === 'string' ? parentId : null;
+    const normalizedParentId = false ? parentId : null;
 
     setState((prev) => ({
killedBy: useChainsDomain should open chain editor with explicit parent id
statusReason: expected null to be 'parent-123' // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:117:32
   const handleCreateChain = (parentId?: unknown) => {
     // React event handlers pass the event object as the first argument.
     // If we treat it as a parentId, it can leak `Window` into persisted data and break JSON serialization.
-    const normalizedParentId = typeof parentId === 'string' ? parentId : null;
+    const normalizedParentId = typeof parentId !== 'string' ? parentId : null;
 
     setState((prev) => ({
killedBy: useChainsDomain should open chain editor and ignore non-string parent input
statusReason: expected { Object (target) } to be null

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:119:14
     // If we treat it as a parentId, it can leak `Window` into persisted data and break JSON serialization.
     const normalizedParentId = typeof parentId === 'string' ? parentId : null;
 
-    setState((prev) => ({
-      ...prev,
-      currentView: 'editor',
-      editingChain: null,
-      viewingChainId: normalizedParentId,
-    }));
+    setState(() => undefined);
   };
 
killedBy: useChainsDomain should open chain editor and ignore non-string parent input
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:119:25
     // If we treat it as a parentId, it can leak `Window` into persisted data and break JSON serialization.
     const normalizedParentId = typeof parentId === 'string' ? parentId : null;
 
-    setState((prev) => ({
-      ...prev,
-      currentView: 'editor',
-      editingChain: null,
-      viewingChainId: normalizedParentId,
-    }));
+    setState((prev) => ({}));
   };
 
killedBy: useChainsDomain should open chain editor and ignore non-string parent input
statusReason: expected undefined to be 'editor' // Object.is equality

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:127:39
     }));
   };
 
-  const handleCreateTaskGroup = () => {
-    setState((prev) => ({
-      ...prev,
-      currentView: 'taskgroup-editor',
-      editingChain: null,
-    }));
-  };
+  const handleCreateTaskGroup = () => {};
 
   const handleEditChain = (chainId: string) => {
killedBy: useChainsDomain should open task group editor when creating task group
statusReason: expected 'dashboard' to be 'taskgroup-editor' // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:128:14
   };
 
   const handleCreateTaskGroup = () => {
-    setState((prev) => ({
-      ...prev,
-      currentView: 'taskgroup-editor',
-      editingChain: null,
-    }));
+    setState(() => undefined);
   };
 
killedBy: useChainsDomain should open task group editor when creating task group
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:135:48
     }));
   };
 
-  const handleEditChain = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
-    if (chain) {
-      const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
-      setState((prev) => ({
-        ...prev,
-        currentView: isTaskGroup ? 'taskgroup-editor' : 'editor',
-        editingChain: chain,
-      }));
-    }
-  };
+  const handleEditChain = (chainId: string) => {};
 
   const handleSaveChain = async (
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: expected 'dashboard' to be 'taskgroup-editor' // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:136:37
   };
 
   const handleEditChain = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find(() => undefined);
     if (chain) {
       const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: expected 'dashboard' to be 'taskgroup-editor' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:136:44
   };
 
   const handleEditChain = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => true);
     if (chain) {
       const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
killedBy: useChainsDomain should route legacy task-group shaped chains to taskgroup editor
statusReason: expected 'editor' to be 'taskgroup-editor' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:137:9
 
   const handleEditChain = (chainId: string) => {
     const chain = state.chains.find((c) => c.id === chainId);
-    if (chain) {
+    if (true) {
       const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
       setState((prev) => ({
killedBy: useChainsDomain should ignore edit request when chain id does not exist
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:137:16
 
   const handleEditChain = (chainId: string) => {
     const chain = state.chains.find((c) => c.id === chainId);
-    if (chain) {
-      const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
-      setState((prev) => ({
-        ...prev,
-        currentView: isTaskGroup ? 'taskgroup-editor' : 'editor',
-        editingChain: chain,
-      }));
-    }
+    if (chain) {}
   };
 
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: expected 'dashboard' to be 'taskgroup-editor' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:138:27
   const handleEditChain = (chainId: string) => {
     const chain = state.chains.find((c) => c.id === chainId);
     if (chain) {
-      const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
+      const isTaskGroup = false;
       setState((prev) => ({
         ...prev,
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: expected 'editor' to be 'taskgroup-editor' // Object.is equality

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:138:27
   const handleEditChain = (chainId: string) => {
     const chain = state.chains.find((c) => c.id === chainId);
     if (chain) {
-      const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
+      const isTaskGroup = chain.type !== 'group' || chain.isTaskGroup;
       setState((prev) => ({
         ...prev,
killedBy: useChainsDomain should route unit chain edit to chain editor
statusReason: expected 'taskgroup-editor' to be 'editor' // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:139:16
     const chain = state.chains.find((c) => c.id === chainId);
     if (chain) {
       const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
-      setState((prev) => ({
-        ...prev,
-        currentView: isTaskGroup ? 'taskgroup-editor' : 'editor',
-        editingChain: chain,
-      }));
+      setState(() => undefined);
     }
   };
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] BooleanLiteral
src/hooks/domains/useChainsDomain.ts:149:23
 
   const handleSaveChain = async (
     chainData: ChainDraft,
-    isCopy: boolean = false,
+    isCopy: boolean = true,
   ) => {
     logger.debug('CHAINS', 'Starting to save chain data', {
killedBy: useChainsDomain should default isCopy to false when omitted and preserve a valid string parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:151:18
     chainData: ChainDraft,
     isCopy: boolean = false,
   ) => {
-    logger.debug('CHAINS', 'Starting to save chain data', {
+    logger.debug("", 'Starting to save chain data', {
       chainId: state.editingChain?.id ?? null,
       chainName: chainData.name,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "CHAINS",

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:151:59
     chainData: ChainDraft,
     isCopy: boolean = false,
   ) => {
-    logger.debug('CHAINS', 'Starting to save chain data', {
-      chainId: state.editingChain?.id ?? null,
-      chainName: chainData.name,
-      chainType: chainData.type,
-      isCopy,
-      chainCount: state.chains.length,
-    });
+    logger.debug('CHAINS', 'Starting to save chain data', {});
 
     try {
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] OptionalChaining
src/hooks/domains/useChainsDomain.ts:152:16
     isCopy: boolean = false,
   ) => {
     logger.debug('CHAINS', 'Starting to save chain data', {
-      chainId: state.editingChain?.id ?? null,
+      chainId: state.editingChain.id ?? null,
       chainName: chainData.name,
       chainType: chainData.type,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: Cannot read properties of null (reading 'id')

[Survived] LogicalOperator
src/hooks/domains/useChainsDomain.ts:152:16
     isCopy: boolean = false,
   ) => {
     logger.debug('CHAINS', 'Starting to save chain data', {
-      chainId: state.editingChain?.id ?? null,
+      chainId: state.editingChain?.id && null,
       chainName: chainData.name,
       chainType: chainData.type,

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:161:76
 
     try {
       const allExistingChains = await storage.getChains();
-      logger.debug('CHAINS', 'Loaded existing chains (including deleted)', {
-        count: allExistingChains.length,
-      });
+      logger.debug('CHAINS', 'Loaded existing chains (including deleted)', {});
 
       const activeChains = allExistingChains.filter(
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:161:30
 
     try {
       const allExistingChains = await storage.getChains();
-      logger.debug('CHAINS', 'Loaded existing chains (including deleted)', {
+      logger.debug('CHAINS', "", {
         count: allExistingChains.length,
       });
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] MethodExpression
src/hooks/domains/useChainsDomain.ts:165:28
         count: allExistingChains.length,
       });
 
-      const activeChains = allExistingChains.filter(
-        (chain) => chain.deletedAt == null,
-      );
+      const activeChains = allExistingChains;
       const deletedChains = allExistingChains.filter(
         (chain) => chain.deletedAt != null,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:166:9
       });
 
       const activeChains = allExistingChains.filter(
-        (chain) => chain.deletedAt == null,
+        () => undefined,
       );
       const deletedChains = allExistingChains.filter(
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:166:20
       });
 
       const activeChains = allExistingChains.filter(
-        (chain) => chain.deletedAt == null,
+        (chain) => true,
       );
       const deletedChains = allExistingChains.filter(
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] MethodExpression
src/hooks/domains/useChainsDomain.ts:168:29
       const activeChains = allExistingChains.filter(
         (chain) => chain.deletedAt == null,
       );
-      const deletedChains = allExistingChains.filter(
-        (chain) => chain.deletedAt != null,
-      );
+      const deletedChains = allExistingChains;
       logger.debug('CHAINS', 'Chain counts', {
         active: activeChains.length,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:169:20
         (chain) => chain.deletedAt == null,
       );
       const deletedChains = allExistingChains.filter(
-        (chain) => chain.deletedAt != null,
+        (chain) => false,
       );
       logger.debug('CHAINS', 'Chain counts', {
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:169:9
         (chain) => chain.deletedAt == null,
       );
       const deletedChains = allExistingChains.filter(
-        (chain) => chain.deletedAt != null,
+        () => undefined,
       );
       logger.debug('CHAINS', 'Chain counts', {
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:171:46
       const deletedChains = allExistingChains.filter(
         (chain) => chain.deletedAt != null,
       );
-      logger.debug('CHAINS', 'Chain counts', {
-        active: activeChains.length,
-        deleted: deletedChains.length,
-      });
+      logger.debug('CHAINS', 'Chain counts', {});
 
       let updatedActiveChains: Chain[];
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:171:20
       const deletedChains = allExistingChains.filter(
         (chain) => chain.deletedAt != null,
       );
-      logger.debug('CHAINS', 'Chain counts', {
+      logger.debug("", 'Chain counts', {
         active: activeChains.length,
         deleted: deletedChains.length,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Chain counts', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:179:11
       let updatedActiveChains: Chain[];
       const normalizedParentId = normalizeOptionalParentId(chainData.parentId);
 
-      if (state.editingChain && !isCopy) {
+      if (true) {
         logger.debug('CHAINS', 'Editing existing chain', {
           chainId: state.editingChain.id,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:179:11
       let updatedActiveChains: Chain[];
       const normalizedParentId = normalizeOptionalParentId(chainData.parentId);
 
-      if (state.editingChain && !isCopy) {
+      if (false) {
         logger.debug('CHAINS', 'Editing existing chain', {
           chainId: state.editingChain.id,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected [ { id: 'editing-1', …(23) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:185:48
         });
 
         const editingChainId = state.editingChain.id;
-        updatedActiveChains = state.chains.map((chain) =>
-          chain.id === editingChainId
-            ? updateChainFromDraft(chain, chainData, normalizedParentId)
-            : chain,
+        updatedActiveChains = state.chains.map(() => undefined,
         );
 
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:186:11
 
         const editingChainId = state.editingChain.id;
         updatedActiveChains = state.chains.map((chain) =>
-          chain.id === editingChainId
+          false
             ? updateChainFromDraft(chain, chainData, normalizedParentId)
             : chain,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected 'Editing' to be 'Edited Unit' // Object.is equality

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:186:11
 
         const editingChainId = state.editingChain.id;
         updatedActiveChains = state.chains.map((chain) =>
-          chain.id === editingChainId
+          true
             ? updateChainFromDraft(chain, chainData, normalizedParentId)
             : chain,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected { id: 'untouched-1', …(23) } to deeply equal { id: 'untouched-1', …(23) }

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:191:22
             : chain,
         );
 
-        logger.debug('CHAINS', 'Edited chain; updated active chains', {
+        logger.debug("", 'Edited chain; updated active chains', {
           count: updatedActiveChains.length,
         });
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:195:22
           count: updatedActiveChains.length,
         });
         const editedChain = updatedActiveChains.find(
-          (chain) => chain.id === editingChainId,
+          (chain) => chain.id !== editingChainId,
         );
         logger.debug('CHAINS', 'Edited chain snapshot', {
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:195:22
           count: updatedActiveChains.length,
         });
         const editedChain = updatedActiveChains.find(
-          (chain) => chain.id === editingChainId,
+          (chain) => false,
         );
         logger.debug('CHAINS', 'Edited chain snapshot', {
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:197:32
         const editedChain = updatedActiveChains.find(
           (chain) => chain.id === editingChainId,
         );
-        logger.debug('CHAINS', 'Edited chain snapshot', {
+        logger.debug('CHAINS', "", {
           chainId: editedChain?.id,
           name: editedChain?.name,
killedBy: useChainsDomain should update an existing unit chain in-place and normalize invalid parent id
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Survived] OptionalChaining
src/hooks/domains/useChainsDomain.ts:198:20
           (chain) => chain.id === editingChainId,
         );
         logger.debug('CHAINS', 'Edited chain snapshot', {
-          chainId: editedChain?.id,
+          chainId: editedChain.id,
           name: editedChain?.name,
           type: editedChain?.type,

[Survived] OptionalChaining
src/hooks/domains/useChainsDomain.ts:199:17
         );
         logger.debug('CHAINS', 'Edited chain snapshot', {
           chainId: editedChain?.id,
-          name: editedChain?.name,
+          name: editedChain.name,
           type: editedChain?.type,
         });

[Survived] OptionalChaining
src/hooks/domains/useChainsDomain.ts:200:17
         logger.debug('CHAINS', 'Edited chain snapshot', {
           chainId: editedChain?.id,
           name: editedChain?.name,
-          type: editedChain?.type,
+          type: editedChain.type,
         });
       } else {

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:202:14
           name: editedChain?.name,
           type: editedChain?.type,
         });
-      } else {
-        const id = crypto.randomUUID();
-        const createdAt = new Date();
-        const newChain = createNewChain({
-          chainData,
-          id,
-          createdAt,
-          parentId: normalizedParentId,
-        });
-
-        logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
-          newChainId: newChain.id,
-          type: newChain.type === 'group' ? 'group' : 'unit',
-        });
-
-        updatedActiveChains = [...state.chains, newChain];
-        logger.debug('CHAINS', 'Added chain; updated active chains', {
-          count: updatedActiveChains.length,
-        });
-      }
+      } else {}
 
       logger.debug('CHAINS', 'Saving chains');
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: Target cannot be null or undefined.
