[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:205:41
       } else {
         const id = crypto.randomUUID();
         const createdAt = new Date();
-        const newChain = createNewChain({
-          chainData,
-          id,
-          createdAt,
-          parentId: normalizedParentId,
-        });
+        const newChain = createNewChain({});
 
         logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:212:41
           parentId: normalizedParentId,
         });
 
-        logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
+        logger.debug('CHAINS', isCopy ? "" : 'Create chain', {
           newChainId: newChain.id,
           type: newChain.type === 'group' ? 'group' : 'unit',
killedBy: useChainsDomain should create a copied chain when editing and copy mode is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Copy chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:212:22
           parentId: normalizedParentId,
         });
 
-        logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
+        logger.debug("", isCopy ? 'Copy chain' : 'Create chain', {
           newChainId: newChain.id,
           type: newChain.type === 'group' ? 'group' : 'unit',
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Create chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] EqualityOperator
src/hooks/domains/useChainsDomain.ts:214:17
 
         logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
           newChainId: newChain.id,
-          type: newChain.type === 'group' ? 'group' : 'unit',
+          type: newChain.type !== 'group' ? 'group' : 'unit',
         });
 
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Create chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:214:17
 
         logger.debug('CHAINS', isCopy ? 'Copy chain' : 'Create chain', {
           newChainId: newChain.id,
-          type: newChain.type === 'group' ? 'group' : 'unit',
+          type: false ? 'group' : 'unit',
         });
 
killedBy: useChainsDomain should create a new group chain from draft when not editing
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Create chain', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:218:22
         });
 
         updatedActiveChains = [...state.chains, newChain];
-        logger.debug('CHAINS', 'Added chain; updated active chains', {
+        logger.debug("", 'Added chain; updated active chains', {
           count: updatedActiveChains.length,
         });
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:223:20
         });
       }
 
-      logger.debug('CHAINS', 'Saving chains');
+      logger.debug("", 'Saving chains');
       await safelySaveChains(updatedActiveChains);
       queryOptimizer.onDataChange('chains');
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', 'Saving chains' ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:226:30
       logger.debug('CHAINS', 'Saving chains');
       await safelySaveChains(updatedActiveChains);
       queryOptimizer.onDataChange('chains');
-      logger.debug('CHAINS', 'Save succeeded; updating UI state');
+      logger.debug('CHAINS', "");
 
       setState((prev) => ({
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Killed] ArrowFunction
src/hooks/domains/useChainsDomain.ts:228:16
       queryOptimizer.onDataChange('chains');
       logger.debug('CHAINS', 'Save succeeded; updating UI state');
 
-      setState((prev) => ({
-        ...prev,
-        chains: updatedActiveChains,
-        chainsRevision: prev.chainsRevision + 1,
-        currentView: 'dashboard',
-        editingChain: null,
-      }));
+      setState(() => undefined);
     } catch (error) {
       logger.error(
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: Cannot read properties of undefined (reading 'currentView')

[Killed] ArithmeticOperator
src/hooks/domains/useChainsDomain.ts:231:25
       setState((prev) => ({
         ...prev,
         chains: updatedActiveChains,
-        chainsRevision: prev.chainsRevision + 1,
+        chainsRevision: prev.chainsRevision - 1,
         currentView: 'dashboard',
         editingChain: null,
killedBy: useChainsDomain should create a new chain and persist via safelySaveChains
statusReason: expected -1 to be 1 // Object.is equality

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:238:9
     } catch (error) {
       logger.error(
         'CHAINS',
-        'Failed to save chain',
+        "",
         undefined,
         normalizeUnknownError(error),
killedBy: useChainsDomain should surface save errors and reload active chains
statusReason: expected "vi.fn()" to be called with arguments: [ 'CHAINS', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "CHAINS",

[Survived] StringLiteral
src/hooks/domains/useChainsDomain.ts:246:16
       const safeDetail = getSafeErrorDetailFromUnknown(error, language);
       toast.error(
         safeDetail
-          ? tr(`保存失败: ${safeDetail}`, `Save failed: ${safeDetail}`)
+          ? tr(``, `Save failed: ${safeDetail}`)
           : tr(
               '保存失败，请重试（详情见控制台）',

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:248:15
         safeDetail
           ? tr(`保存失败: ${safeDetail}`, `Save failed: ${safeDetail}`)
           : tr(
-              '保存失败，请重试（详情见控制台）',
+              "",
               'Save failed. Check the console for details, then try again.',
             ),
killedBy: useChainsDomain should use chinese error copy when safe detail is unavailable
statusReason: expected "vi.fn()" to be called with arguments: [ '保存失败，请重试（详情见控制台）' ]

Received: 

  1st vi.fn() call:

  [
-   "保存失败，请重试（详情见控制台）",

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:249:15
           ? tr(`保存失败: ${safeDetail}`, `Save failed: ${safeDetail}`)
           : tr(
               '保存失败，请重试（详情见控制台）',
-              'Save failed. Check the console for details, then try again.',
+              "",
             ),
       );
killedBy: useChainsDomain should use generic toast message when safe detail is unavailable
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Save failed. Check the console for details, then try again.",

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:253:11
             ),
       );
 
-      try {
-        const currentChains = await storage.getActiveChains();
-        setState((prev) => ({
-          ...prev,
-          chains: currentChains,
-          chainsRevision: prev.chainsRevision + 1,
-        }));
-      } catch (reloadError) {
+      try {} catch (reloadError) {
         logger.error(
           'CHAINS',
killedBy: useChainsDomain should surface save errors and reload active chains
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/domains/useChainsDomain.ts:260:29
           chains: currentChains,
           chainsRevision: prev.chainsRevision + 1,
         }));
-      } catch (reloadError) {
-        logger.error(
-          'CHAINS',
-          '重新加载数据也失败了',
-          undefined,
-          normalizeUnknownError(reloadError),
-        );
-      }
+      } catch (reloadError) {}
     }
   };
killedBy: useChainsDomain should log reload failure when save recovery also fails
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] StringLiteral
src/hooks/domains/useChainsDomain.ts:263:11
       } catch (reloadError) {
         logger.error(
           'CHAINS',
-          '重新加载数据也失败了',
+          "",
           undefined,
           normalizeUnknownError(reloadError),
killedBy: useChainsDomain should log reload failure when save recovery also fails
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'CHAINS', '重新加载数据也失败了', …(2) ]

[Killed] ObjectLiteral
src/hooks/domains/useChainsDomain.ts:271:10
     }
   };
 
-  return {
-    handleCreateChain,
-    handleCreateTaskGroup,
-    handleEditChain,
-    handleSaveChain,
-  };
+  return {};
 }
 
killedBy: useChainsDomain should open chain editor and ignore non-string parent input
statusReason: result.current.handleCreateChain is not a function
