[Killed] BlockStatement
src/hooks/domains/useRulesDomain.ts:43:8
     chainId: string,
     updatedChains: AppState['chains'],
     context: string,
-  ) => {
-    safelySaveChains(updatedChains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
-      logger.error('RULES_DOMAIN', context, { chainId }, toError(error));
-    });
-  };
+  ) => {};
 
   const persistScheduledSessions = (
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/hooks/domains/useRulesDomain.ts:44:54
     updatedChains: AppState['chains'],
     context: string,
   ) => {
-    safelySaveChains(updatedChains).catch((error) => {
-      queryOptimizer.onDataChange('chains');
-      logger.error('RULES_DOMAIN', context, { chainId }, toError(error));
-    });
+    safelySaveChains(updatedChains).catch((error) => {});
   };
 
killedBy: useRulesDomain should invalidate chain query cache when chain persistence fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'chains' ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/domains/useRulesDomain.ts:46:20
   ) => {
     safelySaveChains(updatedChains).catch((error) => {
       queryOptimizer.onDataChange('chains');
-      logger.error('RULES_DOMAIN', context, { chainId }, toError(error));
+      logger.error("", context, { chainId }, toError(error));
     });
   };
killedBy: useRulesDomain logs failure context when persistence promises reject in failure-judgment flow
statusReason: expected "vi.fn()" to be called with arguments: [ 'RULES_DOMAIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
-   "RULES_DOMAIN",

[Killed] BlockStatement
src/hooks/domains/useRulesDomain.ts:54:8
     chainId: string,
     updatedScheduledSessions: AppState['scheduledSessions'],
     context: string,
-  ) => {
-    storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
-      logger.error('RULES_DOMAIN', context, { chainId }, toError(error));
-    });
-  };
+  ) => {};
 
   const handleAuxiliaryJudgmentFailure = (chainId: string) => {
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected "vi.fn()" to be called with arguments: [ [ ObjectContaining{…} ] ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/domains/useRulesDomain.ts:55:78
     updatedScheduledSessions: AppState['scheduledSessions'],
     context: string,
   ) => {
-    storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {
-      logger.error('RULES_DOMAIN', context, { chainId }, toError(error));
-    });
+    storage.saveScheduledSessions(updatedScheduledSessions).catch((error) => {});
   };
 
killedBy: useRulesDomain logs failure context when persistence promises reject in failure-judgment flow
statusReason: expected "vi.fn()" to be called with arguments: [ 'RULES_DOMAIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RULES_DOMAIN",

[Killed] MethodExpression
src/hooks/domains/useRulesDomain.ts:61:38
   };
 
   const handleAuxiliaryJudgmentFailure = (chainId: string) => {
-    const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
-    );
+    const updatedScheduledSessions = state.scheduledSessions;
     const updatedChains = state.chains.map((chain) =>
       chain.id === chainId
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected "vi.fn()" to be called with arguments: [ [ ObjectContaining{…} ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] ArrowFunction
src/hooks/domains/useRulesDomain.ts:62:7
 
   const handleAuxiliaryJudgmentFailure = (chainId: string) => {
     const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
+      () => undefined,
     );
     const updatedChains = state.chains.map((chain) =>
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected "vi.fn()" to be called with arguments: [ [ ObjectContaining{…} ] ]

Received: 

  1st vi.fn() call:

  [
-   [

[Killed] ArrowFunction
src/hooks/domains/useRulesDomain.ts:64:44
     const updatedScheduledSessions = state.scheduledSessions.filter(
       (session) => session.chainId !== chainId,
     );
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === chainId
-        ? {
-            ...chain,
-            auxiliaryStreak: 0,
-            auxiliaryFailures: chain.auxiliaryFailures + 1,
-          }
-        : chain,
+    const updatedChains = state.chains.map(() => undefined,
     );
 
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/hooks/domains/useRulesDomain.ts:66:11
     );
     const updatedChains = state.chains.map((chain) =>
       chain.id === chainId
-        ? {
-            ...chain,
-            auxiliaryStreak: 0,
-            auxiliaryFailures: chain.auxiliaryFailures + 1,
-          }
+        ? {}
         : chain,
     );
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/hooks/domains/useRulesDomain.ts:69:32
         ? {
             ...chain,
             auxiliaryStreak: 0,
-            auxiliaryFailures: chain.auxiliaryFailures + 1,
+            auxiliaryFailures: chain.auxiliaryFailures - 1,
           }
         : chain,
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/hooks/domains/useRulesDomain.ts:85:14
       'Failed to persist scheduled sessions after failure judgment',
     );
 
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-      scheduledSessions: updatedScheduledSessions,
-    }));
+    setState(() => undefined);
     setShowAuxiliaryJudgment(null);
   };
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: Cannot read properties of undefined (reading 'scheduledSessions')

[Killed] ObjectLiteral
src/hooks/domains/useRulesDomain.ts:85:25
       'Failed to persist scheduled sessions after failure judgment',
     );
 
-    setState((prev) => ({
-      ...prev,
-      chains: updatedChains,
-      chainsRevision: prev.chainsRevision + 1,
-      scheduledSessions: updatedScheduledSessions,
-    }));
+    setState((prev) => ({}));
     setShowAuxiliaryJudgment(null);
   };
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: expected undefined to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/hooks/domains/useRulesDomain.ts:98:38
     chainId: string,
     exceptionRule: string,
   ) => {
-    const updatedScheduledSessions = state.scheduledSessions.filter(
-      (session) => session.chainId !== chainId,
-    );
+    const updatedScheduledSessions = state.scheduledSessions;
     const updatedChains = state.chains.map((chain) =>
       chain.id === chainId
killedBy: useRulesDomain should allow auxiliary exception rule and persist updates
statusReason: expected "vi.fn()" to be called with arguments: [ [ ObjectContaining{…} ] ]

Received: 

  1st vi.fn() call:

  [
    [

[Killed] ArrowFunction
src/hooks/domains/useRulesDomain.ts:101:44
     const updatedScheduledSessions = state.scheduledSessions.filter(
       (session) => session.chainId !== chainId,
     );
-    const updatedChains = state.chains.map((chain) =>
-      chain.id === chainId
-        ? {
-            ...chain,
-            auxiliaryExceptions: [
-              ...(chain.auxiliaryExceptions || []),
-              exceptionRule,
-            ],
-          }
-        : chain,
+    const updatedChains = state.chains.map(() => undefined,
     );
 
killedBy: useRulesDomain should allow auxiliary exception rule and persist updates
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/hooks/domains/useRulesDomain.ts:106:19
         ? {
             ...chain,
             auxiliaryExceptions: [
-              ...(chain.auxiliaryExceptions || []),
+              ...(false),
               exceptionRule,
             ],
killedBy: useRulesDomain should allow auxiliary exception rule and persist updates
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
src/hooks/domains/useRulesDomain.ts:106:19
         ? {
             ...chain,
             auxiliaryExceptions: [
-              ...(chain.auxiliaryExceptions || []),
+              ...(true),
               exceptionRule,
             ],
killedBy: useRulesDomain should allow auxiliary exception rule and persist updates
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] StringLiteral
src/hooks/domains/useRulesDomain.ts:121:7
     persistScheduledSessions(
       chainId,
       updatedScheduledSessions,
-      'Failed to persist scheduled sessions after allow judgment',
+      "",
     );
 
killedBy: useRulesDomain logs failure context when persistence promises reject in allow-judgment flow
statusReason: expected "vi.fn()" to be called with arguments: [ 'RULES_DOMAIN', …(3) ]

Received: 

  1st vi.fn() call:

  [
    "RULES_DOMAIN",

[Killed] ObjectLiteral
src/hooks/domains/useRulesDomain.ts:133:10
     setShowAuxiliaryJudgment(null);
   };
 
-  return { handleAuxiliaryJudgmentFailure, handleAuxiliaryJudgmentAllow };
+  return {};
 }
 
killedBy: useRulesDomain should handle auxiliary failure by resetting streak and incrementing failures
statusReason: result.current.handleAuxiliaryJudgmentFailure is not a function
