[Killed] ObjectLiteral
src/hooks/domains/useSessionsDomain.ts:70:32
     handleScheduleChain,
     handleCancelScheduledSession,
     handleCompleteBooking,
-  } = createSchedulingHandlers({
-    state,
-    setState,
-    storage,
-    safelySaveChains,
-    setShowAuxiliaryJudgment,
-    tr,
-  });
+  } = createSchedulingHandlers({});
 
   const handleStartChain = createStartChainHandler({
killedBy: useSessionsDomain should compose all session handlers from submodules
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/hooks/domains/useSessionsDomain.ts:79:52
     tr,
   });
 
-  const handleStartChain = createStartChainHandler({
-    state,
-    setState,
-    storage,
-    safelySaveChains,
-    pendingChainId,
-    setPendingChainId,
-    currentSessionId,
-    setCurrentSessionId,
-    setShowBettingModal,
-    onRsipTaskEvent,
-    tr,
-  });
+  const handleStartChain = createStartChainHandler({});
 
   const { handleCompleteSession, handleInterruptSession } =
killedBy: useSessionsDomain should compose all session handlers from submodules
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/hooks/domains/useSessionsDomain.ts:94:30
   });
 
   const { handleCompleteSession, handleInterruptSession } =
-    createCompletionHandlers({
-      state,
-      setState,
-      storage,
-      safelySaveChains,
-      activeSessionId,
-      setActiveSessionId,
-      onPetTaskCompleted,
-      onRsipTaskEvent,
-      tr,
-    });
+    createCompletionHandlers({});
 
   const { handlePauseSession, handleResumeSession } = createPauseResumeHandlers(
killedBy: useSessionsDomain should compose all session handlers from submodules
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/hooks/domains/useSessionsDomain.ts:107:5
     });
 
   const { handlePauseSession, handleResumeSession } = createPauseResumeHandlers(
-    { state, setState, storage },
+    {},
   );
 
killedBy: useSessionsDomain should compose all session handlers from submodules
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
-   {
