[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:13:17
 export class DefaultErrorClassifier implements ErrorClassifier {
   private errorPatterns: Map<ExceptionRuleError, ErrorPattern>;
 
-  constructor() {
-    this.errorPatterns = createErrorPatterns();
-  }
+  constructor() {}
 
   classify(error: ExceptionRuleException): ErrorClassification {
killedBy: ExceptionRuleManager 规则创建和管理 创建重复规则应该抛出异常
statusReason: expected error to be instance of ExceptionRuleException

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:17:64
     this.errorPatterns = createErrorPatterns();
   }
 
-  classify(error: ExceptionRuleException): ErrorClassification {
-    const pattern = this.errorPatterns.get(error.type);
-
-    if (pattern) {
-      return pattern.classification;
-    }
-
-    return this.getDefaultClassification(error.type);
-  }
+  classify(error: ExceptionRuleException): ErrorClassification {}
 
   getPattern(type: ExceptionRuleError): ErrorPattern | undefined {
killedBy: ExceptionRuleManager 规则创建和管理 创建重复规则应该抛出异常
statusReason: expected error to be instance of ExceptionRuleException

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:20:9
   classify(error: ExceptionRuleException): ErrorClassification {
     const pattern = this.errorPatterns.get(error.type);
 
-    if (pattern) {
+    if (true) {
       return pattern.classification;
     }
killedBy: errorClassification/ErrorClassifiers classifies known patterns and unknown types with fallback rules
statusReason: Cannot read properties of undefined (reading 'classification')

[Survived] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:20:9
   classify(error: ExceptionRuleException): ErrorClassification {
     const pattern = this.errorPatterns.get(error.type);
 
-    if (pattern) {
+    if (false) {
       return pattern.classification;
     }

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:27:66
     return this.getDefaultClassification(error.type);
   }
 
-  getPattern(type: ExceptionRuleError): ErrorPattern | undefined {
-    return this.errorPatterns.get(type);
-  }
+  getPattern(type: ExceptionRuleError): ErrorPattern | undefined {}
 
   private getDefaultClassification(
killedBy: errorClassification/ErrorClassificationService creates enhanced errors with classification metadata
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:37:7
     switch (type) {
       case ExceptionRuleError.RULE_NOT_FOUND:
       case ExceptionRuleError.DATA_INTEGRITY_ERROR:
-      case ExceptionRuleError.RULE_STATE_INCONSISTENT:
-        return {
-          category: 'data_error',
-          severity: 'medium',
-          priority: 60,
-          recoverable: true,
-          userFriendly: true,
-          requiresImmedateAction: false,
-        };
+      case ExceptionRuleError.RULE_STATE_INCONSISTENT:
 
       case ExceptionRuleError.DUPLICATE_RULE_NAME:
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'user_error', …(5) } to deeply equal { category: 'data_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:42:24
           category: 'data_error',
           severity: 'medium',
           priority: 60,
-          recoverable: true,
+          recoverable: false,
           userFriendly: true,
           requiresImmedateAction: false,
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'data_error', …(5) } to deeply equal { category: 'data_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:43:25
           severity: 'medium',
           priority: 60,
           recoverable: true,
-          userFriendly: true,
+          userFriendly: false,
           requiresImmedateAction: false,
         };
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'data_error', …(5) } to deeply equal { category: 'data_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:44:35
           priority: 60,
           recoverable: true,
           userFriendly: true,
-          requiresImmedateAction: false,
+          requiresImmedateAction: true,
         };
 
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'data_error', …(5) } to deeply equal { category: 'data_error', …(5) }

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:49:7
 
       case ExceptionRuleError.DUPLICATE_RULE_NAME:
       case ExceptionRuleError.VALIDATION_ERROR:
-      case ExceptionRuleError.RULE_TYPE_MISMATCH:
-        return {
-          category: 'user_error',
-          severity: 'low',
-          priority: 30,
-          recoverable: true,
-          userFriendly: true,
-          requiresImmedateAction: false,
-        };
+      case ExceptionRuleError.RULE_TYPE_MISMATCH:
 
       case ExceptionRuleError.STORAGE_ERROR:
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'user_error', …(5) }

[Killed] StringLiteral
src/services/errorClassification/ErrorClassifiers.ts:52:21
       case ExceptionRuleError.RULE_TYPE_MISMATCH:
         return {
           category: 'user_error',
-          severity: 'low',
+          severity: "",
           priority: 30,
           recoverable: true,
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'user_error', …(5) } to deeply equal { category: 'user_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:54:24
           category: 'user_error',
           severity: 'low',
           priority: 30,
-          recoverable: true,
+          recoverable: false,
           userFriendly: true,
           requiresImmedateAction: false,
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'user_error', …(5) } to deeply equal { category: 'user_error', …(5) }

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:61:7
 
       case ExceptionRuleError.STORAGE_ERROR:
       case ExceptionRuleError.OPERATION_TIMEOUT:
-      case ExceptionRuleError.CONCURRENT_MODIFICATION:
-        return {
-          category: 'system_error',
-          severity: 'high',
-          priority: 80,
-          recoverable: true,
-          userFriendly: false,
-          requiresImmedateAction: true,
-        };
+      case ExceptionRuleError.CONCURRENT_MODIFICATION:
 
       case ExceptionRuleError.NETWORK_ERROR:
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'network_error', …(5) } to deeply equal { category: 'system_error', …(5) }

[Killed] ObjectLiteral
src/services/errorClassification/ErrorClassifiers.ts:62:16
       case ExceptionRuleError.STORAGE_ERROR:
       case ExceptionRuleError.OPERATION_TIMEOUT:
       case ExceptionRuleError.CONCURRENT_MODIFICATION:
-        return {
-          category: 'system_error',
-          severity: 'high',
-          priority: 80,
-          recoverable: true,
-          userFriendly: false,
-          requiresImmedateAction: true,
-        };
+        return {};
 
       case ExceptionRuleError.NETWORK_ERROR:
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected {} to deeply equal { category: 'system_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:66:24
           category: 'system_error',
           severity: 'high',
           priority: 80,
-          recoverable: true,
+          recoverable: false,
           userFriendly: false,
           requiresImmedateAction: true,
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'system_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:67:25
           severity: 'high',
           priority: 80,
           recoverable: true,
-          userFriendly: false,
+          userFriendly: true,
           requiresImmedateAction: true,
         };
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'system_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:68:35
           priority: 80,
           recoverable: true,
           userFriendly: false,
-          requiresImmedateAction: true,
+          requiresImmedateAction: false,
         };
 
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'system_error', …(5) }

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:71:7
           requiresImmedateAction: true,
         };
 
-      case ExceptionRuleError.NETWORK_ERROR:
-        return {
-          category: 'network_error',
-          severity: 'medium',
-          priority: 50,
-          recoverable: true,
-          userFriendly: true,
-          requiresImmedateAction: false,
-        };
+      case ExceptionRuleError.NETWORK_ERROR:
 
       default:
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'network_error', …(5) }

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:76:24
           category: 'network_error',
           severity: 'medium',
           priority: 50,
-          recoverable: true,
+          recoverable: false,
           userFriendly: true,
           requiresImmedateAction: false,
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'network_error', …(5) } to deeply equal { category: 'network_error', …(5) }

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:81:7
           requiresImmedateAction: false,
         };
 
-      default:
-        return {
-          category: 'system_error',
-          severity: 'medium',
-          priority: 50,
-          recoverable: true,
-          userFriendly: false,
-          requiresImmedateAction: false,
-        };
+      default:
     }
   }
killedBy: errorClassification/ErrorClassifiers classifies known patterns and unknown types with fallback rules
statusReason: expected undefined to deeply equal ObjectContaining{…}

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:88:35
           priority: 50,
           recoverable: true,
           userFriendly: false,
-          requiresImmedateAction: false,
+          requiresImmedateAction: true,
         };
     }
killedBy: errorClassification/ErrorClassifiers uses default classification matrix when no pattern exists for the error type
statusReason: expected { category: 'system_error', …(5) } to deeply equal { category: 'system_error', …(5) }

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:97:11
 export function calculateConfidence(
   error: ExceptionRuleException,
   pattern?: ErrorPattern,
-): number {
-  if (!pattern) return 0.5;
-
-  let confidence = 0.7;
-
-  const message = error.message.toLowerCase();
-  const matchedKeywords = pattern.keywords.filter((keyword) =>
-    message.includes(keyword.toLowerCase()),
-  );
-
-  confidence += (matchedKeywords.length / pattern.keywords.length) * 0.3;
-
-  return Math.min(confidence, 1.0);
-}
+): number {}
 
 export function generateRecommendations(
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected undefined to be 0.5 // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:98:7
   error: ExceptionRuleException,
   pattern?: ErrorPattern,
 ): number {
-  if (!pattern) return 0.5;
+  if (false) return 0.5;
 
   let confidence = 0.7;
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: Cannot read properties of undefined (reading 'keywords')

[Killed] BooleanLiteral
src/services/errorClassification/ErrorClassifiers.ts:98:7
   error: ExceptionRuleException,
   pattern?: ErrorPattern,
 ): number {
-  if (!pattern) return 0.5;
+  if (pattern) return 0.5;
 
   let confidence = 0.7;
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: Cannot read properties of undefined (reading 'keywords')

[Killed] MethodExpression
src/services/errorClassification/ErrorClassifiers.ts:102:19
 
   let confidence = 0.7;
 
-  const message = error.message.toLowerCase();
+  const message = error.message.toUpperCase();
   const matchedKeywords = pattern.keywords.filter((keyword) =>
     message.includes(keyword.toLowerCase()),
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 0.7 to be greater than 0.7

[Killed] ArrowFunction
src/services/errorClassification/ErrorClassifiers.ts:103:51
   let confidence = 0.7;
 
   const message = error.message.toLowerCase();
-  const matchedKeywords = pattern.keywords.filter((keyword) =>
-    message.includes(keyword.toLowerCase()),
+  const matchedKeywords = pattern.keywords.filter(() => undefined,
   );
 
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 0.7 to be greater than 0.7

[Killed] MethodExpression
src/services/errorClassification/ErrorClassifiers.ts:103:27
   let confidence = 0.7;
 
   const message = error.message.toLowerCase();
-  const matchedKeywords = pattern.keywords.filter((keyword) =>
-    message.includes(keyword.toLowerCase()),
-  );
+  const matchedKeywords = pattern.keywords;
 
   confidence += (matchedKeywords.length / pattern.keywords.length) * 0.3;
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 1 to be 0.85 // Object.is equality

[Killed] MethodExpression
src/services/errorClassification/ErrorClassifiers.ts:104:22
 
   const message = error.message.toLowerCase();
   const matchedKeywords = pattern.keywords.filter((keyword) =>
-    message.includes(keyword.toLowerCase()),
+    message.includes(keyword.toUpperCase()),
   );
 
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 0.7 to be greater than 0.7

[Killed] AssignmentOperator
src/services/errorClassification/ErrorClassifiers.ts:107:3
     message.includes(keyword.toLowerCase()),
   );
 
-  confidence += (matchedKeywords.length / pattern.keywords.length) * 0.3;
+  confidence -= matchedKeywords.length / pattern.keywords.length * 0.3;
 
   return Math.min(confidence, 1.0);
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 0.6 to be greater than 0.7

[Killed] ArithmeticOperator
src/services/errorClassification/ErrorClassifiers.ts:107:18
     message.includes(keyword.toLowerCase()),
   );
 
-  confidence += (matchedKeywords.length / pattern.keywords.length) * 0.3;
+  confidence += (matchedKeywords.length * pattern.keywords.length) * 0.3;
 
   return Math.min(confidence, 1.0);
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 1 to be 0.85 // Object.is equality

[Killed] MethodExpression
src/services/errorClassification/ErrorClassifiers.ts:109:10
 
   confidence += (matchedKeywords.length / pattern.keywords.length) * 0.3;
 
-  return Math.min(confidence, 1.0);
+  return Math.max(confidence, 1.0);
 }
 
killedBy: errorClassification/ErrorClassifiers calculates confidence with and without a matched pattern
statusReason: expected 1 to be 0.85 // Object.is equality

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:116:13
   _error: ExceptionRuleException,
   classification: ErrorClassification,
   pattern?: ErrorPattern,
-): string[] {
-  const recommendations: string[] = [];
-
-  if (pattern) {
-    recommendations.push(...pattern.recommendedActions);
-  }
-
-  if (classification.severity === 'critical') {
-    recommendations.unshift('立即联系技术支持');
-  }
-
-  if (classification.recoverable) {
-    recommendations.push('尝试重新执行操作');
-  }
-
-  return [...new Set(recommendations)];
-}
+): string[] {}
 
 export function generateUserFriendlyMessage(
killedBy: errorClassification/ErrorClassifiers deduplicates recommendations and prepends critical guidance
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:119:16
 ): string[] {
   const recommendations: string[] = [];
 
-  if (pattern) {
-    recommendations.push(...pattern.recommendedActions);
-  }
+  if (pattern) {}
 
   if (classification.severity === 'critical') {
killedBy: errorClassification/ErrorClassifiers deduplicates recommendations and prepends critical guidance
statusReason: expected [ '立即联系技术支持', '尝试重新执行操作' ] to include 'retry-now'

[Killed] EqualityOperator
src/services/errorClassification/ErrorClassifiers.ts:123:7
     recommendations.push(...pattern.recommendedActions);
   }
 
-  if (classification.severity === 'critical') {
+  if (classification.severity !== 'critical') {
     recommendations.unshift('立即联系技术支持');
   }
killedBy: errorClassification/ErrorClassifiers deduplicates recommendations and prepends critical guidance
statusReason: expected 'retry-now' not to be 'retry-now' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:123:7
     recommendations.push(...pattern.recommendedActions);
   }
 
-  if (classification.severity === 'critical') {
+  if (false) {
     recommendations.unshift('立即联系技术支持');
   }
killedBy: errorClassification/ErrorClassifiers deduplicates recommendations and prepends critical guidance
statusReason: expected 'retry-now' not to be 'retry-now' // Object.is equality

[Survived] StringLiteral
src/services/errorClassification/ErrorClassifiers.ts:124:29
   }
 
   if (classification.severity === 'critical') {
-    recommendations.unshift('立即联系技术支持');
+    recommendations.unshift("");
   }
 

[Survived] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:127:7
     recommendations.unshift('立即联系技术支持');
   }
 
-  if (classification.recoverable) {
+  if (false) {
     recommendations.push('尝试重新执行操作');
   }

[Survived] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:127:35
     recommendations.unshift('立即联系技术支持');
   }
 
-  if (classification.recoverable) {
-    recommendations.push('尝试重新执行操作');
-  }
+  if (classification.recoverable) {}
 
   return [...new Set(recommendations)];

[Survived] StringLiteral
src/services/errorClassification/ErrorClassifiers.ts:128:26
   }
 
   if (classification.recoverable) {
-    recommendations.push('尝试重新执行操作');
+    recommendations.push("");
   }
 

[Killed] BlockStatement
src/services/errorClassification/ErrorClassifiers.ts:138:11
   type: ExceptionRuleError,
   message: string,
   pattern?: ErrorPattern,
-): string {
-  if (pattern && pattern.classification.userFriendly) {
-    switch (type) {
-      case ExceptionRuleError.RULE_NOT_FOUND:
-        return '找不到指定的规则，可能已被删除或移动';
-      case ExceptionRuleError.DUPLICATE_RULE_NAME:
-        return '规则名称已存在，请选择不同的名称';
-      case ExceptionRuleError.RULE_TYPE_MISMATCH:
-        return '所选规则类型与当前操作不匹配';
-      case ExceptionRuleError.VALIDATION_ERROR:
-        return '输入的信息不符合要求，请检查后重试';
-      case ExceptionRuleError.NETWORK_ERROR:
-        return '网络连接出现问题，请检查网络后重试';
-      default:
-        return message;
-    }
-  }
-
-  return message;
-}
+): string {}
 
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected undefined to be 'raw message' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:139:7
   message: string,
   pattern?: ErrorPattern,
 ): string {
-  if (pattern && pattern.classification.userFriendly) {
+  if (false) {
     switch (type) {
       case ExceptionRuleError.RULE_NOT_FOUND:
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected 'raw message' not to be 'raw message' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:139:7
   message: string,
   pattern?: ErrorPattern,
 ): string {
-  if (pattern && pattern.classification.userFriendly) {
+  if (true) {
     switch (type) {
       case ExceptionRuleError.RULE_NOT_FOUND:
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '规则名称已存在，请选择不同的名称' to be 'raw message' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:141:7
 ): string {
   if (pattern && pattern.classification.userFriendly) {
     switch (type) {
-      case ExceptionRuleError.RULE_NOT_FOUND:
-        return '找不到指定的规则，可能已被删除或移动';
+      case ExceptionRuleError.RULE_NOT_FOUND:
       case ExceptionRuleError.DUPLICATE_RULE_NAME:
         return '规则名称已存在，请选择不同的名称';
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '规则名称已存在，请选择不同的名称' to be '找不到指定的规则，可能已被删除或移动' // Object.is equality

[Survived] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:143:7
     switch (type) {
       case ExceptionRuleError.RULE_NOT_FOUND:
         return '找不到指定的规则，可能已被删除或移动';
-      case ExceptionRuleError.DUPLICATE_RULE_NAME:
-        return '规则名称已存在，请选择不同的名称';
+      case ExceptionRuleError.DUPLICATE_RULE_NAME:
       case ExceptionRuleError.RULE_TYPE_MISMATCH:
         return '所选规则类型与当前操作不匹配';

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:145:7
         return '找不到指定的规则，可能已被删除或移动';
       case ExceptionRuleError.DUPLICATE_RULE_NAME:
         return '规则名称已存在，请选择不同的名称';
-      case ExceptionRuleError.RULE_TYPE_MISMATCH:
-        return '所选规则类型与当前操作不匹配';
+      case ExceptionRuleError.RULE_TYPE_MISMATCH:
       case ExceptionRuleError.VALIDATION_ERROR:
         return '输入的信息不符合要求，请检查后重试';
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '输入的信息不符合要求，请检查后重试' to be '所选规则类型与当前操作不匹配' // Object.is equality

[Killed] StringLiteral
src/services/errorClassification/ErrorClassifiers.ts:146:16
       case ExceptionRuleError.DUPLICATE_RULE_NAME:
         return '规则名称已存在，请选择不同的名称';
       case ExceptionRuleError.RULE_TYPE_MISMATCH:
-        return '所选规则类型与当前操作不匹配';
+        return "";
       case ExceptionRuleError.VALIDATION_ERROR:
         return '输入的信息不符合要求，请检查后重试';
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '' to be '所选规则类型与当前操作不匹配' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:147:7
         return '规则名称已存在，请选择不同的名称';
       case ExceptionRuleError.RULE_TYPE_MISMATCH:
         return '所选规则类型与当前操作不匹配';
-      case ExceptionRuleError.VALIDATION_ERROR:
-        return '输入的信息不符合要求，请检查后重试';
+      case ExceptionRuleError.VALIDATION_ERROR:
       case ExceptionRuleError.NETWORK_ERROR:
         return '网络连接出现问题，请检查网络后重试';
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '网络连接出现问题，请检查网络后重试' to be '输入的信息不符合要求，请检查后重试' // Object.is equality

[Killed] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:149:7
         return '所选规则类型与当前操作不匹配';
       case ExceptionRuleError.VALIDATION_ERROR:
         return '输入的信息不符合要求，请检查后重试';
-      case ExceptionRuleError.NETWORK_ERROR:
-        return '网络连接出现问题，请检查网络后重试';
+      case ExceptionRuleError.NETWORK_ERROR:
       default:
         return message;
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected 'raw' to be '网络连接出现问题，请检查网络后重试' // Object.is equality

[Killed] StringLiteral
src/services/errorClassification/ErrorClassifiers.ts:150:16
       case ExceptionRuleError.VALIDATION_ERROR:
         return '输入的信息不符合要求，请检查后重试';
       case ExceptionRuleError.NETWORK_ERROR:
-        return '网络连接出现问题，请检查网络后重试';
+        return "";
       default:
         return message;
killedBy: errorClassification/ErrorClassifiers generates user-facing message for friendly patterns and keeps raw message otherwise
statusReason: expected '' to be '网络连接出现问题，请检查网络后重试' // Object.is equality

[Survived] ConditionalExpression
src/services/errorClassification/ErrorClassifiers.ts:151:7
         return '输入的信息不符合要求，请检查后重试';
       case ExceptionRuleError.NETWORK_ERROR:
         return '网络连接出现问题，请检查网络后重试';
-      default:
-        return message;
+      default:
     }
   }
