[Killed] BlockStatement
src/services/recovery/RecoveryStrategy.ts:75:54
    * 注册恢复策略
    * @param strategy 要注册的恢复策略
    */
-  registerStrategy(strategy: RecoveryStrategy): void {
-    if (!this.strategies.has(strategy.errorType)) {
-      this.strategies.set(strategy.errorType, []);
-    }
-
-    const strategies = this.strategies.get(strategy.errorType)!;
-    strategies.push(strategy);
-
-    // 按优先级排序（高优先级在前）
-    strategies.sort((a, b) => b.priority - a.priority);
-  }
+  registerStrategy(strategy: RecoveryStrategy): void {}
 
   /**
killedBy: recovery/DefaultStrategies registers built-in strategies for expected error types
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/recovery/RecoveryStrategy.ts:76:9
    * @param strategy 要注册的恢复策略
    */
   registerStrategy(strategy: RecoveryStrategy): void {
-    if (!this.strategies.has(strategy.errorType)) {
+    if (true) {
       this.strategies.set(strategy.errorType, []);
     }
killedBy: recovery/RecoveryStrategyRegistry registers strategies and keeps them sorted by priority descending
statusReason: expected [ Array(1) ] to have a length of 3 but got 1

[Killed] BooleanLiteral
src/services/recovery/RecoveryStrategy.ts:76:9
    * @param strategy 要注册的恢复策略
    */
   registerStrategy(strategy: RecoveryStrategy): void {
-    if (!this.strategies.has(strategy.errorType)) {
+    if (this.strategies.has(strategy.errorType)) {
       this.strategies.set(strategy.errorType, []);
     }
killedBy: recovery/DefaultStrategies registers built-in strategies for expected error types
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
src/services/recovery/RecoveryStrategy.ts:84:31
     strategies.push(strategy);
 
     // 按优先级排序（高优先级在前）
-    strategies.sort((a, b) => b.priority - a.priority);
+    strategies.sort((a, b) => b.priority + a.priority);
   }
 
killedBy: recovery/RecoveryStrategyRegistry registers strategies and keeps them sorted by priority descending
statusReason: expected [ 1, 10, 5 ] to deeply equal [ 10, 5, 1 ]

[Killed] MethodExpression
src/services/recovery/RecoveryStrategy.ts:84:5
     strategies.push(strategy);
 
     // 按优先级排序（高优先级在前）
-    strategies.sort((a, b) => b.priority - a.priority);
+    strategies;
   }
 
killedBy: recovery/RecoveryStrategyRegistry registers strategies and keeps them sorted by priority descending
statusReason: expected [ 1, 10, 5 ] to deeply equal [ 10, 5, 1 ]

[Killed] BlockStatement
src/services/recovery/RecoveryStrategy.ts:92:68
    * @param errorType 错误类型
    * @returns 已排序的策略列表
    */
-  getStrategies(errorType: ExceptionRuleError): RecoveryStrategy[] {
-    return this.strategies.get(errorType) || [];
-  }
+  getStrategies(errorType: ExceptionRuleError): RecoveryStrategy[] {}
 
   /**
killedBy: recovery/DefaultStrategies handles missing rules by recovering temporary rules or returning user actions
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/services/recovery/RecoveryStrategy.ts:93:12
    * @returns 已排序的策略列表
    */
   getStrategies(errorType: ExceptionRuleError): RecoveryStrategy[] {
-    return this.strategies.get(errorType) || [];
+    return true;
   }
 
killedBy: recovery/DefaultStrategies handles missing rules by recovering temporary rules or returning user actions
statusReason: Cannot read properties of undefined (reading 'handler')

[Killed] ConditionalExpression
src/services/recovery/RecoveryStrategy.ts:93:12
    * @returns 已排序的策略列表
    */
   getStrategies(errorType: ExceptionRuleError): RecoveryStrategy[] {
-    return this.strategies.get(errorType) || [];
+    return false;
   }
 
killedBy: recovery/DefaultStrategies handles missing rules by recovering temporary rules or returning user actions
statusReason: Cannot read properties of undefined (reading 'handler')

[Killed] BlockStatement
src/services/recovery/RecoveryStrategy.ts:100:57
    * 检查是否有指定错误类型的策略
    * @param errorType 错误类型
    */
-  hasStrategies(errorType: ExceptionRuleError): boolean {
-    const strategies = this.strategies.get(errorType);
-    return strategies !== undefined && strategies.length > 0;
-  }
+  hasStrategies(errorType: ExceptionRuleError): boolean {}
 
   /**
killedBy: recovery/DefaultStrategies registers built-in strategies for expected error types
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/services/recovery/RecoveryStrategy.ts:102:12
    */
   hasStrategies(errorType: ExceptionRuleError): boolean {
     const strategies = this.strategies.get(errorType);
-    return strategies !== undefined && strategies.length > 0;
+    return strategies === undefined && strategies.length > 0;
   }
 
killedBy: recovery/DefaultStrategies registers built-in strategies for expected error types
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/recovery/RecoveryStrategy.ts:102:12
    */
   hasStrategies(errorType: ExceptionRuleError): boolean {
     const strategies = this.strategies.get(errorType);
-    return strategies !== undefined && strategies.length > 0;
+    return false;
   }
 
killedBy: recovery/DefaultStrategies registers built-in strategies for expected error types
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/services/recovery/RecoveryStrategy.ts:108:17
   /**
    * 清除所有策略
    */
-  clear(): void {
-    this.strategies.clear();
-  }
+  clear(): void {}
 }
 
