[Killed] BlockStatement
src/utils/storage/chains.ts:14:38
   lastCompletedAt?: string;
 }
 
-export function getChains(): Chain[] {
-  const data = localStorage.getItem(STORAGE_KEYS.CHAINS);
-  if (!data) return [];
-
-  return JSON.parse(data).map(
-    (chain: RawChainData & Record<string, unknown>) => ({
-      ...chain,
-      auxiliaryStreak: chain.auxiliaryStreak || 0,
-      auxiliaryFailures: chain.auxiliaryFailures || 0,
-      auxiliaryExceptions: chain.auxiliaryExceptions || [],
-      deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
-      createdAt: new Date(chain.createdAt),
-      lastCompletedAt: chain.lastCompletedAt
-        ? new Date(chain.lastCompletedAt)
-        : undefined,
-    }),
-  );
-}
+export function getChains(): Chain[] {}
 
 export function saveChains(chains: Chain[]): void {
killedBy: storage/chains returns empty array when chains are missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/chains.ts:16:7
 
 export function getChains(): Chain[] {
   const data = localStorage.getItem(STORAGE_KEYS.CHAINS);
-  if (!data) return [];
+  if (true) return [];
 
   return JSON.parse(data).map(
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/utils/storage/chains.ts:16:7
 
 export function getChains(): Chain[] {
   const data = localStorage.getItem(STORAGE_KEYS.CHAINS);
-  if (!data) return [];
+  if (false) return [];
 
   return JSON.parse(data).map(
killedBy: storage/chains returns empty array when chains are missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/utils/storage/chains.ts:19:5
   if (!data) return [];
 
   return JSON.parse(data).map(
-    (chain: RawChainData & Record<string, unknown>) => ({
-      ...chain,
-      auxiliaryStreak: chain.auxiliaryStreak || 0,
-      auxiliaryFailures: chain.auxiliaryFailures || 0,
-      auxiliaryExceptions: chain.auxiliaryExceptions || [],
-      deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
-      createdAt: new Date(chain.createdAt),
-      lastCompletedAt: chain.lastCompletedAt
-        ? new Date(chain.lastCompletedAt)
-        : undefined,
-    }),
+    () => undefined,
   );
 }
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/utils/storage/chains.ts:19:57
   if (!data) return [];
 
   return JSON.parse(data).map(
-    (chain: RawChainData & Record<string, unknown>) => ({
-      ...chain,
-      auxiliaryStreak: chain.auxiliaryStreak || 0,
-      auxiliaryFailures: chain.auxiliaryFailures || 0,
-      auxiliaryExceptions: chain.auxiliaryExceptions || [],
-      deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
-      createdAt: new Date(chain.createdAt),
-      lastCompletedAt: chain.lastCompletedAt
-        ? new Date(chain.lastCompletedAt)
-        : undefined,
-    }),
+    (chain: RawChainData & Record<string, unknown>) => ({}),
   );
 }
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/utils/storage/chains.ts:21:24
   return JSON.parse(data).map(
     (chain: RawChainData & Record<string, unknown>) => ({
       ...chain,
-      auxiliaryStreak: chain.auxiliaryStreak || 0,
+      auxiliaryStreak: false,
       auxiliaryFailures: chain.auxiliaryFailures || 0,
       auxiliaryExceptions: chain.auxiliaryExceptions || [],
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected false to be +0 // Object.is equality

[Killed] LogicalOperator
src/utils/storage/chains.ts:21:24
   return JSON.parse(data).map(
     (chain: RawChainData & Record<string, unknown>) => ({
       ...chain,
-      auxiliaryStreak: chain.auxiliaryStreak || 0,
+      auxiliaryStreak: chain.auxiliaryStreak && 0,
       auxiliaryFailures: chain.auxiliaryFailures || 0,
       auxiliaryExceptions: chain.auxiliaryExceptions || [],
killedBy: storage/chains preserves existing auxiliary values when they are present
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utils/storage/chains.ts:22:26
     (chain: RawChainData & Record<string, unknown>) => ({
       ...chain,
       auxiliaryStreak: chain.auxiliaryStreak || 0,
-      auxiliaryFailures: chain.auxiliaryFailures || 0,
+      auxiliaryFailures: false,
       auxiliaryExceptions: chain.auxiliaryExceptions || [],
       deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected false to be +0 // Object.is equality

[Killed] LogicalOperator
src/utils/storage/chains.ts:22:26
     (chain: RawChainData & Record<string, unknown>) => ({
       ...chain,
       auxiliaryStreak: chain.auxiliaryStreak || 0,
-      auxiliaryFailures: chain.auxiliaryFailures || 0,
+      auxiliaryFailures: chain.auxiliaryFailures && 0,
       auxiliaryExceptions: chain.auxiliaryExceptions || [],
       deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
killedBy: storage/chains preserves existing auxiliary values when they are present
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/utils/storage/chains.ts:23:28
       ...chain,
       auxiliaryStreak: chain.auxiliaryStreak || 0,
       auxiliaryFailures: chain.auxiliaryFailures || 0,
-      auxiliaryExceptions: chain.auxiliaryExceptions || [],
+      auxiliaryExceptions: false,
       deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
       createdAt: new Date(chain.createdAt),
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected false to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/chains.ts:23:28
       ...chain,
       auxiliaryStreak: chain.auxiliaryStreak || 0,
       auxiliaryFailures: chain.auxiliaryFailures || 0,
-      auxiliaryExceptions: chain.auxiliaryExceptions || [],
+      auxiliaryExceptions: true,
       deletedAt: chain.deletedAt ? new Date(chain.deletedAt) : null,
       createdAt: new Date(chain.createdAt),
killedBy: storage/chains hydrates date fields and default legacy values
statusReason: expected true to deeply equal []

[Killed] BlockStatement
src/utils/storage/chains.ts:33:51
   );
 }
 
-export function saveChains(chains: Chain[]): void {
-  localStorage.setItem(STORAGE_KEYS.CHAINS, JSON.stringify(chains));
-}
+export function saveChains(chains: Chain[]): void {}
 
 export function getActiveChains(): Chain[] {
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [] to deeply equal [ 'active-1' ]

[Killed] BlockStatement
src/utils/storage/chains.ts:37:44
   localStorage.setItem(STORAGE_KEYS.CHAINS, JSON.stringify(chains));
 }
 
-export function getActiveChains(): Chain[] {
-  return getChains().filter((chain) => chain.deletedAt == null);
-}
+export function getActiveChains(): Chain[] {}
 
 export function getDeletedChains(): DeletedChain[] {
killedBy: storage/chains returns empty array when chains are missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/chains.ts:38:40
 }
 
 export function getActiveChains(): Chain[] {
-  return getChains().filter((chain) => chain.deletedAt == null);
+  return getChains().filter((chain) => false);
 }
 
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [] to deeply equal [ 'active-1' ]

[Killed] ConditionalExpression
src/utils/storage/chains.ts:38:40
 }
 
 export function getActiveChains(): Chain[] {
-  return getChains().filter((chain) => chain.deletedAt == null);
+  return getChains().filter((chain) => true);
 }
 
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [ 'active-1', 'deleted-older', …(1) ] to deeply equal [ 'active-1' ]

[Killed] BlockStatement
src/utils/storage/chains.ts:41:52
   return getChains().filter((chain) => chain.deletedAt == null);
 }
 
-export function getDeletedChains(): DeletedChain[] {
-  return getChains()
-    .filter((chain) => chain.deletedAt != null)
-    .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
-    .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
-}
+export function getDeletedChains(): DeletedChain[] {}
 
 export function softDeleteChain(chainId: string): void {
killedBy: storage/chains returns empty array when chains are missing
statusReason: expected undefined to deeply equal []

[Killed] MethodExpression
src/utils/storage/chains.ts:42:10
 }
 
 export function getDeletedChains(): DeletedChain[] {
-  return getChains()
-    .filter((chain) => chain.deletedAt != null)
+  return getChains()
     .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] MethodExpression
src/utils/storage/chains.ts:42:10
 }
 
 export function getDeletedChains(): DeletedChain[] {
-  return getChains()
-    .filter((chain) => chain.deletedAt != null)
-    .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
-    .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
+  return getChains().filter(chain => chain.deletedAt != null).map(chain => ({
+  ...chain,
+  deletedAt: chain.deletedAt!
+}));
 }
 
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [ 'deleted-older', 'deleted-newer' ] to deeply equal [ 'deleted-newer', 'deleted-older' ]

[Killed] ConditionalExpression
src/utils/storage/chains.ts:43:24
 
 export function getDeletedChains(): DeletedChain[] {
   return getChains()
-    .filter((chain) => chain.deletedAt != null)
+    .filter((chain) => false)
     .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [] to deeply equal [ 'deleted-newer', 'deleted-older' ]

[Killed] ConditionalExpression
src/utils/storage/chains.ts:43:24
 
 export function getDeletedChains(): DeletedChain[] {
   return getChains()
-    .filter((chain) => chain.deletedAt != null)
+    .filter((chain) => true)
     .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] ArrowFunction
src/utils/storage/chains.ts:44:10
 export function getDeletedChains(): DeletedChain[] {
   return getChains()
     .filter((chain) => chain.deletedAt != null)
-    .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
+    .map(() => undefined)
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
 }
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/utils/storage/chains.ts:44:22
 export function getDeletedChains(): DeletedChain[] {
   return getChains()
     .filter((chain) => chain.deletedAt != null)
-    .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
+    .map((chain) => ({}))
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
 }
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] ArrowFunction
src/utils/storage/chains.ts:45:11
   return getChains()
     .filter((chain) => chain.deletedAt != null)
     .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
-    .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
+    .sort(() => undefined);
 }
 
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [ 'deleted-older', 'deleted-newer' ] to deeply equal [ 'deleted-newer', 'deleted-older' ]

[Killed] ArithmeticOperator
src/utils/storage/chains.ts:45:21
   return getChains()
     .filter((chain) => chain.deletedAt != null)
     .map((chain) => ({ ...chain, deletedAt: chain.deletedAt! }))
-    .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
+    .sort((a, b) => b.deletedAt.getTime() + a.deletedAt.getTime());
 }
 
killedBy: storage/chains keeps active/deleted buckets separated and sorts deleted chains by deletion time desc
statusReason: expected [ 'deleted-older', 'deleted-newer' ] to deeply equal [ 'deleted-newer', 'deleted-older' ]

[Killed] BlockStatement
src/utils/storage/chains.ts:48:56
     .sort((a, b) => b.deletedAt.getTime() - a.deletedAt.getTime());
 }
 
-export function softDeleteChain(chainId: string): void {
-  const chains = getChains();
-  const descendants = collectDescendantIds(chainId, chains);
-  const targets = new Set([chainId, ...descendants]);
-
-  const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: new Date() };
-    }
-    return chain;
-  });
-
-  saveChains(updatedChains);
-}
+export function softDeleteChain(chainId: string): void {}
 
 export function restoreChain(chainId: string): void {
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] BlockStatement
src/utils/storage/chains.ts:53:47
   const descendants = collectDescendantIds(chainId, chains);
   const targets = new Set([chainId, ...descendants]);
 
-  const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: new Date() };
-    }
-    return chain;
-  });
+  const updatedChains = chains.map((chain) => {});
 
   saveChains(updatedChains);
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: Cannot read properties of null (reading 'auxiliaryStreak')

[Killed] ConditionalExpression
src/utils/storage/chains.ts:54:9
   const targets = new Set([chainId, ...descendants]);
 
   const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
+    if (true) {
       return { ...chain, deletedAt: new Date() };
     }
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [ Array(4) ] to not include 'outsider'

[Killed] BlockStatement
src/utils/storage/chains.ts:54:32
   const targets = new Set([chainId, ...descendants]);
 
   const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: new Date() };
-    }
+    if (targets.has(chain.id)) {}
     return chain;
   });
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] BlockStatement
src/utils/storage/chains.ts:63:53
   saveChains(updatedChains);
 }
 
-export function restoreChain(chainId: string): void {
-  const chains = getChains();
-  const descendants = collectDescendantIds(chainId, chains);
-  const targets = new Set([chainId, ...descendants]);
-
-  const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: null };
-    }
-    return chain;
-  });
-
-  saveChains(updatedChains);
-}
+export function restoreChain(chainId: string): void {}
 
 export function permanentlyDeleteChain(chainId: string): void {
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [ { id: 'root', …(22) }, …(2) ] to have a length of +0 but got 3

[Killed] BlockStatement
src/utils/storage/chains.ts:68:47
   const descendants = collectDescendantIds(chainId, chains);
   const targets = new Set([chainId, ...descendants]);
 
-  const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: null };
-    }
-    return chain;
-  });
+  const updatedChains = chains.map((chain) => {});
 
   saveChains(updatedChains);
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: Cannot read properties of null (reading 'auxiliaryStreak')

[Killed] BlockStatement
src/utils/storage/chains.ts:69:32
   const targets = new Set([chainId, ...descendants]);
 
   const updatedChains = chains.map((chain) => {
-    if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: null };
-    }
+    if (targets.has(chain.id)) {}
     return chain;
   });
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [ { id: 'root', …(22) }, …(2) ] to have a length of +0 but got 3

[Killed] ObjectLiteral
src/utils/storage/chains.ts:70:14
 
   const updatedChains = chains.map((chain) => {
     if (targets.has(chain.id)) {
-      return { ...chain, deletedAt: null };
+      return {};
     }
     return chain;
killedBy: storage/chains soft-deletes and restores root + descendants only
statusReason: expected [ 'outsider', undefined, …(2) ] to deeply equal [ Array(4) ]

[Killed] BlockStatement
src/utils/storage/chains.ts:78:63
   saveChains(updatedChains);
 }
 
-export function permanentlyDeleteChain(chainId: string): void {
-  const chains = getChains();
-  const descendants = collectDescendantIds(chainId, chains);
-  const targets = new Set([chainId, ...descendants]);
-
-  const updatedChains = chains.filter((chain) => !targets.has(chain.id));
-  saveChains(updatedChains);
-}
+export function permanentlyDeleteChain(chainId: string): void {}
 
 export function cleanupExpiredDeletedChains(
killedBy: storage/chains permanently deletes root + descendants
statusReason: expected [ 'root', 'child', 'outsider' ] to deeply equal [ 'outsider' ]

[Killed] ArrowFunction
src/utils/storage/chains.ts:83:39
   const descendants = collectDescendantIds(chainId, chains);
   const targets = new Set([chainId, ...descendants]);
 
-  const updatedChains = chains.filter((chain) => !targets.has(chain.id));
+  const updatedChains = chains.filter(() => undefined);
   saveChains(updatedChains);
 }
killedBy: storage/chains permanently deletes root + descendants
statusReason: expected [] to deeply equal [ 'outsider' ]

[Killed] BooleanLiteral
src/utils/storage/chains.ts:83:50
   const descendants = collectDescendantIds(chainId, chains);
   const targets = new Set([chainId, ...descendants]);
 
-  const updatedChains = chains.filter((chain) => !targets.has(chain.id));
+  const updatedChains = chains.filter((chain) => targets.has(chain.id));
   saveChains(updatedChains);
 }
killedBy: storage/chains permanently deletes root + descendants
statusReason: expected [ 'root', 'child' ] to deeply equal [ 'outsider' ]

[Killed] BlockStatement
src/utils/storage/chains.ts:89:11
 
 export function cleanupExpiredDeletedChains(
   olderThanDays: number = 30,
-): number {
-  const chains = getChains();
-  const cutoffDate = new Date();
-  cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
-
-  const chainsToDelete = chains.filter(
-    (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
-  );
-  const remainingChains = chains.filter(
-    (chain) => !chain.deletedAt || chain.deletedAt >= cutoffDate,
-  );
-
-  saveChains(remainingChains);
-  return chainsToDelete.length;
-}
+): number {}
 
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/utils/storage/chains.ts:92:3
 ): number {
   const chains = getChains();
   const cutoffDate = new Date();
-  cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
+  cutoffDate.setTime(cutoffDate.getDate() - olderThanDays);
 
   const chainsToDelete = chains.filter(
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/utils/storage/chains.ts:92:22
 ): number {
   const chains = getChains();
   const cutoffDate = new Date();
-  cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
+  cutoffDate.setDate(cutoffDate.getDate() + olderThanDays);
 
   const chainsToDelete = chains.filter(
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/utils/storage/chains.ts:94:26
   const cutoffDate = new Date();
   cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
 
-  const chainsToDelete = chains.filter(
-    (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
-  );
+  const chainsToDelete = chains;
   const remainingChains = chains.filter(
     (chain) => !chain.deletedAt || chain.deletedAt >= cutoffDate,
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/storage/chains.ts:95:16
   cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
 
   const chainsToDelete = chains.filter(
-    (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
+    (chain) => false,
   );
   const remainingChains = chains.filter(
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/storage/chains.ts:95:35
   cutoffDate.setDate(cutoffDate.getDate() - olderThanDays);
 
   const chainsToDelete = chains.filter(
-    (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
+    (chain) => chain.deletedAt && true,
   );
   const remainingChains = chains.filter(
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/utils/storage/chains.ts:97:27
   const chainsToDelete = chains.filter(
     (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
   );
-  const remainingChains = chains.filter(
-    (chain) => !chain.deletedAt || chain.deletedAt >= cutoffDate,
-  );
+  const remainingChains = chains;
 
   saveChains(remainingChains);
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected [ 'delete-old', 'keep-active', …(1) ] to deeply equal [ 'keep-active', 'keep-recent' ]

[Killed] BooleanLiteral
src/utils/storage/chains.ts:98:16
     (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
   );
   const remainingChains = chains.filter(
-    (chain) => !chain.deletedAt || chain.deletedAt >= cutoffDate,
+    (chain) => chain.deletedAt || chain.deletedAt >= cutoffDate,
   );
 
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected [ 'delete-old', 'keep-recent' ] to deeply equal [ 'keep-active', 'keep-recent' ]

[Killed] ArrowFunction
src/utils/storage/chains.ts:98:5
     (chain) => chain.deletedAt && chain.deletedAt < cutoffDate,
   );
   const remainingChains = chains.filter(
-    (chain) => !chain.deletedAt || chain.deletedAt >= cutoffDate,
+    () => undefined,
   );
 
killedBy: storage/chains cleans up expired deleted chains based on threshold
statusReason: expected [] to deeply equal [ 'keep-active', 'keep-recent' ]
