[Killed] BlockStatement
src/utils/storage/pet.ts:4:48
 import type { PetState, SerializedPetState } from '../../types/pet';
 import { STORAGE_KEYS } from './keys';
 
-export function getPetState(): PetState | null {
-  const data = localStorage.getItem(STORAGE_KEYS.PET_STATE);
-  if (!data) return null;
-
-  const serialized: SerializedPetState = JSON.parse(data);
-  return {
-    ...serialized,
-    // Migration: add default values for new fields if they don't exist
-    isMinimized: serialized.isMinimized ?? false,
-    minimizedPosition: serialized.minimizedPosition ?? { x: 92, y: 2 },
-    createdAt: new Date(serialized.createdAt),
-    lastFedAt: new Date(serialized.lastFedAt),
-    lastInteractedAt: new Date(serialized.lastInteractedAt),
-    lastDecayCalculatedAt: new Date(serialized.lastDecayCalculatedAt),
-  };
-}
+export function getPetState(): PetState | null {}
 
 export function savePetState(pet: PetState): void {
killedBy: storage/pet returns null when pet state is missing
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/utils/storage/pet.ts:6:7
 
 export function getPetState(): PetState | null {
   const data = localStorage.getItem(STORAGE_KEYS.PET_STATE);
-  if (!data) return null;
+  if (false) return null;
 
   const serialized: SerializedPetState = JSON.parse(data);
killedBy: storage/pet returns null when pet state is missing
statusReason: Cannot read properties of null (reading 'isMinimized')

[Killed] BooleanLiteral
src/utils/storage/pet.ts:6:7
 
 export function getPetState(): PetState | null {
   const data = localStorage.getItem(STORAGE_KEYS.PET_STATE);
-  if (!data) return null;
+  if (data) return null;
 
   const serialized: SerializedPetState = JSON.parse(data);
killedBy: storage/pet returns null when pet state is missing
statusReason: Cannot read properties of null (reading 'isMinimized')

[Killed] ObjectLiteral
src/utils/storage/pet.ts:9:10
   if (!data) return null;
 
   const serialized: SerializedPetState = JSON.parse(data);
-  return {
-    ...serialized,
-    // Migration: add default values for new fields if they don't exist
-    isMinimized: serialized.isMinimized ?? false,
-    minimizedPosition: serialized.minimizedPosition ?? { x: 92, y: 2 },
-    createdAt: new Date(serialized.createdAt),
-    lastFedAt: new Date(serialized.lastFedAt),
-    lastInteractedAt: new Date(serialized.lastInteractedAt),
-    lastDecayCalculatedAt: new Date(serialized.lastDecayCalculatedAt),
-  };
+  return {};
 }
 
killedBy: storage/pet hydrates dates and migrates missing minimized fields
statusReason: expected undefined to be an instance of Date

[Killed] BooleanLiteral
src/utils/storage/pet.ts:12:44
   return {
     ...serialized,
     // Migration: add default values for new fields if they don't exist
-    isMinimized: serialized.isMinimized ?? false,
+    isMinimized: serialized.isMinimized ?? true,
     minimizedPosition: serialized.minimizedPosition ?? { x: 92, y: 2 },
     createdAt: new Date(serialized.createdAt),
killedBy: storage/pet hydrates dates and migrates missing minimized fields
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/utils/storage/pet.ts:12:18
   return {
     ...serialized,
     // Migration: add default values for new fields if they don't exist
-    isMinimized: serialized.isMinimized ?? false,
+    isMinimized: serialized.isMinimized && false,
     minimizedPosition: serialized.minimizedPosition ?? { x: 92, y: 2 },
     createdAt: new Date(serialized.createdAt),
killedBy: storage/pet hydrates dates and migrates missing minimized fields
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/utils/storage/pet.ts:13:24
     ...serialized,
     // Migration: add default values for new fields if they don't exist
     isMinimized: serialized.isMinimized ?? false,
-    minimizedPosition: serialized.minimizedPosition ?? { x: 92, y: 2 },
+    minimizedPosition: serialized.minimizedPosition && {
+  x: 92,
+  y: 2
+},
     createdAt: new Date(serialized.createdAt),
     lastFedAt: new Date(serialized.lastFedAt),
killedBy: storage/pet hydrates dates and migrates missing minimized fields
statusReason: expected undefined to deeply equal { x: 92, y: 2 }

[Killed] BlockStatement
src/utils/storage/pet.ts:21:51
   };
 }
 
-export function savePetState(pet: PetState): void {
-  const serialized: SerializedPetState = {
-    ...pet,
-    createdAt: pet.createdAt.toISOString(),
-    lastFedAt: pet.lastFedAt.toISOString(),
-    lastInteractedAt: pet.lastInteractedAt.toISOString(),
-    lastDecayCalculatedAt: pet.lastDecayCalculatedAt.toISOString(),
-  };
-  localStorage.setItem(STORAGE_KEYS.PET_STATE, JSON.stringify(serialized));
-}
+export function savePetState(pet: PetState): void {}
 
killedBy: storage/pet serializes date fields to ISO when saving
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
