[Killed] BlockStatement
src/utils/storage/rsip.ts:16:44
   createdAt: string;
 }
 
-export function getRSIPNodes(): RSIPNode[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_NODES);
-  if (!data) return [];
-
-  return JSON.parse(data).map(
-    (node: RawNodeData & Record<string, unknown>) => ({
-      ...node,
-      createdAt: new Date(node.createdAt),
-      phaseStartedAt:
-        typeof node.phaseStartedAt === 'string'
-          ? new Date(node.phaseStartedAt)
-          : undefined,
-      lastExecutedAt:
-        typeof node.lastExecutedAt === 'string'
-          ? new Date(node.lastExecutedAt)
-          : undefined,
-      lastViolatedAt:
-        typeof node.lastViolatedAt === 'string'
-          ? new Date(node.lastViolatedAt)
-          : undefined,
-    }),
-  );
-}
+export function getRSIPNodes(): RSIPNode[] {}
 
 export function saveRSIPNodes(nodes: RSIPNode[]): void {
killedBy: storage/rsip returns empty RSIP nodes when storage is empty
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:18:7
 
 export function getRSIPNodes(): RSIPNode[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_NODES);
-  if (!data) return [];
+  if (false) return [];
 
   return JSON.parse(data).map(
killedBy: storage/rsip returns empty RSIP nodes when storage is empty
statusReason: Cannot read properties of null (reading 'map')

[Killed] BooleanLiteral
src/utils/storage/rsip.ts:18:7
 
 export function getRSIPNodes(): RSIPNode[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_NODES);
-  if (!data) return [];
+  if (data) return [];
 
   return JSON.parse(data).map(
killedBy: storage/rsip returns empty RSIP nodes when storage is empty
statusReason: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/utils/storage/rsip.ts:21:5
   if (!data) return [];
 
   return JSON.parse(data).map(
-    (node: RawNodeData & Record<string, unknown>) => ({
-      ...node,
-      createdAt: new Date(node.createdAt),
-      phaseStartedAt:
-        typeof node.phaseStartedAt === 'string'
-          ? new Date(node.phaseStartedAt)
-          : undefined,
-      lastExecutedAt:
-        typeof node.lastExecutedAt === 'string'
-          ? new Date(node.lastExecutedAt)
-          : undefined,
-      lastViolatedAt:
-        typeof node.lastViolatedAt === 'string'
-          ? new Date(node.lastViolatedAt)
-          : undefined,
-    }),
+    () => undefined,
   );
 }
killedBy: storage/rsip hydrates RSIP node createdAt as Date
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/utils/storage/rsip.ts:25:9
       ...node,
       createdAt: new Date(node.createdAt),
       phaseStartedAt:
-        typeof node.phaseStartedAt === 'string'
+        typeof node.phaseStartedAt !== 'string'
           ? new Date(node.phaseStartedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected undefined to deeply equal 2026-02-02T00:00:00.000Z

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:25:9
       ...node,
       createdAt: new Date(node.createdAt),
       phaseStartedAt:
-        typeof node.phaseStartedAt === 'string'
+        true
           ? new Date(node.phaseStartedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected 1970-01-01T00:00:00.123Z to be undefined

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:29:9
           ? new Date(node.phaseStartedAt)
           : undefined,
       lastExecutedAt:
-        typeof node.lastExecutedAt === 'string'
+        true
           ? new Date(node.lastExecutedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected 1970-01-01T00:00:00.000Z to be undefined

[Killed] EqualityOperator
src/utils/storage/rsip.ts:29:9
           ? new Date(node.phaseStartedAt)
           : undefined,
       lastExecutedAt:
-        typeof node.lastExecutedAt === 'string'
+        typeof node.lastExecutedAt !== 'string'
           ? new Date(node.lastExecutedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected undefined to deeply equal 2026-02-03T00:00:00.000Z

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:33:9
           ? new Date(node.lastExecutedAt)
           : undefined,
       lastViolatedAt:
-        typeof node.lastViolatedAt === 'string'
+        true
           ? new Date(node.lastViolatedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected Invalid Date to be undefined

[Killed] EqualityOperator
src/utils/storage/rsip.ts:33:9
           ? new Date(node.lastExecutedAt)
           : undefined,
       lastViolatedAt:
-        typeof node.lastViolatedAt === 'string'
+        typeof node.lastViolatedAt !== 'string'
           ? new Date(node.lastViolatedAt)
           : undefined,
killedBy: storage/rsip hydrates optional RSIP node dates when stored as strings
statusReason: expected undefined to deeply equal 2026-02-04T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:40:56
   );
 }
 
-export function saveRSIPNodes(nodes: RSIPNode[]): void {
-  localStorage.setItem(STORAGE_KEYS.RSIP_NODES, JSON.stringify(nodes));
-}
+export function saveRSIPNodes(nodes: RSIPNode[]): void {}
 
 export function getRSIPMeta(): RSIPMeta {
killedBy: storage/rsip saves RSIP nodes JSON
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:46:7
 
 export function getRSIPMeta(): RSIPMeta {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_META);
-  if (!data) return {};
+  if (false) return {};
 
   const parsed = JSON.parse(data) as {
killedBy: storage/rsip returns default empty meta when storage is missing
statusReason: Cannot read properties of null (reading 'lastAddedAt')

[Killed] BooleanLiteral
src/utils/storage/rsip.ts:46:7
 
 export function getRSIPMeta(): RSIPMeta {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_META);
-  if (!data) return {};
+  if (data) return {};
 
   const parsed = JSON.parse(data) as {
killedBy: storage/rsip returns default empty meta when storage is missing
statusReason: Cannot read properties of null (reading 'lastAddedAt')

[Killed] BlockStatement
src/utils/storage/rsip.ts:72:52
   } as RSIPMeta;
 }
 
-export function saveRSIPMeta(meta: RSIPMeta): void {
-  localStorage.setItem(
-    STORAGE_KEYS.RSIP_META,
-    JSON.stringify({
-      ...meta,
-      lastAddedAt: meta.lastAddedAt
-        ? meta.lastAddedAt.toISOString()
-        : undefined,
-      lastTreeOpenedAt: meta.lastTreeOpenedAt
-        ? meta.lastTreeOpenedAt.toISOString()
-        : undefined,
-      currentRunStartedAt: meta.currentRunStartedAt
-        ? meta.currentRunStartedAt.toISOString()
-        : undefined,
-      allowMultiplePerDay: !!meta.allowMultiplePerDay,
-    }),
-  );
-}
+export function saveRSIPMeta(meta: RSIPMeta): void {}
 
 function parseDate<T extends Record<string, unknown>>(
killedBy: storage/rsip serializes meta dates with safe boolean fallback
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ObjectLiteral
src/utils/storage/rsip.ts:75:20
 export function saveRSIPMeta(meta: RSIPMeta): void {
   localStorage.setItem(
     STORAGE_KEYS.RSIP_META,
-    JSON.stringify({
-      ...meta,
-      lastAddedAt: meta.lastAddedAt
-        ? meta.lastAddedAt.toISOString()
-        : undefined,
-      lastTreeOpenedAt: meta.lastTreeOpenedAt
-        ? meta.lastTreeOpenedAt.toISOString()
-        : undefined,
-      currentRunStartedAt: meta.currentRunStartedAt
-        ? meta.currentRunStartedAt.toISOString()
-        : undefined,
-      allowMultiplePerDay: !!meta.allowMultiplePerDay,
-    }),
+    JSON.stringify({}),
   );
 }
killedBy: storage/rsip serializes meta dates with safe boolean fallback
statusReason: expected '{}' to contain '2026-02-03T00:00:00.000Z'

[Killed] BooleanLiteral
src/utils/storage/rsip.ts:86:29
       currentRunStartedAt: meta.currentRunStartedAt
         ? meta.currentRunStartedAt.toISOString()
         : undefined,
-      allowMultiplePerDay: !!meta.allowMultiplePerDay,
+      allowMultiplePerDay: !meta.allowMultiplePerDay,
     }),
   );
killedBy: storage/rsip serializes meta dates with safe boolean fallback
statusReason: expected '{"lastAddedAt":"2026-02-03T00:00:00.0…' to contain '"allowMultiplePerDay":false'

[Killed] BlockStatement
src/utils/storage/rsip.ts:94:21
 function parseDate<T extends Record<string, unknown>>(
   value: T,
   key: keyof T,
-): Date | undefined {
-  const raw = value[key];
-  if (typeof raw !== 'string') return undefined;
-  const date = new Date(raw);
-  return Number.isNaN(date.getTime()) ? undefined : date;
-}
+): Date | undefined {}
 
 export function getRSIPGroups(): RSIPNodeGroup[] {
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: expected 2026-03-07T09:30:00.000Z to deeply equal 2026-02-05T00:00:00.000Z

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:96:7
   key: keyof T,
 ): Date | undefined {
   const raw = value[key];
-  if (typeof raw !== 'string') return undefined;
+  if (false) return undefined;
   const date = new Date(raw);
   return Number.isNaN(date.getTime()) ? undefined : date;
killedBy: storage/rsip hydrates and saves RSIP policy library entries with lastActiveAt fallback
statusReason: expected 1970-01-01T00:00:00.000Z to deeply equal 2026-03-07T10:00:00.000Z

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:96:7
   key: keyof T,
 ): Date | undefined {
   const raw = value[key];
-  if (typeof raw !== 'string') return undefined;
+  if (true) return undefined;
   const date = new Date(raw);
   return Number.isNaN(date.getTime()) ? undefined : date;
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: expected 2026-03-07T09:30:00.000Z to deeply equal 2026-02-05T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:101:50
   return Number.isNaN(date.getTime()) ? undefined : date;
 }
 
-export function getRSIPGroups(): RSIPNodeGroup[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_GROUPS);
-  if (!data) return [];
-
-  return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
-    ...(group as unknown as RSIPNodeGroup),
-    createdAt: parseDate(group, 'createdAt') ?? new Date(),
-  }));
-}
+export function getRSIPGroups(): RSIPNodeGroup[] {}
 
 export function saveRSIPGroups(groups: RSIPNodeGroup[]): void {
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/utils/storage/rsip.ts:103:7
 
 export function getRSIPGroups(): RSIPNodeGroup[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_GROUPS);
-  if (!data) return [];
+  if (data) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:103:7
 
 export function getRSIPGroups(): RSIPNodeGroup[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_GROUPS);
-  if (!data) return [];
+  if (false) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/utils/storage/rsip.ts:105:62
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_GROUPS);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
-    ...(group as unknown as RSIPNodeGroup),
-    createdAt: parseDate(group, 'createdAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map(() => undefined);
 }
 
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: expected undefined to deeply equal 2026-02-05T00:00:00.000Z

[Killed] ObjectLiteral
src/utils/storage/rsip.ts:105:74
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_GROUPS);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
-    ...(group as unknown as RSIPNodeGroup),
-    createdAt: parseDate(group, 'createdAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({}));
 }
 
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: expected undefined to deeply equal 2026-02-05T00:00:00.000Z

[Killed] LogicalOperator
src/utils/storage/rsip.ts:107:16
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((group) => ({
     ...(group as unknown as RSIPNodeGroup),
-    createdAt: parseDate(group, 'createdAt') ?? new Date(),
+    createdAt: parseDate(group, 'createdAt') && new Date(),
   }));
 }
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: expected 2026-03-07T09:30:00.000Z to deeply equal 2026-02-05T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:111:63
   }));
 }
 
-export function saveRSIPGroups(groups: RSIPNodeGroup[]): void {
-  localStorage.setItem(STORAGE_KEYS.RSIP_GROUPS, JSON.stringify(groups));
-}
+export function saveRSIPGroups(groups: RSIPNodeGroup[]): void {}
 
 export function getRSIPPolicyLibrary(): RSIPLibraryEntry[] {
killedBy: storage/rsip hydrates and saves RSIP groups with createdAt fallback when date is invalid
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/rsip.ts:115:60
   localStorage.setItem(STORAGE_KEYS.RSIP_GROUPS, JSON.stringify(groups));
 }
 
-export function getRSIPPolicyLibrary(): RSIPLibraryEntry[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_POLICY_LIBRARY);
-  if (!data) return [];
-
-  return (JSON.parse(data) as Record<string, unknown>[]).map((entry) => ({
-    ...(entry as unknown as RSIPLibraryEntry),
-    lastActiveAt: parseDate(entry, 'lastActiveAt') ?? new Date(),
-  }));
-}
+export function getRSIPPolicyLibrary(): RSIPLibraryEntry[] {}
 
 export function saveRSIPPolicyLibrary(entries: RSIPLibraryEntry[]): void {
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:117:7
 
 export function getRSIPPolicyLibrary(): RSIPLibraryEntry[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_POLICY_LIBRARY);
-  if (!data) return [];
+  if (false) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((entry) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:117:7
 
 export function getRSIPPolicyLibrary(): RSIPLibraryEntry[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_POLICY_LIBRARY);
-  if (!data) return [];
+  if (true) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((entry) => ({
killedBy: storage/rsip hydrates and saves RSIP policy library entries with lastActiveAt fallback
statusReason: expected undefined to deeply equal 2026-02-06T00:00:00.000Z

[Killed] ArrowFunction
src/utils/storage/rsip.ts:119:62
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_POLICY_LIBRARY);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((entry) => ({
-    ...(entry as unknown as RSIPLibraryEntry),
-    lastActiveAt: parseDate(entry, 'lastActiveAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map(() => undefined);
 }
 
killedBy: storage/rsip hydrates and saves RSIP policy library entries with lastActiveAt fallback
statusReason: expected undefined to deeply equal 2026-02-06T00:00:00.000Z

[Killed] LogicalOperator
src/utils/storage/rsip.ts:121:19
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((entry) => ({
     ...(entry as unknown as RSIPLibraryEntry),
-    lastActiveAt: parseDate(entry, 'lastActiveAt') ?? new Date(),
+    lastActiveAt: parseDate(entry, 'lastActiveAt') && new Date(),
   }));
 }
killedBy: storage/rsip hydrates and saves RSIP policy library entries with lastActiveAt fallback
statusReason: expected 2026-03-07T10:00:00.000Z to deeply equal 2026-02-06T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:125:74
   }));
 }
 
-export function saveRSIPPolicyLibrary(entries: RSIPLibraryEntry[]): void {
-  localStorage.setItem(
-    STORAGE_KEYS.RSIP_POLICY_LIBRARY,
-    JSON.stringify(entries),
-  );
-}
+export function saveRSIPPolicyLibrary(entries: RSIPLibraryEntry[]): void {}
 
 export function getRSIPRunHistory(): RSIPRunRecord[] {
killedBy: storage/rsip hydrates and saves RSIP policy library entries with lastActiveAt fallback
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/rsip.ts:132:54
   );
 }
 
-export function getRSIPRunHistory(): RSIPRunRecord[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_RUN_HISTORY);
-  if (!data) return [];
-
-  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
-    ...(record as unknown as RSIPRunRecord),
-    startedAt: parseDate(record, 'startedAt') ?? new Date(),
-    endedAt: parseDate(record, 'endedAt'),
-  }));
-}
+export function getRSIPRunHistory(): RSIPRunRecord[] {}
 
 export function saveRSIPRunHistory(records: RSIPRunRecord[]): void {
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:134:7
 
 export function getRSIPRunHistory(): RSIPRunRecord[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_RUN_HISTORY);
-  if (!data) return [];
+  if (false) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:134:7
 
 export function getRSIPRunHistory(): RSIPRunRecord[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_RUN_HISTORY);
-  if (!data) return [];
+  if (true) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
killedBy: storage/rsip hydrates and saves RSIP run history with endedAt preserved and invalid startedAt fallback
statusReason: expected undefined to deeply equal 2026-02-01T00:00:00.000Z

[Killed] ArrowFunction
src/utils/storage/rsip.ts:136:62
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_RUN_HISTORY);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
-    ...(record as unknown as RSIPRunRecord),
-    startedAt: parseDate(record, 'startedAt') ?? new Date(),
-    endedAt: parseDate(record, 'endedAt'),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map(() => undefined);
 }
 
killedBy: storage/rsip hydrates and saves RSIP run history with endedAt preserved and invalid startedAt fallback
statusReason: expected undefined to deeply equal 2026-02-01T00:00:00.000Z

[Killed] LogicalOperator
src/utils/storage/rsip.ts:138:16
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
     ...(record as unknown as RSIPRunRecord),
-    startedAt: parseDate(record, 'startedAt') ?? new Date(),
+    startedAt: parseDate(record, 'startedAt') && new Date(),
     endedAt: parseDate(record, 'endedAt'),
   }));
killedBy: storage/rsip hydrates and saves RSIP run history with endedAt preserved and invalid startedAt fallback
statusReason: expected 2026-03-07T11:00:00.000Z to deeply equal 2026-02-01T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:143:68
   }));
 }
 
-export function saveRSIPRunHistory(records: RSIPRunRecord[]): void {
-  localStorage.setItem(STORAGE_KEYS.RSIP_RUN_HISTORY, JSON.stringify(records));
-}
+export function saveRSIPRunHistory(records: RSIPRunRecord[]): void {}
 
 export function getRSIPTaskLinks(): RSIPTaskLink[] {
killedBy: storage/rsip hydrates and saves RSIP run history with endedAt preserved and invalid startedAt fallback
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/rsip.ts:147:52
   localStorage.setItem(STORAGE_KEYS.RSIP_RUN_HISTORY, JSON.stringify(records));
 }
 
-export function getRSIPTaskLinks(): RSIPTaskLink[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_TASK_LINKS);
-  if (!data) return [];
-
-  return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
-    ...(link as unknown as RSIPTaskLink),
-    updatedAt: parseDate(link, 'updatedAt') ?? new Date(),
-  }));
-}
+export function getRSIPTaskLinks(): RSIPTaskLink[] {}
 
 export function saveRSIPTaskLinks(links: RSIPTaskLink[]): void {
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/utils/storage/rsip.ts:149:7
 
 export function getRSIPTaskLinks(): RSIPTaskLink[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_TASK_LINKS);
-  if (!data) return [];
+  if (data) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:149:7
 
 export function getRSIPTaskLinks(): RSIPTaskLink[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_TASK_LINKS);
-  if (!data) return [];
+  if (true) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
killedBy: storage/rsip hydrates and saves RSIP task links with updatedAt fallback
statusReason: expected undefined to deeply equal 2026-02-08T00:00:00.000Z

[Killed] ArrowFunction
src/utils/storage/rsip.ts:151:62
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_TASK_LINKS);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
-    ...(link as unknown as RSIPTaskLink),
-    updatedAt: parseDate(link, 'updatedAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map(() => undefined);
 }
 
killedBy: storage/rsip hydrates and saves RSIP task links with updatedAt fallback
statusReason: expected undefined to deeply equal 2026-02-08T00:00:00.000Z

[Killed] LogicalOperator
src/utils/storage/rsip.ts:153:16
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
     ...(link as unknown as RSIPTaskLink),
-    updatedAt: parseDate(link, 'updatedAt') ?? new Date(),
+    updatedAt: parseDate(link, 'updatedAt') && new Date(),
   }));
 }
killedBy: storage/rsip hydrates and saves RSIP task links with updatedAt fallback
statusReason: expected 2026-03-07T12:00:00.000Z to deeply equal 2026-02-08T00:00:00.000Z

[Killed] StringLiteral
src/utils/storage/rsip.ts:153:32
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((link) => ({
     ...(link as unknown as RSIPTaskLink),
-    updatedAt: parseDate(link, 'updatedAt') ?? new Date(),
+    updatedAt: parseDate(link, "") ?? new Date(),
   }));
 }
killedBy: storage/rsip hydrates and saves RSIP task links with updatedAt fallback
statusReason: expected 2026-03-07T12:00:00.000Z to deeply equal 2026-02-08T00:00:00.000Z

[Killed] BlockStatement
src/utils/storage/rsip.ts:157:64
   }));
 }
 
-export function saveRSIPTaskLinks(links: RSIPTaskLink[]): void {
-  localStorage.setItem(STORAGE_KEYS.RSIP_TASK_LINKS, JSON.stringify(links));
-}
+export function saveRSIPTaskLinks(links: RSIPTaskLink[]): void {}
 
 export function getRSIPExecutionRecords(): RSIPExecutionRecord[] {
killedBy: storage/rsip hydrates and saves RSIP task links with updatedAt fallback
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/rsip.ts:161:66
   localStorage.setItem(STORAGE_KEYS.RSIP_TASK_LINKS, JSON.stringify(links));
 }
 
-export function getRSIPExecutionRecords(): RSIPExecutionRecord[] {
-  const data = localStorage.getItem(STORAGE_KEYS.RSIP_EXECUTION_RECORDS);
-  if (!data) return [];
-
-  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
-    ...(record as unknown as RSIPExecutionRecord),
-    executedAt: parseDate(record, 'executedAt') ?? new Date(),
-  }));
-}
+export function getRSIPExecutionRecords(): RSIPExecutionRecord[] {}
 
 export function appendRSIPExecutionRecord(record: RSIPExecutionRecord): void {
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:163:7
 
 export function getRSIPExecutionRecords(): RSIPExecutionRecord[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_EXECUTION_RECORDS);
-  if (!data) return [];
+  if (false) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
killedBy: storage/rsip returns empty arrays for RSIP group/library/history/link/execution storage when missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
src/utils/storage/rsip.ts:163:7
 
 export function getRSIPExecutionRecords(): RSIPExecutionRecord[] {
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_EXECUTION_RECORDS);
-  if (!data) return [];
+  if (true) return [];
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected undefined to deeply equal 2026-02-09T00:00:00.000Z

[Killed] ArrowFunction
src/utils/storage/rsip.ts:165:62
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_EXECUTION_RECORDS);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
-    ...(record as unknown as RSIPExecutionRecord),
-    executedAt: parseDate(record, 'executedAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map(() => undefined);
 }
 
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected undefined to deeply equal 2026-02-09T00:00:00.000Z

[Killed] ObjectLiteral
src/utils/storage/rsip.ts:165:75
   const data = localStorage.getItem(STORAGE_KEYS.RSIP_EXECUTION_RECORDS);
   if (!data) return [];
 
-  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
-    ...(record as unknown as RSIPExecutionRecord),
-    executedAt: parseDate(record, 'executedAt') ?? new Date(),
-  }));
+  return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({}));
 }
 
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected undefined to deeply equal 2026-02-09T00:00:00.000Z

[Killed] LogicalOperator
src/utils/storage/rsip.ts:167:17
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
     ...(record as unknown as RSIPExecutionRecord),
-    executedAt: parseDate(record, 'executedAt') ?? new Date(),
+    executedAt: parseDate(record, 'executedAt') && new Date(),
   }));
 }
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected 2026-03-07T13:00:00.000Z to deeply equal 2026-02-09T00:00:00.000Z

[Killed] StringLiteral
src/utils/storage/rsip.ts:167:35
 
   return (JSON.parse(data) as Record<string, unknown>[]).map((record) => ({
     ...(record as unknown as RSIPExecutionRecord),
-    executedAt: parseDate(record, 'executedAt') ?? new Date(),
+    executedAt: parseDate(record, "") ?? new Date(),
   }));
 }
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected 2026-03-07T13:00:00.000Z to deeply equal 2026-02-09T00:00:00.000Z
