[Killed] BlockStatement
src/utils/storage/rsip.ts:171:78
   }));
 }
 
-export function appendRSIPExecutionRecord(record: RSIPExecutionRecord): void {
-  const current = getRSIPExecutionRecords();
-  current.push(record);
-  localStorage.setItem(
-    STORAGE_KEYS.RSIP_EXECUTION_RECORDS,
-    JSON.stringify(current),
-  );
-}
+export function appendRSIPExecutionRecord(record: RSIPExecutionRecord): void {}
 
killedBy: storage/rsip hydrates execution records and appends a new record
statusReason: expected [ { id: 'record-valid', …(3) }, …(1) ] to have a length of 3 but got 2
