[Killed] BlockStatement
src/utils/storage/sessions.ts:10:60
   expiresAt: string;
 }
 
-export function getScheduledSessions(): ScheduledSession[] {
-  const data = localStorage.getItem(STORAGE_KEYS.SCHEDULED_SESSIONS);
-  if (!data) return [];
-
-  return JSON.parse(data).map(
-    (session: RawSessionData & Record<string, unknown>) => ({
-      ...session,
-      auxiliarySignal: session.auxiliarySignal || '预约信号',
-      scheduledAt: new Date(session.scheduledAt),
-      expiresAt: new Date(session.expiresAt),
-    }),
-  );
-}
+export function getScheduledSessions(): ScheduledSession[] {}
 
 export function saveScheduledSessions(sessions: ScheduledSession[]): void {
killedBy: storage/sessions returns empty scheduled sessions when storage is missing
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:12:7
 
 export function getScheduledSessions(): ScheduledSession[] {
   const data = localStorage.getItem(STORAGE_KEYS.SCHEDULED_SESSIONS);
-  if (!data) return [];
+  if (true) return [];
 
   return JSON.parse(data).map(
killedBy: storage/sessions hydrates scheduled sessions and applies auxiliarySignal fallback
statusReason: Cannot read properties of undefined (reading 'scheduledAt')

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:12:7
 
 export function getScheduledSessions(): ScheduledSession[] {
   const data = localStorage.getItem(STORAGE_KEYS.SCHEDULED_SESSIONS);
-  if (!data) return [];
+  if (false) return [];
 
   return JSON.parse(data).map(
killedBy: storage/sessions returns empty scheduled sessions when storage is missing
statusReason: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/utils/storage/sessions.ts:15:5
   if (!data) return [];
 
   return JSON.parse(data).map(
-    (session: RawSessionData & Record<string, unknown>) => ({
-      ...session,
-      auxiliarySignal: session.auxiliarySignal || '预约信号',
-      scheduledAt: new Date(session.scheduledAt),
-      expiresAt: new Date(session.expiresAt),
-    }),
+    () => undefined,
   );
 }
killedBy: storage/sessions hydrates scheduled sessions and applies auxiliarySignal fallback
statusReason: Cannot read properties of undefined (reading 'scheduledAt')

[Killed] ObjectLiteral
src/utils/storage/sessions.ts:15:61
   if (!data) return [];
 
   return JSON.parse(data).map(
-    (session: RawSessionData & Record<string, unknown>) => ({
-      ...session,
-      auxiliarySignal: session.auxiliarySignal || '预约信号',
-      scheduledAt: new Date(session.scheduledAt),
-      expiresAt: new Date(session.expiresAt),
-    }),
+    (session: RawSessionData & Record<string, unknown>) => ({}),
   );
 }
killedBy: storage/sessions hydrates scheduled sessions and applies auxiliarySignal fallback
statusReason: expected undefined to be an instance of Date

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:17:24
   return JSON.parse(data).map(
     (session: RawSessionData & Record<string, unknown>) => ({
       ...session,
-      auxiliarySignal: session.auxiliarySignal || '预约信号',
+      auxiliarySignal: true,
       scheduledAt: new Date(session.scheduledAt),
       expiresAt: new Date(session.expiresAt),
killedBy: storage/sessions hydrates scheduled sessions and applies auxiliarySignal fallback
statusReason: expected true to be '预约信号' // Object.is equality

[Killed] LogicalOperator
src/utils/storage/sessions.ts:17:24
   return JSON.parse(data).map(
     (session: RawSessionData & Record<string, unknown>) => ({
       ...session,
-      auxiliarySignal: session.auxiliarySignal || '预约信号',
+      auxiliarySignal: session.auxiliarySignal && '预约信号',
       scheduledAt: new Date(session.scheduledAt),
       expiresAt: new Date(session.expiresAt),
killedBy: storage/sessions hydrates scheduled sessions and applies auxiliarySignal fallback
statusReason: expected undefined to be '预约信号' // Object.is equality

[Killed] BlockStatement
src/utils/storage/sessions.ts:24:75
   );
 }
 
-export function saveScheduledSessions(sessions: ScheduledSession[]): void {
-  localStorage.setItem(
-    STORAGE_KEYS.SCHEDULED_SESSIONS,
-    JSON.stringify(sessions),
-  );
-}
+export function saveScheduledSessions(sessions: ScheduledSession[]): void {}
 
 export function getActiveSession(): ActiveSession | null {
killedBy: storage/sessions saves scheduled sessions as JSON
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/sessions.ts:31:58
   );
 }
 
-export function getActiveSession(): ActiveSession | null {
-  const data = localStorage.getItem(STORAGE_KEYS.ACTIVE_SESSION);
-  if (!data) return null;
-
-  const session = JSON.parse(data) as Record<string, unknown> & {
-    startedAt: string;
-    pausedAt?: string | null;
-  };
-  return {
-    ...session,
-    startedAt: new Date(session.startedAt),
-    pausedAt: session.pausedAt ? new Date(session.pausedAt) : undefined,
-  } as ActiveSession;
-}
+export function getActiveSession(): ActiveSession | null {}
 
 export function saveActiveSession(session: ActiveSession | null): void {
killedBy: storage/sessions returns null active session when storage is missing
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:33:7
 
 export function getActiveSession(): ActiveSession | null {
   const data = localStorage.getItem(STORAGE_KEYS.ACTIVE_SESSION);
-  if (!data) return null;
+  if (true) return null;
 
   const session = JSON.parse(data) as Record<string, unknown> & {
killedBy: storage/sessions hydrates active session dates including optional pausedAt
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:33:7
 
 export function getActiveSession(): ActiveSession | null {
   const data = localStorage.getItem(STORAGE_KEYS.ACTIVE_SESSION);
-  if (!data) return null;
+  if (false) return null;
 
   const session = JSON.parse(data) as Record<string, unknown> & {
killedBy: storage/sessions returns null active session when storage is missing
statusReason: Cannot read properties of null (reading 'startedAt')

[Killed] BlockStatement
src/utils/storage/sessions.ts:46:72
   } as ActiveSession;
 }
 
-export function saveActiveSession(session: ActiveSession | null): void {
-  if (session) {
-    localStorage.setItem(STORAGE_KEYS.ACTIVE_SESSION, JSON.stringify(session));
-  } else {
-    localStorage.removeItem(STORAGE_KEYS.ACTIVE_SESSION);
-  }
-}
+export function saveActiveSession(session: ActiveSession | null): void {}
 
killedBy: storage/sessions clears active session key when saving null
statusReason: expected '{"chainId":"before"}' to be null

[Killed] ConditionalExpression
src/utils/storage/sessions.ts:47:7
 }
 
 export function saveActiveSession(session: ActiveSession | null): void {
-  if (session) {
+  if (true) {
     localStorage.setItem(STORAGE_KEYS.ACTIVE_SESSION, JSON.stringify(session));
   } else {
killedBy: storage/sessions clears active session key when saving null
statusReason: expected 'null' to be null

[Killed] BlockStatement
src/utils/storage/sessions.ts:47:16
 }
 
 export function saveActiveSession(session: ActiveSession | null): void {
-  if (session) {
-    localStorage.setItem(STORAGE_KEYS.ACTIVE_SESSION, JSON.stringify(session));
-  } else {
+  if (session) {} else {
     localStorage.removeItem(STORAGE_KEYS.ACTIVE_SESSION);
   }
killedBy: storage/sessions saves active session when a session object is provided
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/storage/sessions.ts:49:10
 export function saveActiveSession(session: ActiveSession | null): void {
   if (session) {
     localStorage.setItem(STORAGE_KEYS.ACTIVE_SESSION, JSON.stringify(session));
-  } else {
-    localStorage.removeItem(STORAGE_KEYS.ACTIVE_SESSION);
-  }
+  } else {}
 }
 
killedBy: storage/sessions clears active session key when saving null
statusReason: expected '{"chainId":"before"}' to be null
