[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:337:7
   function startSingleChain(chain: Chain): void {
     const existingScheduledSession = findScheduledSession(chain.id);
     const bettingSessionId =
-      pendingChainId === chain.id ? currentSessionId : null;
+      false ? currentSessionId : null;
 
     const activeSession = buildActiveSession({
killedBy: createStartChainHandler should include betting session id and zero duration for durationless chains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:350:11
 
     const updatedChains = existingScheduledSession
       ? state.chains.map((item) =>
-          item.id === chain.id
+          false
             ? { ...item, auxiliaryStreak: item.auxiliaryStreak + 1 }
             : item,
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
hooks/domains/sessions/start.ts:356:9
         )
       : state.chains;
 
-    if (existingScheduledSession) {
+    if (false) {
       void systemNotificationService.notifyTaskCompleted(
         chain.name,
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called with arguments: [ 'Schedulable', 2, …(1) ]

Number of calls: 0

[Killed] BlockStatement
hooks/domains/sessions/start.ts:366:35
 
     persistActiveSession(chain.id, activeSession);
     persistScheduledSessions(chain.id, updatedScheduledSessions);
-    if (existingScheduledSession) {
-      persistChains(chain.id, updatedChains);
-    }
+    if (existingScheduledSession) {}
 
     setState((prev) => ({
killedBy: createStartChainHandler should consume scheduled session and increment auxiliary streak when starting chain
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
hooks/domains/sessions/start.ts:384:9
     if (await maybeStartBettingSession(chainId)) return;
 
     const chain = findChain(chainId);
-    if (!chain) return;
+    if (chain) return;
 
     if (chain.type === 'group') {
killedBy: createStartChainHandler should start a local unit chain and switch to focus view
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
