[Killed] ConditionalExpression
src/hooks/domains/useChainsDomain.ts:136:44
   };
 
   const handleEditChain = (chainId: string) => {
-    const chain = state.chains.find((c) => c.id === chainId);
+    const chain = state.chains.find((c) => false);
     if (chain) {
       const isTaskGroup = chain.type === 'group' || chain.isTaskGroup;
killedBy: useChainsDomain should route group chain edit to taskgroup editor
statusReason: expected 'dashboard' to be 'taskgroup-editor' // Object.is equality
