[Killed] ConditionalExpression
src/utils/chain-tree/groupOperations.ts:95:9
 ): Chain[] => {
   // 首先增加任务群的完成计数
   const updatedChains = chains.map((chain) => {
-    if (chain.id === groupId && chain.type === 'group') {
+    if (true && chain.type === 'group') {
       return {
         ...chain,
killedBy: chain-tree/groupOperations increments group completion and resets descendant unit progress
statusReason: expected 3 to be 2 // Object.is equality
